{
  "school_name": "香港教育大学",
  "major_name": "数字学习与科技文学硕士",
  "ename": "MA Digital Learning and Technology",
  "tags": "社科,教育,教育与人类发展学院",
  "introduction": "专业方向: 教育\n入学时间: 9月\n项目时长: 1年\n项目学费: 159960港币/年",
  "requirements": "申请者通常应持有认可大学颁发的学士学位或同等学历，入围申请者可能需要参加面试",
  "objectives": "香港教育大学数字学习与科技文学硕士课程旨在帮助教育工作者及专业人士配合自己的兴趣和工作所需，在不同学科和情景中设计及应用数字技术，转化各种教育体验。课程重视实践及应用，除了设有两个实务研究和应用科目，更有四个方向可供选择，分别是教育和社会企业、数字媒体与媒体素养、科技领域以及语言学习。\n在教育和社会企业中，数字技术可以提供不同的学习机会，改善合作并提高生产力和推动创新，教育和社会企业方向着重于在这类工作环境中应用数字学习和信息技术，帮助学生建立领导力，在教育和社会企业利用科技提升服务和推动革新，选修内容也会涵盖大数据和数据可视化等。数字媒体与媒体素养方向着重培养学生在数字媒体上的分析、创建和教与学的能力，了解各种电子教学资源的应用，以及为不同的学习情景提供支援，例如利用元宇宙策划线上展览和促进视觉艺术学习，在音乐教育应用教育科技以及当代数字媒体实践等等。科技领域方向则会帮助教师、行政人员、电子学习设计人员和任何对教育感兴趣的人士更加深入了解各种教学科技，例如创意多媒体设计、人工智能、手机应用程式设计和元宇宙，学习如何把这些教学科技应用在教育和社会环境中，改善学与教的体验。数字学习和信息技术也有助于提升中英文学习的效能，语言学习方向可以帮助学生从中英语言学习、文学和语言学的角度，探讨和应用各种电子教学工具和教学法，分析语言数据、各种形式的文学和语言学习，在学校环境中优化数字科技的使用和促进数字素养。",
  "language_requirements": "{{ per_lang.name }}",
  "curriculum": "改变教学、学习与评估的数字领导力与科技 (Digital Leadership and Technologies to Transform Instruction, Learning and Evaluation)\n将数字技术应用于不同的学科和环境 (Apply Digital Technologies to Diverse Disciplines and Contexts)\n未来公民的数字素养 (Digital Literacy for Future Citizenship)\n毕业项目 (Capstone Project)\n数字学习与科技的国际视角 (International Perspectives on Digital Learning and Technology)\n教育和社会企业的数字创新设计 (Designing Digital Innovation in Educational and Social Enterprises)\n教育和社会组织的数字化转型 (Digital Transformation in Educational and Social Organisations)\n使用移动通信技术进行有效的教与学 (Effective Teaching and Learning Using Mobile Technologies)\n教育和社会企业的数字福利 (Digital Well-being for Education and Social Enterprises)\n策划视觉艺术学习在线展览 (Curating Online Exhibitions for Visual Arts Learning)\n人类科技互动与数字媒体素养 (Human Technology Interactions and Digital Media Literacy)\n音乐教与学中的技术 (Technology in Music Teaching and Learning)\n当代数字媒体与实践 (Contemporary Digital Media and Practices)\n创意多媒体与设计 (Creative Multimedia and Design)\n移动应用程序设计与开发 (Mobile Applications Design and Development)\n教育中的人工智能 (Artificial Intelligence in Education)\n教育与社会中的元宇宙 (Metaverse in Education and Society)\n汉语学习中的数字素养 (Digital Literacy in Chinese Language Learning)\n数字素养与英语教学 (Digital Literacy and English Language Teaching)\n英语文学与数据分析 (English Literature and Data Analytics)\n语言研究的数字技术 (Digital Technology for Language Studies)",
  "success_cases": ""
}