{
  "school_name": "香港城市大学",
  "major_name": "中国语言文学与历史文学硕士",
  "ename": "MA Chinese and History",
  "tags": "社科,文化,人文与社会科学学院",
  "introduction": "专业方向: 文化\n入学时间: 9月\n项目时长: 1年\n项目学费: 186000港币/年",
  "requirements": "要符合入学资格，申请者必须：\n持有由大学教育资助委员会资助的香港高等教育院校颁发的学位；或\n持有由认可的本地或非本地院校颁发的相当于上述级别的学位；或\n符合大学认可的专业机构企业会员的学术要求；或\n已获得大学接受的同等资格，或能够提供为大学所接受的学术和专业成就的证据。\n申请者必须满足下列特定的中文语言要求：\n(a) 已修毕至少一门30小时或以上的高等教育中文课程，其中包括大量书面中文内容；或\n(b) 香港高级程度会考中国语文科达D级或以上，或香港中学文凭考试中国语文科达4级或以上，或取得同等成绩。\n申请者若无法提供第(a)项或第(b)项的证明文件，则需参加中文写作及阅读的入学考试，并达到与第(b)项相当的水平。申请者必须通过此入学考试以符合上述具体要求。\n优先考虑具备一年或以上相关工作经验的申请者",
  "objectives": "香港城市大学中国语言文学与历史文学硕士课程配合学员真切需要，学员可按个人兴趣和工作所需选择专修中国语言文学、中国史或中国史与文化遗产，中国语言文学方向适合有志于从事中小学中国语文教育或其他文化事业的学员修读，中国史/中国史与文化遗产方向可配合中国历史成为香港初中独立必修科的教学需要（2018/19学年落实），并回应2021年《粤港澳大湾区文化和旅游发展规划》出台后，大湾区内三大世界文化和自然遗产、数以百计的文化机构与博物馆对相关专门人才的急切需求。\n香港城市大学中国语言文学与历史文学硕士课程学术性与实用性并重，中国语言文学方向的必修科与选修科内容涵盖中国古典文学、中国现当代文学、中国文学批评、香港文学与文化、创意写作，以及中国文学与性别、宗教、美术等多个专题研究，均衡发展，无论研究、教学、应世，皆能深造自得，游刃有余。中国史/中国史与文化遗产方向的必修科与选修科内容涵盖史学与史料、文化遗产的理念与实践、中国考古与早期文明、文化史、医疗文化史、中外交流史、博物馆学、文化及创意产业、中国建筑园林、香港城市景观与文物保育等多个专题研究，内容多元深入，无论是出于个人兴趣、研究或工作需要，均无往而不利。",
  "language_requirements": "{{ per_lang.name }}",
  "curriculum": "汉语基本概念 ( Essential Concepts in Chinese Language )\n中国文化的基本概念 ( Essential Concepts in Chinese Culture )\n中国语言结构 ( Chinese Linguistic Structures )\n粤语语言学 ( Cantonese Linguistics )\n汉学精选读物 ( Selected Readings in Sinology )\n中国文学史哲学名著 ( Great Works of Chinese Literature, History and Philosophy )\n政府和公共行政汉语 ( Chinese for Government and Public Administration )\n政府和公共管理中文专题 ( Special Topics in Chinese for Government and Public Administration )\n商务汉语 ( Business Chinese )\n商务汉语专题 ( Special Topics in Business Chinese )\n媒体中文专题 ( Special Topics in Chinese for the Media)\n中国创意写作专题 ( Special Topics in Chinese Creative Writing )\n中文速写，中国古典散文和诗歌写作研讨会 ( Writing Workshop in Chinese Couplet, Classical Chinese Prose and Verse )\n粤语与普通话的对比研究 ( Contrastive Studies of Cantonese and Putonghua )\n中国语言文学专题 ( Special Topics in Chinese Language and Literature )\n香港文学与文化主题研究 ( Topic Studies in Hong Kong Literature and Culture )\n中国文学的性别视角 ( Gender Perspective on Chinese Literature )\n中国文学与宗教专题 ( Special Topics in Chinese Literature and Religion )\n硕士项目 ( Master's Project )\n专业汉语研讨会 ( Seminar on Chinese for Professional Purposes )\n专业汉语前沿话题 ( Advanced Topics in Chinese for Professional Purposes )",
  "success_cases": ""
}