{
  "school_name": "伦敦大学学院",
  "major_name": "人类学与专业实践理学硕士",
  "ename": "MSc Anthropology and Professional Practice",
  "tags": "社科,社会学与社工,社会与历史科学学院",
  "introduction": "专业方向: 社会学与社工\n入学时间: 9月\n项目时长: 1年\n项目学费: 33000英镑/年",
  "requirements": "具有英国大学颁发的2:1学士学位或同等学历，不限专业背景\n具有英国大学颁发的任意学科2:2学士学位或同等学历以及至少2年工作经验的申请者也可能被考虑\n学校热衷于吸引来自最广泛背景的申请者，因此不会将入学要求限制在特定学科范围内。入学标准将由项目主管根据申请者的专业经验概述、个人陈述中的学习理由以及本科学位的授予和学科自行决定",
  "objectives": "伦敦大学学院人类学与专业实践理学硕士项目可以训练学生在一系列专业环境中使用人类学概念和方法。该计划旨在大幅提高学生的技能组合和专业形象，其独特之处在于其外向型使命，即探索和展示人类学观点和见解与现实世界问题和专业挑战的相关性。它在学术人类学和不同的行业环境之间架起了一座桥梁，为学生提供了无与伦比的机会，可以以直接提高他们在工作世界中的职业目标的方式应用见解和技能。\n伦敦大学学院人类学与专业实践理学硕士项目由世界领先的专家团队授课，他们在不同专业环境中拥有适应人类学思维方式和解决问题的直接经验。它由 UCL 人类学的员工管理，该大学在2022 年 QS 世界大学学科排名中排名第四，使其成为伦敦排名第一的机构，在该学科在英国和欧洲排名第三。虽然许多课程的模块将在 UCL 的布卢姆斯伯里校区进行，但该课程的所在地是UCL East，这是 UCL 在伦敦伊丽莎白女王奥林匹克公园令人兴奋的新校区，致力于跨学科教学以及面向社区和行业的研究.\n除了利用作为 UCL East 愿景和运营核心的学术界和专业界之间的多样化交叉，参加伦敦大学学院人类学与专业实践理学硕士项目的学生还将获得为期一年的支持，以发展自己的职业抱负。该计划坚持不懈地我们学生的就业能力，为现场工作场所研究提供定制支持，为学生提供定期投入以及来自相关行业专家的个人指导。该计划为学生提供行业特定的演示和研究技能，让学生进入应用人类学研究和洞察力的专业实践。",
  "language_requirements": "{{ per_lang.name }}",
  "curriculum": "民族志方法 (Method in Ethnography)\n企业日常道德 (Everyday Ethics in Enterprise)\n人类学和专业实践：计划项目 (Anthropology and Professional Practice: Programme Project)\n理论、民族志和专业实践 (Theory, Ethnography and Professional Practice)\n像人类学家一样思考 (Thinking like an Anthropologist)\n犯罪人类学 (Anthropology of Crime)\n社交媒体人类学 (The Anthropology of Social Media)\n民族主义、民族和种族的人类学 (The Anthropology of Nationalism, Ethnicity and Race)\n资本主义人类学 (Anthropology of Capitalisms)\n设计人类学 (Design Anthropology)\n公共领域的艺术 (Art in the Public Sphere)\n纪录片电台 - 基于实践的介绍 (Documentary Radio - A Practice-Based Introduction)\n实用纪录片制作 (Practical Documentary Filmmaking)\n多媒体世界中的专题写作：数字时代的新闻技巧 (Feature Writing in a Multi-media World: Journalistic Skills for the Digital Age)\n移民与健康 (Migration and Health)\n应用民族志 (Applied Ethnography)\n应用医学人类学的各个方面 (Aspects of Applied Medical Anthropology)\n社会研究统计学导论 (Introduction to Statistics for Social Research)",
  "success_cases": ""
}