{
  "department": "Department of Information Systems and Analytics",
  "total_count": 41,
  "professors": [
    {
      "name": "GOH Khim Yong",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/gohky",
      "appointment": "Professor",
      "additional_titles": [
        "Head, Department Of Information Systems and Analytics",
        "Vice Dean, Communications (2019-2021)",
        "Vice Dean, Corporate Relations (2016-2019)",
        "Deputy Head, Department of Information Systems and Analytics (2015-2016)",
        "Assistant Dean, Corporate Relations (2014-2015)"
      ],
      "office": "COM2-04-33",
      "phone": "651 62832",
      "email": "gohky@comp.nus.edu.sg",
      "personal_page": "http://www.comp.nus.edu.sg/~gohky",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/gohky.jpg",
      "profile": "Dr. Goh Khim Yong is a Professor of Information Systems and Head of the Department of Information Systems and Analytics at the National University of Singapore (NUS). He received his PhD (2005) in Business Administration (Marketing: Economics and Quantitative Methods) from the University of Chicago, Booth School of Business. He holds a BSc (First Class Honours) degree (1997) in Computer and Information Sciences and a M.Sc. degree (1998) in Information Systems from the National University of Singapore.\n\nDr. Goh’s research and teaching interests include 1) consumer and firm behaviours in social-mobile media and platforms, 2) marketing and advertising in digital media environments, 3) pricing and product strategies in digital and AI innovations, and 4) econometric and causal impact evaluation methods. In his research and consulting activities, Dr. Goh has worked on business analytics and customer data analytics projects with various businesses and organisations from Singapore, United States, China, Japan, Korea and Australia, spanning industry vertical sectors such as e-commerce, interactive digital media, social media, news print media, retailing, advertising, government, food and beverage, healthcare and pharmaceutical sectors. These organisations include Alibaba, Lazada, iMaibo.net, Johnson and Johnson, Fox Fashion, Wing Tai Retail Pte Ltd, NUS Multi-purpose Cooperative Society Ltd, Sheng Siong Supermarket, Pastamania, Creative Eateries, Privé Group, NUS Society (NUSS), Dianping.com, Cash Slide, Sephora, Singapore Press Holdings Ltd, National University Health System (NUHS), Khoo Teck Puat Hospital, Infocomm Media Development Authority, and Workforce Development Agency.\n\nHe has received many awards and accolades for his research, teaching, and service achievements and contributions. For his research, he was awarded the International Conference on Information Systems Best Overall Conference Paper Award (2022), Best Paper in Track (Digital and Mobile Commerce) Award (2022), Best Paper in Track (Digital Innovation, Transformation, and Entrepreneurship) Award (2024), and Best Research-in-Progress Paper Award Runner-Up (2014). He is also a recipient of the China Information Economics Society, Young Scholar Innovation Award in 2016 and 2017, and a Distinguished Member of the Association for Information Systems (AIS). In teaching, he was given the National University of Singapore, Faculty Teaching Excellence Award in 2013-2014. In recognition of his service contributions to education, he was conferred the Long Service Medal in 2022 and the Public Administration Medal (Bronze) in 2025 by the Ministry of Education, Singapore.\n\nDr. Goh’s research work has been published in top-ranked international academic journals such as Information Systems Research, MISQ Quarterly, Management Science, Journal of Marketing Research, Journal of the Association for Information Systems, Production and Operations Management, ACM Transactions on Management Information Systems, IEEE Transactions on Engineering Management, Information and Management, etc. He has also presented papers at the International Conference on Information Systems (ICIS), Workshop on Information Systems and Economics (WISE), Workshop on Information Technologies and Systems (WITS), INFORMS Conference on Information Systems and Technology (CIST), INFORMS Marketing Science Conference, Academy of Management Annual Meeting (AOM), Hawaii International Conference on System Sciences (HICSS), and Statistical Challenges in Electronic Commerce Research (SCECR). He has also served in the editorial board of Information Systems Research as an Associate Editor, and in the program committees of the International Conference on Information Systems and the Pacific Asia Conference on Information Systems as an Associate Editor, Track Chair, and Program Chair.\n\nHis opinions and comments on various research findings and industry developments have also been cited in various popular news publications or channels such as the Straits Times, Channel NewsAsia, 联合早报, TODAY, MediaCorp TV Channel 8, Marketing Interactive, ZDNet Asia, Capital Ideas and Investor’s Business Daily. In his teaching engagements, Dr. Goh has instructed various students from undergraduate, post-graduate and industry executive programmes in the NUS School of Computing, Business School, School of Continuing and Lifelong Education, Strategic Technology Management Institute, Advanced Computing for Executives, Business Analytics Centre, and the University of Chicago, Booth School of Business (Executive MBA programme). He was previously involved in spearheading the development and launch of new NUS degree programmes in Business Analytics and Business Artificial Intelligence Systems.",
      "education": [
        "Ph.D. (Business Administration, Marketing: Economics & Quantitative Methods, The University of Chicago, 2005)",
        "M.Sc. (Computer & Information Sciences, National University of Singapore, 1998)",
        "B.Sc. (Computer & Information Sciences, First-Class Honours, National University of Singapore, 1997)",
        "University of Chicago, Graduate School of Business, Ph.D. Fellowship (2000-2005)",
        "University of Chicago, Joseph A. Pickler Ph.D. Fellowship (2000-2001)"
      ],
      "research_areas": [
        "Data Science & Business Analytics",
        "Digital Transformation, Platforms & Innovation",
        "FinTech",
        "Computational Social Science"
      ],
      "research_interests": [
        "Consumer and Firm Behaviors in Social-Mobile Media and Platforms",
        "Marketing and Advertising in Digital Media Environments",
        "Pricing and Product Strategies in Digital and AI Innovations",
        "Econometric and Causal Impact Evaluation Methods"
      ],
      "research_projects": [
        {
          "title": "Economics of AI Pricing on E-Commerce Platforms",
          "description": "The use of artificial intelligence (AI) pricing agents has become prevalent, with many digital platforms including e-commerce platforms (ECPs), introducing AI pricing agents to provide sellers with AI-generated price recommendations. This project aims to apply relevant theoretical perspectives to examine factors that influence AI recommendation adoption, and the impact of such adoption on ECPs.",
          "tags": [
            "Digital Transformation, Platforms & Innovation"
          ]
        },
        {
          "title": "Social-Mobile and E-Commerce Live Streaming Videos and Socio-Economic Impacts",
          "description": "Live streaming is booming across social media and e-commerce platforms. However, the dynamics of broadcaster-audience interactions and their impact on engagement and purchasing are largely unexplored. This project seeks to address this gap by examining the elements in live streaming that stimulate social presence and emotional arousal, and influence viewer engagement and consumer purchases.",
          "tags": [
            "Digital Transformation, Platforms & Innovation"
          ]
        }
      ],
      "phd_alumni": [
        {
          "name": "Guo Yutong",
          "first_placement": "Assistant Professor, Chinese University of Hong Kong (Shenzhen)",
          "graduation_year": 2023,
          "current_position": "Assistant Professor",
          "institution": "Chinese University of Hong Kong (Shenzhen)"
        },
        {
          "name": "Li Ding",
          "first_placement": "Assistant Professor, Nanjing University",
          "graduation_year": 2019,
          "current_position": "Assistant Professor",
          "institution": "Nanjing University"
        },
        {
          "name": "Zhang Ying",
          "first_placement": "Lecturer, University of Auckland",
          "graduation_year": 2019,
          "current_position": "Senior Lecturer",
          "institution": "University of Auckland"
        },
        {
          "name": "Yoon Han",
          "first_placement": "Assistant Professor, Harbin Institute of Technology",
          "graduation_year": 2018,
          "current_position": "Assistant Professor",
          "institution": "Kookmin University"
        },
        {
          "name": "Lin Zhijie",
          "first_placement": "Assistant Professor, Nanjing University",
          "graduation_year": 2013,
          "current_position": "Associate Professor",
          "institution": "Tsinghua University"
        },
        {
          "name": "Wang Qingliang",
          "first_placement": "Assistant Professor, Xi'an Jiaotong University",
          "graduation_year": 2013,
          "current_position": "Associate Professor",
          "institution": "Xi'an Jiaotong University"
        },
        {
          "name": "Wu Jing",
          "first_placement": "Assistant Professor, Southwestern University of Finance and Economics",
          "graduation_year": 2009,
          "current_position": "Professor",
          "institution": "Southwestern University of Finance and Economics"
        }
      ],
      "publications": [
        {
          "title": "Li, D., Goh, K.Y., and Heng, C.S., “Strategic Content Generation and Monetization in Financial Social Media”, Information Systems Research, 36(1), 202",
          "year": 2025,
          "full_citation": "Li, D., Goh, K.Y., and Heng, C.S., “Strategic Content Generation and Monetization in Financial Social Media”, Information Systems Research, 36(1), 2025, pp. 61-83."
        },
        {
          "title": "Guo, Y., Zhang, Y., Goh, K.Y., and Peng, X., “Can Social Technologies Drive Purchases in E-Commerce Live Streaming? An Empirical Study of Broadcasters",
          "year": 2024,
          "full_citation": "Guo, Y., Zhang, Y., Goh, K.Y., and Peng, X., “Can Social Technologies Drive Purchases in E-Commerce Live Streaming? An Empirical Study of Broadcasters’ Cognitive and Affective Social Call-To-Actions”, Production and Operations Management, 2024, forthcoming."
        },
        {
          "title": "Guo, Y., Ban, C., Yang, J., Goh, K.Y., Liu, X., Peng, X., and Li, X., “Analyzing and Predicting Consumer Response to Short Videos in E-Commerce”, ACM ",
          "year": 2024,
          "full_citation": "Guo, Y., Ban, C., Yang, J., Goh, K.Y., Liu, X., Peng, X., and Li, X., “Analyzing and Predicting Consumer Response to Short Videos in E-Commerce”, ACM Transactions on Management Information Systems, 15(4), 2024, pp. 1-23."
        },
        {
          "title": "Yang, Y., Goh, K.Y., Teo, H.H., and Tan, S.S.L., “The Impact of Air Pollution Information on Individuals’ Exercise Behavior: An Empirical Study Using ",
          "year": 2024,
          "full_citation": "Yang, Y., Goh, K.Y., Teo, H.H., and Tan, S.S.L., “The Impact of Air Pollution Information on Individuals’ Exercise Behavior: An Empirical Study Using Wearable and Mobile Devices Data”, JMIR mHealth and uHealth, 12, 2024, e55207."
        },
        {
          "title": "Han, Y., Goh, K.Y., Kim, S.H., and Phan, T.Q., “The Effect of Ad Image’s Sentiment Scores and Mobile Device Attributes on Mobile Ad Response Behavior”",
          "year": 2024,
          "full_citation": "Han, Y., Goh, K.Y., Kim, S.H., and Phan, T.Q., “The Effect of Ad Image’s Sentiment Scores and Mobile Device Attributes on Mobile Ad Response Behavior”, IEEE Transactions on Engineering Management, 71, 2024, pp. 1314-1329."
        },
        {
          "title": "Sarker, S., Whitley, E.A., Goh, K.Y., Hong, Y., Mähring, M., Sanyal, P., Su, N., Xu, H., Xu, J.D., Zhang, J., and Zhao, H., “Some Thoughts on Reviewin",
          "year": 2023,
          "full_citation": "Sarker, S., Whitley, E.A., Goh, K.Y., Hong, Y., Mähring, M., Sanyal, P., Su, N., Xu, H., Xu, J.D., Zhang, J., and Zhao, H., “Some Thoughts on Reviewing for Information Systems Research and Other Leading Information Systems Journals”, Information Systems Research, 34(4), 2023, pp. 1321-1338."
        },
        {
          "title": "Zhang, Y., Goh, K.Y., and Wang, Q., “Unraveling the Effect of Competing Product Reviews on Consumer Choice and the Moderating Role of Consumer‐Reviewe",
          "year": 2023,
          "full_citation": "Zhang, Y., Goh, K.Y., and Wang, Q., “Unraveling the Effect of Competing Product Reviews on Consumer Choice and the Moderating Role of Consumer‐Reviewer Peer Types”, IEEE Transactions on Engineering Management, 70(10), 2023, pp. 3315-3329."
        },
        {
          "title": "Yang, Y., Goh, K.Y., Teo, H.H., and Tan, S.S.L., “Compete with Me? The Impact of Online Gamified Competition on Exercise Behavior”, Journal of the Ass",
          "year": 2023,
          "full_citation": "Yang, Y., Goh, K.Y., Teo, H.H., and Tan, S.S.L., “Compete with Me? The Impact of Online Gamified Competition on Exercise Behavior”, Journal of the Association for Information Systems, 24(3), 2023, pp. 912-935."
        },
        {
          "title": "Oh, H., Goh, K.Y., and Phan, T.Q., “Are You What You Tweet? The Impact of Sentiment on Digital News Consumption and Social Media Sharing”, Information",
          "year": 2023,
          "full_citation": "Oh, H., Goh, K.Y., and Phan, T.Q., “Are You What You Tweet? The Impact of Sentiment on Digital News Consumption and Social Media Sharing”, Information Systems Research, 34(1), 2023, pp. 111-136."
        },
        {
          "title": "Li, M., Han, Y., Goh, K.Y., and Cavusoglu, H., “Mobile App Portfolio Management and Developers’ Performance: An Empirical Study of the Apple App Store",
          "year": 2022,
          "full_citation": "Li, M., Han, Y., Goh, K.Y., and Cavusoglu, H., “Mobile App Portfolio Management and Developers’ Performance: An Empirical Study of the Apple App Store”, Information and Management, 59(8), 2022, 103716."
        },
        {
          "title": "Lin, Z., Goh, K.Y., and Heng, C.S., “The Demand Effects of Product Recommendation Networks: An Empirical Analysis of Network Diversity and Stability”,",
          "year": 2017,
          "full_citation": "Lin, Z., Goh, K.Y., and Heng, C.S., “The Demand Effects of Product Recommendation Networks: An Empirical Analysis of Network Diversity and Stability”, MIS Quarterly, 41(2), 2017, pp. 397-426."
        },
        {
          "title": "Chen, Y., Bharadwaj, A., and Goh, K.Y., “An Empirical Analysis of Intellectual Property Rights Sharing in Software Development Outsourcing”, MIS Quart",
          "year": 2017,
          "full_citation": "Chen, Y., Bharadwaj, A., and Goh, K.Y., “An Empirical Analysis of Intellectual Property Rights Sharing in Software Development Outsourcing”, MIS Quarterly, 41(1), 2017, pp. 131-161."
        },
        {
          "title": "Wu, J., Li, H., Lin, Z., and Goh, K.Y., “How Big Data and Analytics Reshape the Wearable Device Market - The Context of E-Health”, International Journ",
          "year": 2017,
          "full_citation": "Wu, J., Li, H., Lin, Z., and Goh, K.Y., “How Big Data and Analytics Reshape the Wearable Device Market - The Context of E-Health”, International Journal of Production Research, 55(17), 2017, pp. 5168-5182."
        },
        {
          "title": "Wu, J., Goh, K.Y., Li, H., Luo, C., and Zheng, H., “The Effects of Communication Patterns on the Success of Open Source Software Projects: An Empirica",
          "year": 2016,
          "full_citation": "Wu, J., Goh, K.Y., Li, H., Luo, C., and Zheng, H., “The Effects of Communication Patterns on the Success of Open Source Software Projects: An Empirical Analysis from Social Network Perspectives”, Journal of Global Information Management, 24(4), 2016, pp. 22-44."
        },
        {
          "title": "Goh, K.Y., Tan, C.H., and Teo, H.H., “Stated Choice Analysis of Conditional Purchase and Information Cue Effects in Online Group Purchase”, Journal of",
          "year": 2015,
          "full_citation": "Goh, K.Y., Tan, C.H., and Teo, H.H., “Stated Choice Analysis of Conditional Purchase and Information Cue Effects in Online Group Purchase”, Journal of the Association for Information Systems, 16(9), 2015, pp. 738-765."
        },
        {
          "title": "Goh, K.Y., Chu, J., and Wu, J., “Mobile Advertising: An Empirical Study of Temporal and Spatial Differences in Search Behavior and Advertising Respons",
          "year": 2015,
          "full_citation": "Goh, K.Y., Chu, J., and Wu, J., “Mobile Advertising: An Empirical Study of Temporal and Spatial Differences in Search Behavior and Advertising Response”, Journal of Interactive Marketing, 30, 2015, pp. 34-45."
        },
        {
          "title": "Goh, K.Y., Hui, K.L., and Png, I.P.L., “Privacy and Marketing Externalities: Evidence from Do Not Call”, Management Science, 61(12), 2015, pp. 2982-30",
          "year": 2015,
          "full_citation": "Goh, K.Y., Hui, K.L., and Png, I.P.L., “Privacy and Marketing Externalities: Evidence from Do Not Call”, Management Science, 61(12), 2015, pp. 2982-3000."
        },
        {
          "title": "Chen, J., Chen, J., Goh, K.Y., Xu, Y., and Tan, B.C.Y., “When Do Sellers Bifurcate from Electronic Multisided Platforms? The Effects of Customer Deman",
          "year": 2014,
          "full_citation": "Chen, J., Chen, J., Goh, K.Y., Xu, Y., and Tan, B.C.Y., “When Do Sellers Bifurcate from Electronic Multisided Platforms? The Effects of Customer Demand, Competitive Intensity, and Service Differentiation”, Information and Management, 51(8), 2014, pp. 972-983."
        },
        {
          "title": "Goh, K.Y. and Ping, W., “Engaging Consumers with Advergames: An Experimental Evaluation of Interactivity, Fit and Expectancy”, Journal of the Associat",
          "year": 2014,
          "full_citation": "Goh, K.Y. and Ping, W., “Engaging Consumers with Advergames: An Experimental Evaluation of Interactivity, Fit and Expectancy”, Journal of the Association for Information Systems, 15(7), 2014, pp. 388-421."
        },
        {
          "title": "Tan, C.H., Goh, K.Y., Teo, H.H., and Yang, X., “Response to Buyout Options in Internet Auctions”, IEEE Transactions on Engineering Management, 61(2), ",
          "year": 2014,
          "full_citation": "Tan, C.H., Goh, K.Y., Teo, H.H., and Yang, X., “Response to Buyout Options in Internet Auctions”, IEEE Transactions on Engineering Management, 61(2), 2014, pp. 285-297."
        },
        {
          "title": "Goh, K.Y., Heng, C.S., and Lin, Z., “Social Media Brand Community and Consumer Behavior: Quantifying the Relative Impact of User- and Marketer-Generat",
          "year": 2013,
          "full_citation": "Goh, K.Y., Heng, C.S., and Lin, Z., “Social Media Brand Community and Consumer Behavior: Quantifying the Relative Impact of User- and Marketer-Generated Content”, Information Systems Research, 24(1), 2013, pp. 88-107."
        },
        {
          "title": "Goh, K.Y., Hui, K.L., and Png, I.P.L., “Newspaper Reports and Consumer Choice: Evidence from the Do Not Call Registry”, Management Science, 57(9), 201",
          "year": 2011,
          "full_citation": "Goh, K.Y., Hui, K.L., and Png, I.P.L., “Newspaper Reports and Consumer Choice: Evidence from the Do Not Call Registry”, Management Science, 57(9), 2011, pp. 1640-1654."
        },
        {
          "title": "Tan, C.H., Goh, K.Y., and Teo, H.H., “Effects of Comparison Shopping Websites on Market Performance: Does Market Structure Matter?”, Journal of Electr",
          "year": 2010,
          "full_citation": "Tan, C.H., Goh, K.Y., and Teo, H.H., “Effects of Comparison Shopping Websites on Market Performance: Does Market Structure Matter?”, Journal of Electronic Commerce Research, Special Issue on Comparison-Shopping and Related Recommender Intelligent Agents, 11(3), 2010, pp. 193-219."
        },
        {
          "title": "Manchanda, P., Dubé, J.P., Goh, K.Y., and Chintagunta, P.K., “The Effect of Banner Advertising on Internet Purchasing”, Journal of Marketing Research,",
          "year": 2006,
          "full_citation": "Manchanda, P., Dubé, J.P., Goh, K.Y., and Chintagunta, P.K., “The Effect of Banner Advertising on Internet Purchasing”, Journal of Marketing Research, 43(1), 2006, pp. 98-108."
        },
        {
          "title": "Chintagunta, P.K., Dubé, J.P., and Goh, K.Y., “Beyond the Endogeneity Bias: The Effect of Unmeasured Brand Characteristics on Household-Level Brand Ch",
          "year": 2005,
          "full_citation": "Chintagunta, P.K., Dubé, J.P., and Goh, K.Y., “Beyond the Endogeneity Bias: The Effect of Unmeasured Brand Characteristics on Household-Level Brand Choice Models”, Management Science, 51(5), 2005, pp. 832-849.2005, May, pp. 832-849."
        }
      ],
      "publications_count": 25,
      "awards": [
        "Ministry of Education, Public Administration Medal (Bronze) (Pingat Pentadbiran Awam) (Gangsa) (2025)",
        "International Conference on Information Systems, Best Overall Conference Paper Award nominee (2024)",
        "International Conference on Information Systems, Best Paper in Track (Digital Innovation, Transformation, and Entrepreneurship) Award (2024)",
        "International Conference on Information Systems, Best Paper Award (Short Paper) nominee (2023)",
        "International Conference on Information Systems, Best Overall Conference Paper Award (2022)",
        "International Conference on Information Systems, Best Paper in Track (Digital and Mobile Commerce) Award (2022)",
        "Ministry of Education, Long Service Medal (Pingat Bakti Setia) (2022)",
        "Association for Information Systems (AIS), Distinguished Member (2021)",
        "China Information Economics Society, 2017 Young Scholar Innovation Award (2017)",
        "China Information Economics Society, 2011-2015 Young Scholar Innovation Award (2016)",
        "Pacific-Asia Conference on Information Systems, Best Paper Award (Completed Research) nominee (2016)",
        "National University of Singapore, Faculty Teaching Excellence Award (2013-2014)",
        "International Conference on Information Systems, Best Research-in-Progress Paper Award Runner-Up (2014)",
        "Singapore-MIT Alliance for Research and Technology (SMART), Innovation Centre Explorer Grant Award (2012)",
        "International Conference on Information Systems, Best Conference Paper Award nominee (2011)",
        "International Conference on Information Systems, Best Conference Theme Paper Award nominee (2003)",
        "University of Chicago, Graduate School of Business, Dean’s Commendation Award for Teaching Excellence and Exceptional Service to Executive MBA program (2003)",
        "INFORMS Society for Marketing Science Doctoral Consortium Fellow (2003)",
        "Yeck Scholar, John D. Yeck Center for Advanced Studies in Direct and Interactive Marketing, Direct Marketing Educational Foundation (2003)",
        "INFORMS College of Marketing Doctoral Consortium Fellow (2002)",
        "32nd Annual Albert Haring Symposium Delegate, Indiana University (2002)",
        "University of Chicago, Graduate School of Business, Ph.D. Fellowship (2000-2005)",
        "University of Chicago, Joseph A. Pickler Ph.D. Fellowship (2000-2001)",
        "National University of Singapore, Overseas Graduate Scholarship (2000-2005)",
        "Public Service Commission, Local Merit Scholarship (1993-1997)"
      ],
      "awards_count": 25,
      "courses": []
    },
    {
      "name": "Anand Mohan RAMCHAND",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/anand",
      "appointment": "Associate Professor (Educator Track)",
      "additional_titles": [
        "Deputy Head, Department Of Information Systems and Analytics"
      ],
      "office": "COM2-03-22",
      "phone": "651 62990",
      "email": "anand@comp.nus.edu.sg",
      "personal_page": "https://www.comp.nus.edu.sg/~anand",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/anand.jpg",
      "profile": "Dr. Anand Ramchand is an Associate Professor and Assistant Dean (Industry Relations) at the School of Computing (SOC) at the National University of Singapore (NUS). He received his Ph.D. in Information Systems in 2012 and holds an M.Sc in Information Systems (2004) and B.Sc (Hons) in Computer Science and Information Systems (2001) from NUS Computing.\n\nDr. Ramchand's primary teaching and research interests are in digital transformation of organizations, business model innovation driven by computing, information technologies and digital enablement of social change. Since joining the department in 2001, Dr. Ramchand has received 10 teaching awards at the Faculty and University levels.  He was also on NUS Teaching Excellence Honour Roll from 2011 to 2016.",
      "education": [
        "Ph.D. (Information Systems, National University of Singapore)",
        "M.Sc. (Information Systems, National University of Singapore)",
        "B.Sc. (Computer Science & Information Systems, Honours, National University of Singapore)"
      ],
      "research_areas": [],
      "research_interests": [],
      "research_projects": [],
      "phd_alumni": [],
      "publications": [
        {
          "title": "Ramchand, A. and Leong, ML. 2013. “Healthway Medical Group’s Clinical Management System”, in Pan, G. ed.Dynamics of Governing IT Innovation in Singapo",
          "year": 2013,
          "full_citation": "Ramchand, A. and Leong, ML. 2013. “Healthway Medical Group’s Clinical Management System”, in Pan, G. ed.Dynamics of Governing IT Innovation in Singapore: A Casebook, World Scientific Publishing, Singapore."
        },
        {
          "title": "Ramchand, A. and Pan, SL. 2012. “The Co-Evolution of Communities of Practice and Knowledge Management in Organizations”,The Data Base for Advances in ",
          "year": 2012,
          "full_citation": "Ramchand, A. and Pan, SL. 2012. “The Co-Evolution of Communities of Practice and Knowledge Management in Organizations”,The Data Base for Advances in Information Systems, Vol. 43 1, pp. 8-23."
        },
        {
          "title": "Teoh, SY., Pan, SL. and Ramchand, A. 2012. “Resource Management Activities in Healthcare Information Systems: A Process Perspective”,Information Syste",
          "year": 2012,
          "full_citation": "Teoh, SY., Pan, SL. and Ramchand, A. 2012. “Resource Management Activities in Healthcare Information Systems: A Process Perspective”,Information Systems Frontiers,Vol. 14 3, pp. 585-600."
        },
        {
          "title": "Ramchand, A. and Pan, SL. 2008. “Beyond Mobile Communications - Ubiquitous Information Environments in Singapore”, in Yoo YJ., Lee JN. and Rowley, C. ",
          "year": 2008,
          "full_citation": "Ramchand, A. and Pan, SL. 2008. “Beyond Mobile Communications - Ubiquitous Information Environments in Singapore”, in Yoo YJ., Lee JN. and Rowley, C. eds.Trends in Mobile Technology and Business in the Asia-Pacific Region, Chandos Publishing, Oxford."
        },
        {
          "title": "Ramchand, A., Devadoss, P. and Pan, SL. 2005. “The Impacts of Ubiquitous Computing Technologies on Business Process Design and Management: The Case of",
          "year": 2005,
          "full_citation": "Ramchand, A., Devadoss, P. and Pan, SL. 2005. “The Impacts of Ubiquitous Computing Technologies on Business Process Design and Management: The Case of Singapore’s National Library Board”, in theProceedings for the International Federation For Information Processing Working Group 8.2 IFIP WG8.2, 1-3 August, Cleveland, OH."
        },
        {
          "title": "Ramchand, A. 2004. “NCS Private Limited, Singapore”, in Pan, SL ed.Managing Strategic Enterprise Systems and E-Government Initiatives in Asia: A Caseb",
          "year": 2004,
          "full_citation": "Ramchand, A. 2004. “NCS Private Limited, Singapore”, in Pan, SL ed.Managing Strategic Enterprise Systems and E-Government Initiatives in Asia: A Casebook, pp. 21-44, World Scientific Publishing, Singapore."
        }
      ],
      "publications_count": 6,
      "awards": [],
      "awards_count": 0,
      "courses": []
    },
    {
      "name": "TAN Chuan Hoo",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/tancho",
      "appointment": "Associate Professor",
      "additional_titles": [
        "Deputy Head, Department Of Information Systems and Analytics",
        "URC Expert Panel, NUS (2022.10~2026.10)"
      ],
      "office": "COM2-04-12",
      "phone": "651 66903",
      "email": "tancho@comp.nus.edu.sg",
      "personal_page": "https://www.comp.nus.edu.sg/~tancho",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/tancho.jpg",
      "profile": "Chuan Hoo is an Associate Professor (tenured) in the Department of Information Systems and Analytics, School of Computing at the National University of Singapore (NUS). Before joining NUS, he held a tenured faculty position in Hong Kong. \n\nHis primary research focuses on digital transformation, mainly designing, deploying, and evaluating technological innovations. Through both past and ongoing projects, he conducts comprehensive analyses and assessments of digital technologies utilising various scientific methodologies. These efforts aim to elucidate their roles in reshaping business operations and enhancing societal well-being. As new technologies and applications continue to emerge and evolve, he focuses his inquiries on two critical areas: digital commerce (i.e., the provision of digital services) and digital organization (i.e., ensuring operational efficiency and performance). This focus yields valuable insights into the implications of digital advancements, both within organisations and at their interfaces. Collaborative initiatives with public and private entities further amplify the impact and relevance of Chuan Hoo’s research. Through these endeavours, he aims to deepen our understanding of the intersection between technology and organisational effectiveness, as well as its broader societal implications. His research has been published in premium peer-reviewed journals, including MIS Quarterly, Information Systems Research, Journal of Management Information Systems, Journal of AIS, ACM Transactions on Management Information Systems, IEEE Transactions on Engineering Management, Journal of the American Society for Information Science and Technology, and Long Range Planning, among many others. He has authored over 100 peer-reviewed papers (link). Chuan Hoo serves or has served on the editorial boards of leading journals, including Information Systems Research (Associate Editor), MIS Quarterly (Associate Editor), Journal of AIS (editorial board member), and IEEE Transactions on Engineering Management (editorial board member), among others. Chuan Hoo is the recipient of the INFORMS ISS Design Science Award (2013), the Informs Information Systems Research Outstanding Associate Editor Award (2025), the MIS Quarterly Outstanding Associate Editor Award (2016), the Journal of AIS Best Reviewer Award (2016), the Journal of AIS Reviewer Hall of Fame (only one scholar recognised to be a top reviewer with over 50+ papers reviewed in 2020), among others.\n\nHis teaching journey began in 2004 as a teaching assistant. Over the years, Chuan Hoo has an extensive teaching record, including courses at universities for undergraduate and graduate students, as well as well-tailored executive workshops for senior management and executive professionals. Throughout his teaching career, he received teaching awards in 2004 (Best Teaching Assistant, NUS) as well as in 2017 and 2024 (Faculty Teaching Excellence Award, NUS).",
      "education": [
        "M.Sc. (Accelerated, National University of Singapore)",
        "Ph.D. (National University of Singapore)",
        "B.Sc. (1st Class Honours, National University of Singapore)"
      ],
      "research_areas": [
        "Healthcare Informatics",
        "Digital Transformation, Platforms & Innovation",
        "Computational Social Science"
      ],
      "research_interests": [
        "Digital organization with special interests in healthcare institutions, corporations, and ephemeral organization (e.g., crisis preparedness and response)",
        "Digital commerce with special interests in digital shopping and gig economy"
      ],
      "research_projects": [
        {
          "title": "Digital Crisis and Preparedness",
          "description": "The rapid development of the digital economy brings new risks and challenges. Anticipating and preparing for the sudden onset of digital crises has become a major priority. This project, which focuses on digital crisis management, examines how digital companies can prepare for significant crises such as digital service failures.",
          "tags": [
            "Digital Transformation, Platforms & Innovation"
          ]
        },
        {
          "title": "Digitalization for Disaster Response Mission",
          "description": "The climate crisis lurks in the background and steadily instills disasters, such as earthquakes, tsunamis, volcanic eruptions, floods, landslides, and cyclones. This research project examines how technology can be designed and implemented to support activated disaster response organizations in their operations.",
          "tags": [
            "Digital Transformation, Platforms & Innovation"
          ]
        },
        {
          "title": "Digitalization of Healthcare Services",
          "description": "The healthcare sector is undergoing a major digital transformation due to rapidly changing demographic populations. This project examines the design, implementation, and usage of digital technology among healthcare workers in hospital settings.",
          "tags": [
            "Healthcare Informatics,Computational Social Science"
          ]
        }
      ],
      "phd_alumni": [],
      "publications": [
        {
          "title": "Wei, S. B., Ke, W. L., and Tan, C. H., “Routine and Innovative Use of Enterprise System: Intricacy of Change Management Levers, System Characteristics",
          "year": null,
          "full_citation": "Wei, S. B., Ke, W. L., and Tan, C. H., “Routine and Innovative Use of Enterprise System: Intricacy of Change Management Levers, System Characteristics, and Regulatory Focus,” Information Systems Research, accepted."
        },
        {
          "title": "Bardhan, I., Kohli, R., Oborn, E., Mishra, A., Tan, C. H., Tremblay, M. C., and Sarker, S., “Human-Centric Information Systems Research on the Digital",
          "year": 2025,
          "full_citation": "Bardhan, I., Kohli, R., Oborn, E., Mishra, A., Tan, C. H., Tremblay, M. C., and Sarker, S., “Human-Centric Information Systems Research on the Digital Future of Healthcare,” Information Systems Research, editorial, March 2025."
        },
        {
          "title": "Yu, T., Tan, C. H., Sia, C. L., Shi, Y., and Teo, H. H., “Healthcare Rural–Urban Access Inequality Challenge: Transformative Roles of Information Tech",
          "year": 2022,
          "full_citation": "Yu, T., Tan, C. H., Sia, C. L., Shi, Y., and Teo, H. H., “Healthcare Rural–Urban Access Inequality Challenge: Transformative Roles of Information Technology,” MIS Quarterly, Vol. 46, Issue 4, 2022, 1937-1985."
        },
        {
          "title": "Cui, T., Ye, J. H., and Tan, C. H., “Information Technology in Open Innovation: A Resource Orchestration Perspective,” Information & Management, Vol. ",
          "year": 2022,
          "full_citation": "Cui, T., Ye, J. H., and Tan, C. H., “Information Technology in Open Innovation: A Resource Orchestration Perspective,” Information & Management, Vol. 59, Issue 8, 2022, 103699."
        },
        {
          "title": "Cui, T., Tong, Y., and Tan, C. H., “Open Innovation and IT Use: Toward an Operational Alignment View,” Information Systems Journal, Volume 32, Issue 5",
          "year": 2022,
          "full_citation": "Cui, T., Tong, Y., and Tan, C. H., “Open Innovation and IT Use: Toward an Operational Alignment View,” Information Systems Journal, Volume 32, Issue 5, September 2022, 932-972."
        },
        {
          "title": "Ke, W. L., Kang, L. L., Tan, C. H., and Peng, C. H., “User Competence with Enterprise Systems: The Effects of Work Environment Factors,” Information S",
          "year": 2021,
          "full_citation": "Ke, W. L., Kang, L. L., Tan, C. H., and Peng, C. H., “User Competence with Enterprise Systems: The Effects of Work Environment Factors,” Information Systems Research, Volume 32, Issue 3, 2021, 850-875."
        },
        {
          "title": "Sutanto, J., Jiang, Q. Q., and Tan, C. H., “The Contingent Role of Interproject Connectedness in Cultivating Open Source Software Projects,” Journal o",
          "year": 2021,
          "full_citation": "Sutanto, J., Jiang, Q. Q., and Tan, C. H., “The Contingent Role of Interproject Connectedness in Cultivating Open Source Software Projects,” Journal of Strategic Information Systems, Volume 30, Issue 1, 2021, 101598."
        },
        {
          "title": "Chen, Y.Y., Huang, Y.X., and Tan, C.H., “Short-term Rental and its Regulations on the Home-sharing Platform,” Information & Management, Volume 58 Issu",
          "year": 2021,
          "full_citation": "Chen, Y.Y., Huang, Y.X., and Tan, C.H., “Short-term Rental and its Regulations on the Home-sharing Platform,” Information & Management, Volume 58 Issue 3, 2021, Article 103322."
        },
        {
          "title": "Kang, L.L., Tan, C.H., Zhao, L., “Do Cognitive and Affective Expressions Matter in Purchase Conversion? A Live Chat Perspective,\" Journal of the Assoc",
          "year": 2020,
          "full_citation": "Kang, L.L., Tan, C.H., Zhao, L., “Do Cognitive and Affective Expressions Matter in Purchase Conversion? A Live Chat Perspective,\" Journal of the Association for Information Science and Technology, Volume 71, Number 4, April 2020, 436-449."
        },
        {
          "title": "Jiang, Q.Q., Tan, C.H., Sia, C.L., and Wei, K.K., “Followership in an Open-source Software Project and Its Significance in Code Reuse,” MIS Quarterly,",
          "year": 2019,
          "full_citation": "Jiang, Q.Q., Tan, C.H., Sia, C.L., and Wei, K.K., “Followership in an Open-source Software Project and Its Significance in Code Reuse,” MIS Quarterly, Volume 43, Issue 4, 2019,,1303-1319."
        },
        {
          "title": "Tong, Y. Tan, C. H., and Teo, H. H., “Direct and Indirect Information System Use: A Multi-Method Exploration of Social Power Antecedents in Healthcare",
          "year": 2017,
          "full_citation": "Tong, Y. Tan, C. H., and Teo, H. H., “Direct and Indirect Information System Use: A Multi-Method Exploration of Social Power Antecedents in Healthcare,” Information Systems Research, Volume 28, Issue 4, December 2017, 690-710."
        },
        {
          "title": "A Modeling Language for Conceptual Design of Systems Integration Solutions,",
          "year": 2018,
          "full_citation": "Purao, S., Bolloju, N., and Tan, C. H., \"A Modeling Language for Conceptual Design of Systems Integration Solutions,\" ACM Transactions on Management Information Systems, Volume 9, Issue 2, September 2018, Article No. 8."
        },
        {
          "title": "Helpfulness of Online Review Content: The Moderating Effects of Temporal and Social Cues,",
          "year": 2018,
          "full_citation": "Huang, L.Q., Tan, C.H., Ke, W.L., and Wei, K.K., \"Helpfulness of Online Review Content: The Moderating Effects of Temporal and Social Cues,\" Journal of the Association for Information Systems, Volume 19, Issue 6, 2018, Article 3."
        },
        {
          "title": "Li, M., Tan, C.H., Wei, K.K., and Wang, K.L. “Sequentiality of Product Review Information Provision: An Information Foraging Perspective,” MIS Quarter",
          "year": 2017,
          "full_citation": "Li, M., Tan, C.H., Wei, K.K., and Wang, K.L. “Sequentiality of Product Review Information Provision: An Information Foraging Perspective,” MIS Quarterly, Volume 41, Issue 3, September 2017, 867-892."
        },
        {
          "title": "Goh, K. Y., Tan, C. H., Teo, H. H., “Stated Choice Analysis of Conditional Purchase and Information Cue Effects in Online Group Purchase,”Journal of t",
          "year": 2015,
          "full_citation": "Goh, K. Y., Tan, C. H., Teo, H. H., “Stated Choice Analysis of Conditional Purchase and Information Cue Effects in Online Group Purchase,”Journal of the Association for Information Systems, Volume 16, Issue 9, September 2015, Article 9."
        },
        {
          "title": "Tan, C. H., Sutanto, J., Phang, C. W., and Gasimov, A., “Using Personal Communication Technologies for Commercial Communications: A Cross?Country Inve",
          "year": 2014,
          "full_citation": "Tan, C. H., Sutanto, J., Phang, C. W., and Gasimov, A., “Using Personal Communication Technologies for Commercial Communications: A Cross?Country Investigation of Email and SMS,”Information Systems Research, Volume 25, No. 2, June 2014, 307-327."
        },
        {
          "title": "Li, M. X., Jiang, Q. Q., Tan, C. H., and Wei, K. K., “Enhancing User-Game Engagement through Software Gaming Elements,”Journal of Management Informati",
          "year": 2014,
          "full_citation": "Li, M. X., Jiang, Q. Q., Tan, C. H., and Wei, K. K., “Enhancing User-Game Engagement through Software Gaming Elements,”Journal of Management Information Systems, Volume 30, No. 4, Spring 2014, 115-150."
        },
        {
          "title": "Huang, L. Q., Tan, C. H., Ke, W. L, and Wei, K. K., “Comprehension and Assessment of Product Reviews: A Review-Product Congruity Proposition,”Journal ",
          "year": 2014,
          "full_citation": "Huang, L. Q., Tan, C. H., Ke, W. L, and Wei, K. K., “Comprehension and Assessment of Product Reviews: A Review-Product Congruity Proposition,”Journal of Management Information Systems, Volume 30, Issue 3, winter 2014, 311-343."
        },
        {
          "title": "Sutanto, J., Palme, E., Tan, C. H., and Phang, C. W., “Addressing the Personalization-Privacy Paradox: An Empirical Assessment from a Field Experiment",
          "year": 2013,
          "full_citation": "Sutanto, J., Palme, E., Tan, C. H., and Phang, C. W., “Addressing the Personalization-Privacy Paradox: An Empirical Assessment from a Field Experiment on Smartphone Users,”MIS Quarterly, Volume 37, Issue 4, December 2013, 1141-1164."
        },
        {
          "title": "Ke, W. L., Tan, C. H., Sia, C. L., Wei, K. K., “Inducing Intrinsic Motivation to Explore the Enterprise System: The Supremacy of Organizational Levers",
          "year": 2013,
          "full_citation": "Ke, W. L., Tan, C. H., Sia, C. L., Wei, K. K., “Inducing Intrinsic Motivation to Explore the Enterprise System: The Supremacy of Organizational Levers,”Journal of Management Information Systems, Volume 29, Number 3, Winter 2013, 257-290."
        },
        {
          "title": "Sutanto, J., Tan, C. H., Battistini, B. and Phang, C. W., “Emergent Leadership in Virtual Collaboration Settings: A Social Network Analysis Approach,”",
          "year": 2011,
          "full_citation": "Sutanto, J., Tan, C. H., Battistini, B. and Phang, C. W., “Emergent Leadership in Virtual Collaboration Settings: A Social Network Analysis Approach,”Long Range Planning, Volume 44, Issues 5-6, October-December 2011, 421-439."
        },
        {
          "title": "Assessing Screening and Evaluation Decision Support Systems: A Resource-Matching Approach,",
          "year": 2010,
          "full_citation": "Tan, C. H., Teo, H. H., Benbasat, I., \"Assessing Screening and Evaluation Decision Support Systems: A Resource-Matching Approach,\"Information Systems Research, Volume 21, Issue 2, June 2010, 305-326."
        },
        {
          "title": "Google Scholar Citations",
          "year": null,
          "full_citation": "Google Scholar Citations"
        },
        {
          "title": "orcid",
          "year": null,
          "full_citation": "orcid"
        }
      ],
      "publications_count": 24,
      "awards": [
        "Outstanding Associate Editor Award, Informs Information Systems Research 2025",
        "Faculty Teaching Excellence Award, NUS 2024",
        "Information Management Research Award, China Information Economics Society 2023",
        "Reviewer Hall of Fame (Top reviewer with over 50+ papers reviewed), Journal of AIS 2020",
        "Faculty Teaching Excellence Award, NUS 2017",
        "Outstanding Associate Editor Award, MIS Quarterly 2016",
        "Best Reviewer Award, Journal of AIS 2016",
        "INFORMS ISS Design Science Award 2013",
        "Honorable Mention, Journal of AIS 2015"
      ],
      "awards_count": 9,
      "courses": []
    },
    {
      "name": "OH Lih Bin",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/ohlb",
      "appointment": "Associate Professor (Educator Track)",
      "additional_titles": [
        "Deputy Head, Department Of Information Systems and Analytics"
      ],
      "office": "COM2-04-21",
      "phone": "651 63796",
      "email": "ohlb@comp.nus.edu.sg",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/ohlb.jpg",
      "profile": "Dr Lih-Bin Oh is an Associate Professor and Deputy Head (Teaching and Degree Programmes) in the Department of Information Systems and Analytics, NUS School of Computing. Between 2008 and 2014, Dr Oh was Assistant/Associate Professor of Information Management at the School of Management, Xi'an Jiaotong University (XJTU) in Xi’an, China. He also served as the school’s Academic Director of International Affairs and Programs from 2011-2013. He has held visiting appointments at the MIT Sloan School of Management and the Michigan State University Broad College of Business. \n\nPrior to pursuing an academic career, Dr Oh worked as a senior officer (infocomm sciences) in the Science and Engineering Research Council of the Agency for Science, Technology and Research (A*STAR). He also had adjunct lecturing experience in the off-campus programs of Monash University Gippsland School of Information Technology. He has taught courses in IT and service innovation, information systems leadership, e-commerce, and information ethics at the undergraduate, graduate, and MBA/EMBA levels. Dr Oh obtained his Ph.D. and M.Sc. in Information Systems and B.Sc. (First Class Honors) in Computer and Information Sciences from NUS.",
      "education": [
        "Ph.D. (Information Systems, National University of Singapore)",
        "M.Sc. (Information Systems, National University of Singapore)",
        "B.Sc. (Computer & Information Sciences, Honours I,  National University of Singapore)"
      ],
      "research_areas": [
        "Digital Transformation, Platforms & Innovation"
      ],
      "research_interests": [
        "Development of Innovation & Leadership Capability in Learners",
        "Experiential Learning in Computing Education",
        "Service System Innovation",
        "Information Ethics"
      ],
      "research_projects": [
        {
          "title": "Enhancing Adult Learning Using A Mobile Micro-Learning Platform With Integrated Nudging Interventions: A Design-Based Research Approach",
          "description": "Adult learning research often overlooks the diversity of learners and conflates perception with reality. This project tackles this by: 1) creating distinct adult learner archetypes, 2) developing a mobile micro-learning platform (informed by cognitive load and nudging theories) tailored to these archetypes, and 3) investigating its impact on learning outcomes.",
          "tags": [
            "Digital Transformation, Platforms & Innovation"
          ]
        }
      ],
      "phd_alumni": [],
      "publications": [
        {
          "title": "/Omnichannel Retailing",
          "year": null,
          "full_citation": "/Omnichannel Retailing"
        },
        {
          "title": "The Effects of Retail Channel Integration through the use of Information Technologies on Firm Performance,",
          "year": 2012,
          "full_citation": "Oh, L.B., Teo, H.H., and Sambamurthy, V. \"The Effects of Retail Channel Integration through the use of Information Technologies on Firm Performance,\"Journal of Operations Management 30:5, July 2012, pp. 368-381."
        },
        {
          "title": "Consumer Value Co-creation in a Hybrid Commerce Service Delivery System,",
          "year": 2010,
          "full_citation": "Oh, L.B. and Teo, H.H. \"Consumer Value Co-creation in a Hybrid Commerce Service Delivery System,\"International Journal of Electronic Commerce 14:3, Spring 2010, pp. 35-62."
        },
        {
          "title": "Differential Impact of Web and Mobile Interactivity on E-Retailers' Performance,",
          "year": 2013,
          "full_citation": "Gu, R., Oh, L.B., and Wang, K. \"Differential Impact of Web and Mobile Interactivity on E-Retailers' Performance,\"Journal of Organizational Computing and Electronic Commerce 23:4, November 2013, pp. 325-349."
        },
        {
          "title": "/Social Media User Behavior",
          "year": null,
          "full_citation": "/Social Media User Behavior"
        },
        {
          "title": "Exploring the Impact of Optimum Stimulation Level on Individual Perceptions of IT Innovations: A Trait Hierarchical Model Perspective, ",
          "year": 2018,
          "full_citation": "Gu, R., Jiang, Z., Oh, L.B., and Wang, K. \"Exploring the Impact of Optimum Stimulation Level on Individual Perceptions of IT Innovations: A Trait Hierarchical Model Perspective, \"The Data Base for Advances in Information Systems 49:1, February 2018, pp. 67-92."
        },
        {
          "title": "Multi-Homing on SNSs: The Role of Optimum Stimulation Level and Perceived Complementarity in Need Gratification,",
          "year": 2016,
          "full_citation": "Gu, R., Oh, L.B., and Wang, K. \"Multi-Homing on SNSs: The Role of Optimum Stimulation Level and Perceived Complementarity in Need Gratification,\"Information & Management 53:6, September 2016, pp. 752-766."
        },
        {
          "title": "Developing User Loyalty for Social Networking Sites: A Relational Perspective,",
          "year": 2016,
          "full_citation": "Gu, R., Oh, L.B., and Wang, K. \"Developing User Loyalty for Social Networking Sites: A Relational Perspective,\"Journal of Electronic Commerce Research 17:1, February 2016, pp. 1-21."
        },
        {
          "title": "A Maslow's Hierarchy of Needs Analysis of Social Networking Services Continuance,",
          "year": 2013,
          "full_citation": "Cao, H.H., Jiang, J.H.,Oh, L.B.et al. \"A Maslow's Hierarchy of Needs Analysis of Social Networking Services Continuance,\"Journal of Service Management 24:2, April 2013, pp. 170-190."
        },
        {
          "title": "Why Users Share Marketer-generated Content in Social Broadcasting Websites: A Cognitive-Affective Involvement Perspective,",
          "year": 2017,
          "full_citation": "Li, Y., Oh, L.B., and Wang, K. \"Why Users Share Marketer-generated Content in Social Broadcasting Websites: A Cognitive-Affective Involvement Perspective,\"Journal of Organizational Computing and Electronic Commerce 27:4,October 2017, pp. 342-373."
        },
        {
          "title": "/Ethical Issues in IT",
          "year": null,
          "full_citation": "/Ethical Issues in IT"
        },
        {
          "title": "To Blow or Not to Blow: An Experimental Study on the Intention to Whistleblow on Software Piracy,",
          "year": 2010,
          "full_citation": "Oh, L.B. and Teo, H.H.\"To Blow or Not to Blow: An Experimental Study on the Intention to Whistleblow on Software Piracy,\"Journal of Organizational Computing and Electronic Commerce 20:4, October 2010, pp. 347-369."
        },
        {
          "title": "Determinants of Employees’ Intention to Exert Pressure on Firms to Engage in Web Accessibility,",
          "year": 2015,
          "full_citation": "Oh, L.B. and Chen, J. \"Determinants of Employees’ Intention to Exert Pressure on Firms to Engage in Web Accessibility,\"Behaviour & Information Technology 34:2, February 2015, pp. 108-118."
        },
        {
          "title": "Impacts of Organizational Commitment, Interpersonal Closeness, and Confucian Ethics on Willingness to Report Bad News in Software Projects,",
          "year": 2017,
          "full_citation": "Wang, J., Keil, M., Oh, L.B., and Shen, Y. \"Impacts of Organizational Commitment, Interpersonal Closeness, and Confucian Ethics on Willingness to Report Bad News in Software Projects,\"Journal of Systems and Software 125, March 2017, pp. 220-233."
        }
      ],
      "publications_count": 14,
      "awards": [
        "Best Paper Award nominee, Wuhan International Conference on E-Business (WHICEB), 2013",
        "Best Paper Award, International Conference on Information Resources Management (Conf-IRM), 2009",
        "Distinguished Track Paper Award, Decision Sciences Institute Annual Meeting (DSI), 2008",
        "Best Paper Award nominee, European Conference on Information Systems (ECIS), 2007",
        "Best Theme Paper Award Second Runner-up, International Conference on Information Systems (ICIS), 2003",
        "Halbrecht Associates Book Prize, NUS Commencement Award, 1998"
      ],
      "awards_count": 6,
      "courses": []
    },
    {
      "name": "CHEN Nan",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/chenn",
      "appointment": "Assistant Professor",
      "additional_titles": [],
      "office": "COM3-02-32",
      "phone": "660 17524",
      "email": "chenn@comp.nus.edu.sg",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/chenn.jpg",
      "profile": "",
      "education": [],
      "research_areas": [],
      "research_interests": [],
      "research_projects": [],
      "phd_alumni": [],
      "publications": [],
      "publications_count": 0,
      "awards": [],
      "awards_count": 0,
      "courses": []
    },
    {
      "name": "Shalinda ADIKARI",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/shalinda",
      "appointment": "Lecturer (Educator Track)",
      "additional_titles": [],
      "office": "COM2-02-48",
      "phone": "660 12381",
      "email": "shalinda@comp.nus.edu.sg",
      "personal_page": "http://www.comp.nus.edu.sg/disa/bio/shalinda",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/shalinda.jpg",
      "profile": "Dr. Shalinda received his B.Sc. (Hons.) degree in Information Technology from University of Moratuwa, Sri Lanka in 2009. In 2013 he received the National University of Singapore (NUS) research scholarship and he obtained his Ph.D. degree in Information Systems and Analytics from School of Computing, NUS in 2017.  His primary research interest lies within the field of data science especially the design of data-driven applications. Currently he works with the online advertising industry where he is researching and developing new solutions to optimize the real-time bidding process in online advertising. His research has been published in INFORMS Journal of Computing. Also he has presented his research at leading academic conferences such as the International Conference on Information Systems (ICIS), the Workshop on Information Technology and Systems (WITS) and the Pacific-Asia Conference on Information Systems (PACIS). He was awarded the best paper award at WITS 2016.",
      "education": [
        "Ph.D. (Information Systems and Analytics, National University of Singapore, Singapore, 2017)"
      ],
      "research_areas": [
        "Data Science & Business Analytics"
      ],
      "research_interests": [
        "Online Advertising",
        "Social Network and Information Dissemination",
        "Data Driven Applications",
        "Learning Analytics"
      ],
      "research_projects": [],
      "phd_alumni": [],
      "publications": [
        {
          "title": "Adikari, S., and Dutta, K., 2018 “A new approach to real-time bidding in online advertisements: Auto pricing strategy”, INFORMS Journal on Computing.",
          "year": 2018,
          "full_citation": "Adikari, S., and Dutta, K., 2018 “A new approach to real-time bidding in online advertisements: Auto pricing strategy”, INFORMS Journal on Computing."
        },
        {
          "title": "Adikari, S. 2017. Understanding the in-app advertisement effect on mobile user ad accessibility, in Pacific Asia Conference on Information Systems PAC",
          "year": 2017,
          "full_citation": "Adikari, S. 2017. Understanding the in-app advertisement effect on mobile user ad accessibility, in Pacific Asia Conference on Information Systems PACIS, Langkawi, Malaysia."
        },
        {
          "title": "Adikari, S., Hahn J., and Dutta, K., 2016. Temporal feature grouping based campaign optimization in Real - time bidding digital advertising, in Worksh",
          "year": 2016,
          "full_citation": "Adikari, S., Hahn J., and Dutta, K., 2016. Temporal feature grouping based campaign optimization in Real - time bidding digital advertising, in Workshop on Information Technology and Systems WITS, Dublin, Ireland, INFORMS."
        },
        {
          "title": "Adikari, S., and Dutta, K., 2016. Selection of Ad Networks by Publishers in Mobile App Advertising, in Workshop on Information Technology and Systems ",
          "year": 2016,
          "full_citation": "Adikari, S., and Dutta, K., 2016. Selection of Ad Networks by Publishers in Mobile App Advertising, in Workshop on Information Technology and Systems WITS, Dublin, Ireland, INFORMS."
        },
        {
          "title": "Adikari, S., 2016. Use of Cultural Intelligence to Measure Influence of Online Social Networks on Cultural Adjustment. In International Conference on ",
          "year": 2016,
          "full_citation": "Adikari, S., 2016. Use of Cultural Intelligence to Measure Influence of Online Social Networks on Cultural Adjustment. In International Conference on Cross-Cultural Design held as part of International Conference on Human Computer Interaction HCII Toronto, Canada, pp. 3-15. Springer."
        },
        {
          "title": "Adikari, S., and Dutta, K. 2015. Auto pricing Strategy for Real time bidding in advertising: A dynamic programming approach, in International Conferen",
          "year": 2015,
          "full_citation": "Adikari, S., and Dutta, K. 2015. Auto pricing Strategy for Real time bidding in advertising: A dynamic programming approach, in International Conference on Information Systems ICIS, Fort Worth, USA, INFORMS."
        },
        {
          "title": "Adikari, S., & Adu, E. K. 2015. Usage of Online Social Networks in Cultural Adaptation, in Pacific Asia Conference on Information Systems PACIS, Singa",
          "year": 2015,
          "full_citation": "Adikari, S., & Adu, E. K. 2015. Usage of Online Social Networks in Cultural Adaptation, in Pacific Asia Conference on Information Systems PACIS, Singapore"
        },
        {
          "title": "Adikari, S., and Dutta, K. 2015. Real time bidding in online digital advertisement, in Design Science Research in Information Systems and Technology D",
          "year": 2015,
          "full_citation": "Adikari, S., and Dutta, K. 2015. Real time bidding in online digital advertisement, in Design Science Research in Information Systems and Technology DESRIST, Dublin, Ireland, Springer."
        },
        {
          "title": "Adikari, S., & Dutta, K. 2014. Identifying Fake Profiles in Linkedin. In Pacific Asia Conference on Information Systems PACIS, Chengdu, China.",
          "year": 2014,
          "full_citation": "Adikari, S., & Dutta, K. 2014. Identifying Fake Profiles in Linkedin. In Pacific Asia Conference on Information Systems PACIS, Chengdu, China."
        },
        {
          "title": "Bogahawatte, K., & Adikari, S. 2013. Intelligent criminal identification system. In Proceedings of International Conference on Computer Science & Educ",
          "year": 2013,
          "full_citation": "Bogahawatte, K., & Adikari, S. 2013. Intelligent criminal identification system. In Proceedings of International Conference on Computer Science & Education ICCSE, Colombo, Sri Lanka, pp. 633-638, IEEE."
        }
      ],
      "publications_count": 10,
      "awards": [
        "NUS Research Scholarship, National University of Singapore, 2013",
        "The Best Paper Award, Workshop on Information Technology and Systems (WITS), 2016, Dublin, Ireland",
        "Research Achievement Award, National University of Singapore, School of Computing, 2017"
      ],
      "awards_count": 3,
      "courses": []
    },
    {
      "name": "CUI Wei",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/cuiwei",
      "appointment": "Lecturer (Educator Track)",
      "additional_titles": [],
      "office": "COM2-04-32",
      "phone": "660 18750",
      "email": "cuiwei@comp.nus.edu.sg",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/cuiwei.jpg",
      "profile": "Dr. Cui Wei is a lecturer in the Department of Information Systems and Analytics at the School of Computing, National University of Singapore (NUS). She received her PhD in Information Systems and Analytics from the School of Computing, National University of Singapore. She has a B.Eng. in Electrical and Electronic Engineering from Nanyang Technological University. She currently teaches Artificial Intelligence-related courses and focuses on adult learning. Before joining academia as a lecturer, Dr. Cui worked at SAP Asia as a researcher to support various AI and machine learning projects. \n\nHer research interests include human-AI interaction and user experience design. She examines how AI applications (e.g., conversational agents) influence user perception and behaviour and designs more effective intelligent systems to enhance user experience. Her work has been published in top-ranked international conferences, such as the International Conference on Information Systems.",
      "education": [
        "Ph.D. (Information Systems and Analytics, National University of Singapore)"
      ],
      "research_areas": [
        "Intelligent Systems",
        "Data Science & Business Analytics"
      ],
      "research_interests": [
        "Human-Computer Interaction, User Experience Design",
        "Human-AI Interaction, AI and Education",
        "Recommender Systems"
      ],
      "research_projects": [],
      "phd_alumni": [],
      "publications": [
        {
          "title": "Cui W., Baskaran, K., & Kankanhalli, A. (2023). Affect between Humans and Conversational Agents: A Review and Future Research Directions. Internationa",
          "year": 2023,
          "full_citation": "Cui W., Baskaran, K., & Kankanhalli, A. (2023). Affect between Humans and Conversational Agents: A Review and Future Research Directions. International Conference on Information Systems ICIS 2023. Accepted."
        },
        {
          "title": "Cui, W., & Kankanhalli, A. (2023). Affect between Humans and Conversational Agents: A Review and Organizing Frameworks. Proceedings of the Pacific Asi",
          "year": 2023,
          "full_citation": "Cui, W., & Kankanhalli, A. (2023). Affect between Humans and Conversational Agents: A Review and Organizing Frameworks. Proceedings of the Pacific Asia Conference on Information Systems PACIS 2023."
        },
        {
          "title": "Sukhwal, P. C., Cui, W., & Kankanhalli, A. (2023). Knowledge Transfer between Humans and Conversational Agents: A Review, Organizing Framework, and Fu",
          "year": 2023,
          "full_citation": "Sukhwal, P. C., Cui, W., & Kankanhalli, A. (2023). Knowledge Transfer between Humans and Conversational Agents: A Review, Organizing Framework, and Future Directions. Proceedings of the 56th Hawaii International Conference on System Sciences."
        },
        {
          "title": "Cui, W., Rajan, V., & Jiang, Z. (2021). Expect the Unexpected: Engaging Users via Serendipitous Recommendations. Proceedings of the International Conf",
          "year": 2021,
          "full_citation": "Cui, W., Rajan, V., & Jiang, Z. (2021). Expect the Unexpected: Engaging Users via Serendipitous Recommendations. Proceedings of the International Conference on Information Systems ICIS 2021."
        },
        {
          "title": "Cui, W., & Jiang, Z. (2021). Move Text Out of Picture: Impacts of Spatial Relationship Between Text and Picture on Consumer Attention to Online Ads. P",
          "year": 2021,
          "full_citation": "Cui, W., & Jiang, Z. (2021). Move Text Out of Picture: Impacts of Spatial Relationship Between Text and Picture on Consumer Attention to Online Ads. Proceedings of the International Conference on Information Systems ICIS 2021."
        }
      ],
      "publications_count": 5,
      "awards": [],
      "awards_count": 0,
      "courses": []
    },
    {
      "name": "Vikas DEEP",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/dvikas",
      "appointment": "Assistant Professor",
      "additional_titles": [],
      "office": "COM2-04-39",
      "phone": "651 61422",
      "email": "dvikas@comp.nus.edu.sg",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/sample1.png",
      "profile": "Dr Vikas Deep is an Assistant Professor in the Department of Information Systems and Analytics at the National University of Singapore. He received his Ph.D. in Operations Management from the Kellogg School of Management at Northwestern University, where he was fortunate to be advised by Prof. Achal Bassamboo. Prior to that, he earned a B.Tech. in Mechanical Engineering from the Indian Institute of Technology, Delhi.\n\nDr Deep's research focuses on optimising resource allocation and learning adaptively to improve the accuracy and efficiency of experimentation methods used on online platforms. His current research utilises tools from applied probability and multi-armed bandits, with a focus on A/B testing and computerised adaptive testing.",
      "education": [],
      "research_areas": [
        "Data Science & Business Analytics"
      ],
      "research_interests": [
        "Experiementation, A/B testing, Online platforms, Applied Probability"
      ],
      "research_projects": [],
      "phd_alumni": [],
      "publications": [],
      "publications_count": 0,
      "awards": [],
      "awards_count": 0,
      "courses": []
    },
    {
      "name": "FOONG Sew Bun",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/foongsb",
      "appointment": "Professor",
      "additional_titles": [
        "Program Director, Graduate Studies",
        "Managing Director and Group Head of Technology Services, DBS Bank",
        "Global Head Digital Transformation (Retail Banking, Private Banking, Wealth Management), Standard Chartered Bank",
        "Deputy Chief Executive, GovTech",
        "IBM Chief Technology Officer (ASEAN, Singapore, ASEAN Software Group) and IBM Distinguished Engineer"
      ],
      "office": "COM2-04-27",
      "phone": "651 68413",
      "email": "foongsb@comp.nus.edu.sg",
      "personal_page": "https://www.comp.nus.edu.sg/~foongsb",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/foongsb.jpg",
      "profile": "Mr. Foong Sew Bun joined Department of Information Systems and Analytics as a Professor of Practice in 2024. His illustrious career in the information technology sectors span more than three decades and across the globe, in key roles such as the 1) Managing Director and Group Head, Technology Services of the DBS Bank, 2) Deputy Chief Executive (Services, Governance, CyberSecurity) of GovTech, 3) Global Head, Digital Transformation (Retail Banking, Private Banking and Wealth Management), Technology and Operations at the Standard Chartered Bank, 4) Chief Technology Officer (CTO) for IBM ASEAN, ASEAN Software Group, etc.. He was the first Singaporean to be named an IBM Distinguished Engineer in global IBM.\n\nMr. Foong has also contributed his expertise to various national-level committees and advisory panels over the years, such as the Chairman and Senior Advisor of National Infocomm Competency Framework (NICF) Steering Committee, member of National Research Foundation (NRF) Advisory Committee, member of Keppel Technology Advisory Panel. He was honored with the 2016 IT Professional of the Year Award during the SCS (Singapore Computer Society) Annual IT Leaders Awards ceremony.",
      "education": [],
      "research_areas": [],
      "research_interests": [],
      "research_projects": [],
      "phd_alumni": [],
      "publications": [
        {
          "title": "“Applying Pattern Approaches”, IBM Redbooks, two books - ZG24-6722-00, Jun 2002, and SG24-6805-00, 2003.   A combined version, with internal IP remove",
          "year": 6722,
          "full_citation": "“Applying Pattern Approaches”, IBM Redbooks, two books - ZG24-6722-00, Jun 2002, and SG24-6805-00, 2003.   A combined version, with internal IP removed, was rewritten and made available publicly (SG24-7466-00) https://www.redbooks.ibm.com/redbooks/pdfs/sg247466.pdf"
        },
        {
          "title": "“An Insight into an Approach to IT Architecture: A Best Practice Example, and Its Social Aspects”, IEEE 4th International Conference on Electrical Eng",
          "year": 2013,
          "full_citation": "“An Insight into an Approach to IT Architecture: A Best Practice Example, and Its Social Aspects”, IEEE 4th International Conference on Electrical Engineering and Informatics, 2013"
        },
        {
          "title": "“A Factor Space Approach to Concept Representation”, 13th International Joint Conference in Artificial Intelligence AI Workshop, Proceedings published",
          "year": 1994,
          "full_citation": "“A Factor Space Approach to Concept Representation”, 13th International Joint Conference in Artificial Intelligence AI Workshop, Proceedings published in Springer Verlag Lecture Notes in AI no 847, Sep 1994, pp 97-113"
        }
      ],
      "publications_count": 3,
      "awards": [
        "IT Professional of the Year (2016), Singapore Computer Society",
        "Fellow, Singapore Computer Society",
        "Singapore Good Design Award (SG Mark) Experience Category for DBS IT Application and Support Journey (2023)",
        "IBM Asia Pacific Technical Professional of the Year 2004",
        "IBM Global Best Technical Leadership Award (IT Architect Profession) 2006",
        "Best of IBM Award 2011",
        "IBM Corporate Technology Team Advisory Council member to IBM Chairman 2010-2012"
      ],
      "awards_count": 7,
      "courses": []
    },
    {
      "name": "Nicholas Mac Gregor GARCIA",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/ngarcia",
      "appointment": "Lecturer (Educator Track)",
      "additional_titles": [
        "Deputy Director, NUS Fintech Lab",
        "Co-Director (Industry), NUS FinTech Lab"
      ],
      "office": "COM2-04-09",
      "phone": "660 16654",
      "email": "ngarcia@comp.nus.edu.sg",
      "personal_page": "http://www.comp.nus.edu.sg/disa/bio/ngarcia",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/ngarcia.jpg",
      "profile": "Dr. Nicholas Mac Gregor Garcia is a Lecturer in Information Systems at the National University of Singapore (NUS) and Co-Director (Industry Relations) of the NUS FinTech Lab. His work centers on AI governance, digital transformation, and emerging technology management, with a focus on building the frameworks and capabilities organisations need to deploy AI responsibly and at scale.\n\nAt NUS, Dr. Garcia leads curriculum development for Smart Systems and AI Governance, students and working professionals how to manage algorithmic risk, data strategy, and regulatory compliance. He has helped renew and expand over SGD 1 million in funding from partners such as Google.org, Ripple, and Data.org, strengthening NUS’s ecosystem for applied research and industry collaboration.\n\nHis applied research covers AI assurance, model governance, and simulation of financial and data systems, with recent publications in AAMAS, ICIS, and Open Linguistics. Current projects explore LLM benchmarking for compliance, explainable boosting in financial models, AI ethics pedagogy, DAO governance, and AI safety frameworks for policy design.\n\nDr. Garcia earned his Ph.D. in Information Systems from New York University’s Stern School of Business, his Masters in Information Systems Management (MISM) from Carnegie Mellon University, and his B.Sc. in Chemical Engineering from UC Berkeley. He advises industry on AI management, data governance, and risk frameworks, and his mentees are placed at leading organisations such as KPMG, Visa, MAS, and Coinbase.\n\nHis current mission is to bridge research and execution—helping institutions turn AI policy into operational governance and measurable business impact.",
      "education": [],
      "research_areas": [],
      "research_interests": [],
      "research_projects": [],
      "phd_alumni": [],
      "publications": [],
      "publications_count": 0,
      "awards": [],
      "awards_count": 0,
      "courses": []
    },
    {
      "name": "Jungpil HAHN",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/jungpil",
      "appointment": "Provost's Chair Professor",
      "additional_titles": [
        "Director, NUS Fintech Lab",
        "Deputy Director (AI Governance), AI Singapore",
        "Deputy Director, Centre for Technology, Robotics, Artificial Intelligence & the Law"
      ],
      "office": "COM3-02-43",
      "phone": "651 67345",
      "email": "jungpil@comp.nus.edu.sg",
      "personal_page": "https://www.garbcan.com",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/jungpil.jpg",
      "profile": "Jungpil Hahn is a Professor in the Department of Information Systems and Analytics and a Provost's Chair Professor at the School of Computing at the National University of Singapore (NUS). He served as Head of the Department of Information Systems and Analytics from July 2015 to June 2021. Prior to joining NUS, he was an Assistant Professor of Management at the Krannert School of Management at Purdue University in West Lafayette (IN) and a Visiting Assistant Professor of Information Systems at the Tepper School of Business at Carnegie Mellon University in Pittsburgh (PA). He holds a Bachelor's and a Master's degree in Business Administration from Yonsei University in Seoul, Korea, and earned his PhD in Information and Decision Sciences from the Carlson School of Management at the University of Minnesota.\n\nProfessor Hahn's research focuses on open innovation, organisational learning and knowledge management, software development processes, software project management, and human-computer interaction. His work has been published in Management Science, MIS Quarterly, Information Systems Research, Organisation Science, Entrepreneurship Theory and Practice, Journal of Management Information Systems, Information Systems Frontiers, International Journal of Business and Globalisation, Theoretical Issues in Ergonomic Science, the ACM Transactions on Human-Computer Interaction, and the Korean Management Science Review. It has also appeared in the proceedings of major conferences such as the International Conference on Information Systems, the Annual Workshop on HCI Research in MIS, the International Conference on Electronic Commerce, the International Conference on Open Source Systems, the Hawaii International Conference on System Sciences, and the ACM Conference on Human Factors in Computing Systems. His research has been presented at prominent conferences including the INFORMS Annual Meeting, the INFORMS Conference on Information Systems and Technology, the Annual Meeting of the Academy of Management, the Association of Consumer Research Pre-Conference on Consumer Behaviour Online, the Workshop on Information Systems and Economics, the Workshop on Information Technology and Systems, and the Annual Meeting of the Production and Operations Management Society. Professor Hahn has also contributed essays to several edited volumes, including Economics, Information Systems and Electronic Commerce: Empirical Advances (R. J. Kauffman and P. P. Tallon, eds.), IT-enabled Strategic Management: Increasing Returns for the Organisation (B. A. Walters and A. Tang, eds.), and E-Business Management: Integration of Web Technologies with Business Models (M. Shaw, ed.).\n\nProfessor Hahn has received numerous awards and accolades for his research, teaching, and service. He is a recipient of three \"Best Paper in Track\" Awards for the Sharing Economy, Platforms and Crowd, Advances in Research Methods, and the IS Development and Project Management Tracks at the International Conference on Information Systems (2021 and 2022), the \"Best Paper Award\" at the Workshop on Information Technology and Systems (WITS) in 2016, and the \"Best 2013 Published Paper Award\" from the Organisational Communication and Information Systems (OCIS) Division of the Academy of Management. He was nominated for the \"Best Paper Award\" at the International Conference on Electronic Commerce in 2007, and for the \"Best Division Paper Award\" at the Academy of Management in 2011 (Organisation and Management Theory Division) and 2017 (Entrepreneurship Division). Professor Hahn was named \"Krannert Distinguished Teacher\" multiple times in the MBA programme at the Krannert Graduate School of Management, and received the Faculty Teaching Excellence Award (FTEA) at the NUS School of Computing in 2014. His contributions to the academic community were also recognised when he was named \"Outstanding Reviewer\" for IEEE Internet Computing in 2002 and awarded the \"Best Reviewer Award\" in 2009 by the INFORMS Information Systems Society for his outstanding service to Information Systems Research. He has served as Associate Editor of Information Systems Research and is currently a Senior Editor of MIS Quarterly.",
      "education": [
        "Ph.D. (Information & Decision Sciences, University of Minnesota, Minneapolis, Minnesota, USA, 2003)",
        "M.B.A. (Business Administration, Yonsei University, Seoul, Korea, 1998)",
        "B.B.A. (Business Administration, Yonsei University, Seoul, Korea, 1998)"
      ],
      "research_areas": [
        "Digital Transformation, Platforms & Innovation",
        "Computational Social Science",
        "Data Science & Business Analytics",
        "FinTech"
      ],
      "research_interests": [
        "IT-enabled Open Innovation; Digital Innovation; Crowd-based Innovation; Crowdsourcing and Crowdfunding",
        "Organizational Learning; Computational Organization Theory",
        "Software Development Projects and Processes",
        "Data Science",
        "Privacy Enhancing Technologies",
        "Blockchain; Algorithmic Governance"
      ],
      "research_projects": [
        {
          "title": "Organizational Learning and Adaptation of Distributed Autonomous Organizations (DAOs) via Consensus-based Governance",
          "description": "This research explores blockchain-based Decentralized Autonomous Organizations (DAOs) as alternatives to traditional modes of organizational governance. It compares decision-making, task allocation, and organizational adaptability across DAOs, hierarchies and autonomies. Through theoretical and computational modeling, the study aims to develop design principles that enhance collective decision-making and task allocation in DAOs, providing valuable insights for industry applications.",
          "tags": [
            "Digital Transformation, Platforms & Innovation,Computational Social Science"
          ]
        },
        {
          "title": "Toward Cyber-Organizations: AI-enabled Organizational Decision-Making and Organizational Learning",
          "description": "Artificial intelligence (AI) is poised to transform organizational decision-making and talent cultivation processes, giving rise to what we term \"cyber-organizations\" where human and AI jointly work to enable computationally intensive operations and management.  This project investigates the impact of AI at the individual and organizational levels, and from both short- and long-term perspectives.",
          "tags": [
            "Computational Social Science"
          ]
        },
        {
          "title": "Making the Crowd Wiser",
          "description": "Despite the great potential of the crowdsourcing model for innovation creation, many crowdsourcing projects fail.  This project seeks to design theory-driven interventions for crowdsourcing platforms.",
          "tags": [
            "Digital Transformation, Platforms & Innovation"
          ]
        },
        {
          "title": "Distributed Autonomous Organizations (DAOs) as a Novel Organizational Form",
          "description": "Advances in blockchain technology have introduced novel models of organizational governance such as decentralized autonomous organizations (DAOs). This project studies the properties of digital consensus as a model of organizations.  We also investigate the impact of various DAO design features (e.g., voting mechanisms) that might influence organizational performance.",
          "tags": [
            "FinTech"
          ]
        },
        {
          "title": "Quantifying the Impact of Privacy Technologies (PETs) on Firms",
          "description": "Consumers' adoption of privacy enhancing technologies creates data analytics challenges to firms that rely on data to support their business models.  This project seeks to develop conceptual and methodological frameworks to quantify the impact that such technologies will have on firms' analytics capabilities and business value.",
          "tags": [
            "Data Science & Business Analytics"
          ]
        }
      ],
      "phd_alumni": [
        {
          "name": "Muhammad Nauman Shahid",
          "first_placement": "NLP Scientist-II, Supportiv Inc.",
          "graduation_year": 2024,
          "current_position": "NLP Scientist-II"
        },
        {
          "name": "Chen Dawei",
          "first_placement": "Post-doctoral Research Fellow, AI Singapore",
          "graduation_year": 2023,
          "current_position": "Assistant Professor",
          "institution": "Wenzhou-Kean University"
        },
        {
          "name": "Lan Yihong",
          "first_placement": "Director, Suntar International Group",
          "graduation_year": 2022
        },
        {
          "name": "Peng Jiaxu",
          "first_placement": "Assistant Professor, Central University of Finance and Economics",
          "graduation_year": 2020,
          "current_position": "Assistant Professor",
          "institution": "Central University of Finance and Economics"
        },
        {
          "name": "Wang Zhiyi",
          "first_placement": "Post-Doctoral Research Fellow, NUS School of Computing",
          "graduation_year": 2019,
          "current_position": "Assistant Professor",
          "institution": "University of Colorado at Boulder"
        },
        {
          "name": "Adikari Appuhamilage Praneeth Shalinda Adikari",
          "first_placement": "Senior Lecturer, University of Moratuwa",
          "graduation_year": 2018,
          "current_position": "Lecturer",
          "institution": "National University of Singapore"
        },
        {
          "name": "Yang Lusi",
          "first_placement": "Assistant Professor, University of Arizona",
          "graduation_year": 2018,
          "current_position": "Assistant Professor",
          "institution": "Georgia State University"
        }
      ],
      "publications": [
        {
          "title": "Hahn, J., Zhou, J., Lee, G. and Zorin, V. (2025) “Organizing for Software Product Development: The Effects of Team Structure, Product Complexity, and ",
          "year": 2025,
          "full_citation": "Hahn, J., Zhou, J., Lee, G. and Zorin, V. (2025) “Organizing for Software Product Development: The Effects of Team Structure, Product Complexity, and Cross-Team Coordination,” Information Systems Research."
        },
        {
          "title": "Chesterman, S., Gao, Y., Hahn, J. and Sticher, V. (2024) “The Evolution of AI Governance,” IEEE Computer, 57(9), pp. 80-92.",
          "year": 2024,
          "full_citation": "Chesterman, S., Gao, Y., Hahn, J. and Sticher, V. (2024) “The Evolution of AI Governance,” IEEE Computer, 57(9), pp. 80-92."
        },
        {
          "title": "Crowdlending Behaviors in the Aftermath of a Crisis: Evidence From a Natural Experiment,",
          "year": 2024,
          "full_citation": "Wang, Z., Yang, L., Karamshetty, V. and Hahn, J. (2024) \"Crowdlending Behaviors in the Aftermath of a Crisis: Evidence From a Natural Experiment,\" Production and Operations Management, 33(1), pp. 243-263."
        },
        {
          "title": "Müller-Bloch, C., Valbjørn Andersen, J., Spasovski, J. and Hahn, J. (2024) “Understanding Decentralization in Proof-of-Stake Blockchains: An Agent-Bas",
          "year": 2024,
          "full_citation": "Müller-Bloch, C., Valbjørn Andersen, J., Spasovski, J. and Hahn, J. (2024) “Understanding Decentralization in Proof-of-Stake Blockchains: An Agent-Based Simulation Approach,” European Journal of Information Systems, 33(3), pp. 267-286."
        },
        {
          "title": "Wang, Z., Yang, L. and Hahn, J. (2023) “Winner Takes All? The ‘Blockbuster Effect’ in Crowdfunding Platforms,” Information Systems Research, 34(3), 93",
          "year": 2023,
          "full_citation": "Wang, Z., Yang, L. and Hahn, J. (2023) “Winner Takes All? The ‘Blockbuster Effect’ in Crowdfunding Platforms,” Information Systems Research, 34(3), 935-960."
        },
        {
          "title": "Handling Missing Values in Information Systems Research: A Review of Methods and Assumptions,",
          "year": 2023,
          "full_citation": "Peng, J., Hahn, J. and Huang, K.-W. (2023) \"Handling Missing Values in Information Systems Research: A Review of Methods and Assumptions,\" Information Systems Research, 34(1), 5-26."
        },
        {
          "title": "Ryu, S., Kim, K. and Hahn, J. (2022) “Crowdfunding Success Effects on Financing Outcomes for Startups: A Signaling Theory Perspective,” MIS Quarterly,",
          "year": 2022,
          "full_citation": "Ryu, S., Kim, K. and Hahn, J. (2022) “Crowdfunding Success Effects on Financing Outcomes for Startups: A Signaling Theory Perspective,” MIS Quarterly, vol. 47, no. 3, pp. 1271-1302."
        },
        {
          "title": "The Complex Effects of Cross-Domain Knowledge on IS Development: A Simulation-Based Theory Development,",
          "year": 2021,
          "full_citation": "Hahn, J. and Lee, G. 2021 \"The Complex Effects of Cross-Domain Knowledge on IS Development: A Simulation-Based Theory Development,\" MIS Quarterly, 45(4), pp. 2022-2054."
        },
        {
          "title": "How Rewarding Are Your Rewards? A Value-Based View of Crowdfunding Rewards and Crowdfunding Performance,",
          "year": 2021,
          "full_citation": "Jiang, H., Wang, Z., Yang, L., Shen, J. and Hahn, J. 2021 \"How Rewarding Are Your Rewards? A Value-Based View of Crowdfunding Rewards and Crowdfunding Performance,\" Entrepreneurship Theory and Practice,453, pp. 562-599."
        },
        {
          "title": "Scarcity Strategy in Crowdfunding: An Empirical Exploration of Reward Limits,",
          "year": 2020,
          "full_citation": "Yang, L., Wang, Z. and Hahn, J. 2020 \"Scarcity Strategy in Crowdfunding: An Empirical Exploration of Reward Limits,\" Information Systems Research, 314, pp. 1107-1131."
        },
        {
          "title": "Learning Effects of Domain, Technology, and Customer Knowledge in Information Systems Development: An Empirical Study,",
          "year": 2017,
          "full_citation": "Kang, K., Hahn, J. and De, P. 2017 \"Learning Effects of Domain, Technology, and Customer Knowledge in Information Systems Development: An Empirical Study,\" Information Systems Research, 284, pp. 797-811."
        },
        {
          "title": "Leader Influence on Sustained Participation in Online Collaborative Work Communities: A Simulation-based Approach,",
          "year": 2016,
          "full_citation": "Oh, W., Moon, J.Y., Hahn, J., and Kim, T. 2016 \"Leader Influence on Sustained Participation in Online Collaborative Work Communities: A Simulation-based Approach,\" Information Systems Research, 272, pp. 383-402."
        },
        {
          "title": "Why are Some Diagrams Easier to Work With?: Effects of Diagrammatic Representation on the Cognitive Integration Process of Systems Analysis and Design,",
          "year": 1999,
          "full_citation": "Hahn, J. and Kim, J. 1999 \"Why are Some Diagrams Easier to Work With?: Effects of Diagrammatic Representation on the Cognitive Integration Process of Systems Analysis and Design,\" ACM Transactions on Computer Human Interaction, 63, pp. 181-213."
        },
        {
          "title": "[Guest Editorial] Big Data and Analytics in Healthcare: Introduction to the Special Issue,",
          "year": 2016,
          "full_citation": "Kankanhalli, A., Hahn, J., Tan, S. and Gao, G. 2016 \"[Guest Editorial] Big Data and Analytics in Healthcare: Introduction to the Special Issue,\"Information Systems Frontiers, 182 Special Section on Big Data and Analytics in Healthcare, pp. 233-235."
        },
        {
          "title": "Continued Participation in Online Innovation Communities: Does Community Response Matter Equally for Everyone?",
          "year": 2013,
          "full_citation": "Zhang, C., Hahn, J. and De, P. 2013 \"Continued Participation in Online Innovation Communities: Does Community Response Matter Equally for Everyone?\" Information Systems Research, 244 pp. 1112-1130."
        },
        {
          "title": "Momentum and Organizational Risk Taking: Evidence from the National Football League,",
          "year": 2013,
          "full_citation": "Lehman, D.W. and Hahn, J. 2013 \"Momentum and Organizational Risk Taking: Evidence from the National Football League,\" Management Science, 594, pp. 852-8680."
        },
        {
          "title": "How Old are You Really?: Cognitive Age in Technology Acceptance,",
          "year": 2013,
          "full_citation": "Hong, S.J., Lui, C., Hahn, J., Moon, J. Y. and Kim, T.K. 2013 \"How Old are You Really?: Cognitive Age in Technology Acceptance,\" Decision Support Systems, 56, pp. 122-130."
        },
        {
          "title": "How Can We Understand a System with So Many Diagrams: Cognitive Integration Processes in Diagrammatic Reasoning,",
          "year": 2000,
          "full_citation": "Kim, J., Hahn, J. and Hahn, H. 2000 \"How Can We Understand a System with So Many Diagrams: Cognitive Integration Processes in Diagrammatic Reasoning,\" Information Systems Research, 113, pp. 284-303."
        },
        {
          "title": "Performance Periods and the Dynamics of the Performance-Risk Relationship,",
          "year": 2011,
          "full_citation": "Lehman, D.W., Hahn, J., Ramajuman, R. and Alge, B. 2011 \"Performance Periods and the Dynamics of the Performance-Risk Relationship,\"Organization Science, 226, pp. 1613-1630."
        },
        {
          "title": "IT Intensity, Competition, and Inter-industry IT Spillover,",
          "year": 2011,
          "full_citation": "Han, K., Chang, Y.B., and Hahn, J. 2011 \"IT Intensity, Competition, and Inter-industry IT Spillover,\" Journal of Management Information Systems, 281, pp. 117-147."
        },
        {
          "title": "Knowledge Management Systems and Organizational Knowledge Processing Challenges,",
          "year": 2009,
          "full_citation": "Hahn, J. and Wang, T.-W. 2009 \"Knowledge Management Systems and Organizational Knowledge Processing Challenges,\" Decision Support Systems, 474, pp. 332-342."
        },
        {
          "title": "Emergence of New Project Teams from Open Source Software Developer Networks: Impact of Prior Collaboration Ties,",
          "year": 2008,
          "full_citation": "Hahn, J., Moon, J.Y. and Zhang, C. 2008 \"Emergence of New Project Teams from Open Source Software Developer Networks: Impact of Prior Collaboration Ties,\" Information Systems Research, 193, pp. 369-391."
        }
      ],
      "publications_count": 22,
      "awards": [
        "Best Conference Paper Award (2nd Runner Up), Blockchain, DLT and Fintech Track, International Conference on Information Systems (ICIS), December 2023.",
        "Best Conference Paper Award (Nominee), Cybersecurity and Privacy Track, International Conference on Information Systems (ICIS), December 2023.",
        "AIS Distinguished Member, June 2022",
        "Best Paper in Track Award (Sharing Economy, Platforms and Crowd Track), International Conference on Information Systems (ICIS), December 2021.",
        "Best Completed Research Paper Award, International Conference on Information Systems (ICIS), December 2020.",
        "Best Paper in Track Award (IS Development and Project Management Track), International Conference on Information Systems (ICIS), December 2020.",
        "Best Paper in Track Award (Advances in Research Methods Track), International Conference on Information Systems (ICIS), December 2020.",
        "Best Paper Award, Workshop on Information Technology and Systems (WITS), December 2016.",
        "Faculty Teaching Excellence Award (FTEA), AY2013-14, School of Computing, National University of Singapore, 2014",
        "Best 2013 Published Paper Award, OCIS Division, Academy of Management, August 2014",
        "ISR Best Reviewer, INFORMS Information Systems Society and Information Systems Research, October 2009"
      ],
      "awards_count": 11,
      "courses": []
    },
    {
      "name": "HENG Cheng Suang",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/hengcs",
      "appointment": "Associate Professor",
      "additional_titles": [
        "Chair, NUS Teaching Academy"
      ],
      "office": "COM2-04-41",
      "phone": "660 12268",
      "email": "hengcs@comp.nus.edu.sg",
      "personal_page": "https://www.comp.nus.edu.sg/disa/bio/hengcs",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/hengcs.jpg",
      "profile": "Dr. Heng Cheng Suang is an Associate Professor with tenure at the Department of Information Systems and Analytics, School of Computing of the National University of Singapore (NUS). He received his Ph.D. (Organization, Technology and Entrepreneurship) from Stanford University, Management Science & Engineering Department. Prior to his post graduate studies, he worked with the former Singapore Trade Development Board (now known as Enterprise Singapore) as a Senior Trade Officer (Information, Technology & Communications). He also had his internship in Chartered Industries of Singapore and Apple Computer (Singapore).\n\nDr. Heng is currently the Chair of NUS Teaching Academy (NUSTA) , having been a Fellow for 8 years. He used to serve in the Faculty Teaching Excellence Committee (FTEC). He is now serving on the NUS Overseas Colleges (NOC) Steering Committee, Outstanding Undergraduate Research (OUR) committee, and Departmental Ethics Review Committee (DERC). He has been appointed onto the Editorial Review Board of MIS Quarterly (MISQ) and IEEE Transactions on Engineering Management (TEM), having served as the Track Chair for International Conference on Information Systems and Pacific Asia Conference on Information Systems (ICIS 2022, 2021, PACIS 2021, 2020, 2015, 2014, 2013), Associate Editor for International Conference on Information Systems, European Conference on Information Systems, and Pacific Asia Conference on Information Systems (ICIS 2019, 2018, 2017, 2016, 2015, 2014, 2012, 2011, ECIS 2020, 2016, PACIS 2017, 2016), and a reviewer for top journals such as MIS Quarterly, Information Systems Research, IEEE Transactions on Engineering Management, and others.\n\nDr. Heng’s primary research focuses on how organizations strategise their use of IT. In recent years, while some organizations have begun exploiting social media and other digital platforms for better branding and marketing of their products, some organizations have embarked on several innovations and entrepreneurial spawning with the possibilities conferred by new technology. In contrast, some organizations still regard IT department as a cost centre and would rather opt for IT outsourcing. Given these divided opinions, Dr. Heng’s 4 research streams focus on “Organization Strategy with Information Technology/Digital Media”.",
      "education": [
        "Ph.D. (Organization, Technology & Entrepreneurship, Stanford University)",
        "M.Sc. (Computer & Information Sciences, National University of Singapore)",
        "B.Sc. (Computer & Information Sciences, Honours, National University of Singapore)"
      ],
      "research_areas": [
        "Digital Transformation, Platforms & Innovation",
        "Computational Social Science"
      ],
      "research_interests": [
        "Strategic Use of Social Media Research & New Digital Media",
        "New Digital Economy and Sharing Economy Research",
        "IT Entrepreneurship & Innovation",
        "IT Outsourcing & Escalation Decisions"
      ],
      "research_projects": [
        {
          "title": "Value Co-Creation on E-Commerce and/or Sharing Economy",
          "description": "This project examines how platform entry into the spaces of its partners (complementors) affects both joint value creation and individual value capture. While previous research focuses on entry as competition, this study explores its impact on overall value, complementor strategies for protection, and unique entry patterns in e-commerce.",
          "tags": [
            "Digital Transformation, Platforms & Innovation"
          ]
        }
      ],
      "phd_alumni": [
        {
          "name": "Li Ding",
          "first_placement": "Assistant Professor, Nanjing University",
          "graduation_year": 2019,
          "current_position": "Assistant Professor",
          "institution": "Nanjing University"
        },
        {
          "name": "Chen Qing",
          "first_placement": "Senior Analyst, China Insurance Investment Co. Ltd",
          "graduation_year": 2016
        }
      ],
      "publications": [
        {
          "title": "Empowerment of Grassroots Consumers: A Revelatory Case of a Chinese FinTech Innovation.",
          "year": 2021,
          "full_citation": "2021. Journal of the Association for Information Systems JAIS \"Empowerment of Grassroots Consumers: A Revelatory Case of a Chinese FinTech Innovation.\"Co-authors: Tan, T., Zhang, Y., & Ge, C."
        },
        {
          "title": "Facilitating Complex Product Choices on E-commerce Sites: An Unconscious Thought and Circadian Preference Perspective.",
          "year": 2020,
          "full_citation": "2020. Decision Support Systems DSS\"Facilitating Complex Product Choices on E-commerce Sites: An Unconscious Thought and Circadian Preference Perspective.\"Co-authors: Shen, Y., Sun, H.,& Chan, H. C."
        },
        {
          "title": "Financial Awareness: Developing an Extension of Financial Literacy for Low-Income Populations Utilizing FinTech.",
          "year": 2020,
          "full_citation": "2020. Pacific Asia Conference on Information Systems PACIS \"Financial Awareness: Developing an Extension of Financial Literacy for Low-Income Populations Utilizing FinTech.\" Co-author: Rivas, A."
        },
        {
          "title": "Human Flesh Search: What did we Find?",
          "year": 2019,
          "full_citation": "2019. Information & Management I&M\"Human Flesh Search: What did we Find?\"Co-authors: Lin, Z., Xu, X., Zhang, Y., & Zhao, Y."
        },
        {
          "title": "The Distinct Signaling Effects of R&D Subsidy and Non-R&D Subsidy on IPO Performance of IT Entrepreneurial Firms in China.",
          "year": 2018,
          "full_citation": "2018. Research Policy RP\"The Distinct Signaling Effects of R&D Subsidy and Non-R&D Subsidy on IPO Performance of IT Entrepreneurial Firms in China.\"Co-authors: Chen. J.,&Tan, B. C. Y."
        },
        {
          "title": "A Qualitative Study about Designing and Expressing Emotion: A Tale of Two Cycles.",
          "year": 2018,
          "full_citation": "2018.. European Conference on Information Systems ECIS \"A Qualitative Study about Designing and Expressing Emotion: A Tale of Two Cycles.\"Co-authors: Luo, K., Cui, W., & Ding, D."
        },
        {
          "title": "2017.MIS Quarterly MISQ“The Demand Effects of Product Recommendation Networks: An Empirical Analysis of Network Diversity and Stability.” Co-authors: ",
          "year": 2017,
          "full_citation": "2017.MIS Quarterly MISQ“The Demand Effects of Product Recommendation Networks: An Empirical Analysis of Network Diversity and Stability.” Co-authors: Lin, Z., & Goh, K. Y."
        },
        {
          "title": "The Paradoxes of Word-of-Mouth in Electronic Commerce.",
          "year": 2017,
          "full_citation": "2017.Journal of Management Information Systems JMIS \"The Paradoxes of Word-of-Mouth in Electronic Commerce.\" Co-author: Lin, Z."
        },
        {
          "title": "Effect of Multi-vendor Outsourcing on Organizational Learning: A Social Relation Perspective.",
          "year": 2017,
          "full_citation": "2017. Information & Management I&M \"Effect of Multi-vendor Outsourcing on Organizational Learning: A Social Relation Perspective.\"Co-authors: Koo, Y., Lee, J. N., & Park, J."
        },
        {
          "title": "Price Competition and Demand for Online Content: Uncovering the Role of Content Differentiation and Network Structure.",
          "year": 2017,
          "full_citation": "2017. International Conference on Information Systems ICIS \"Price Competition and Demand for Online Content: Uncovering the Role of Content Differentiation and Network Structure.\""
        },
        {
          "title": "Social Media in Families: A Qualitative Inquiry from the Perspectives of Parents and Children.",
          "year": 2017,
          "full_citation": "2017. Pacific Asia Conference on Information Systems PACIS \"Social Media in Families: A Qualitative Inquiry from the Perspectives of Parents and Children.\""
        },
        {
          "title": "Sharing behind the Scenes: Understanding User Bypassing Behavior in Sharing Economy.",
          "year": 2017,
          "full_citation": "2017. European Conference on Information Systems ECIS \"Sharing behind the Scenes: Understanding User Bypassing Behavior in Sharing Economy.\""
        },
        {
          "title": "How People React to the ‘Also Recommended’ Section of Online Stores.",
          "year": 2016,
          "full_citation": "2016. LSE Business Review \"How People React to the ‘Also Recommended’ Section of Online Stores.\"Co-authors: Lin, Z., & Goh, K. Y."
        },
        {
          "title": "2016.International Conference on Information Systems ICIS“Monetizing User-Generated Content in FinTech: An Empirical Study of a Social Investing Site.",
          "year": 2016,
          "full_citation": "2016.International Conference on Information Systems ICIS“Monetizing User-Generated Content in FinTech: An Empirical Study of a Social Investing Site.” Co-authors: Li, D., & Goh, K. Y."
        },
        {
          "title": "2016.International Conference on Information Systems ICIS“Winning over Grassroot Consumers: An Empowerment Perspective of Yu'E Bao.” Co-authors: Tan, ",
          "year": 2016,
          "full_citation": "2016.International Conference on Information Systems ICIS“Winning over Grassroot Consumers: An Empowerment Perspective of Yu'E Bao.” Co-authors: Tan, T., & Zhang, Y."
        },
        {
          "title": "2016.International Conference on Information Systems ICIS“The Medium Matters: Effects on What Consumers Talk about regarding Movie Trailers.” Co-autho",
          "year": 2016,
          "full_citation": "2016.International Conference on Information Systems ICIS“The Medium Matters: Effects on What Consumers Talk about regarding Movie Trailers.” Co-authors: Shen, Y., & Chan, H. C."
        },
        {
          "title": "2016.Pacific Asia Conference on Information Systems PACIS“Why Do Users Become Inactive on Online Social Networks? A Friendship Perspective.” Co-author",
          "year": 2016,
          "full_citation": "2016.Pacific Asia Conference on Information Systems PACIS“Why Do Users Become Inactive on Online Social Networks? A Friendship Perspective.” Co-authors: Zhou, F., Peng, X., & Zhou, L."
        },
        {
          "title": "2016.European Conference on Information Systems ECIS“Expectation Shortfall in the Highly Specialized B2B IT Innovation.” Co-authors: Dong, Y. Q., Sapu",
          "year": 2016,
          "full_citation": "2016.European Conference on Information Systems ECIS“Expectation Shortfall in the Highly Specialized B2B IT Innovation.” Co-authors: Dong, Y. Q., Sapumal, A., & Han, L."
        },
        {
          "title": "2015.Journal of Management Information Systems JMIS“The Paradoxes of Word-of-Mouth in Electronic Commerce.” 324: 246-284. Co-author: Lin, Z.",
          "year": 2015,
          "full_citation": "2015.Journal of Management Information Systems JMIS“The Paradoxes of Word-of-Mouth in Electronic Commerce.” 324: 246-284. Co-author: Lin, Z."
        },
        {
          "title": "2015.International Conference on Information Systems ICIS“Why Do Users Abandon Online Social Network Sites? A Case Study of the Social Capital Paradox",
          "year": 2015,
          "full_citation": "2015.International Conference on Information Systems ICIS“Why Do Users Abandon Online Social Network Sites? A Case Study of the Social Capital Paradox.” Co-authors: Wang, Y., Zhang, X., & Peng, J."
        },
        {
          "title": "2015.China Summer Workshop on Information Management CSWIM“The Making of Entrepreneurs from the IT Industry: Evidences from a Quasi Experiment with a ",
          "year": 2015,
          "full_citation": "2015.China Summer Workshop on Information Management CSWIM“The Making of Entrepreneurs from the IT Industry: Evidences from a Quasi Experiment with a Finite Mixture Model.” Co-authors: Chen, Q., & Huang, K. W. * Best Paper Nominee *"
        },
        {
          "title": "2014.International Conference on Information Systems ICIS“IT Investment: The Unexpected Effects on Entrepreneurial Spawning.” Co-authors: Chen, Q., & ",
          "year": 2014,
          "full_citation": "2014.International Conference on Information Systems ICIS“IT Investment: The Unexpected Effects on Entrepreneurial Spawning.” Co-authors: Chen, Q., & Huang, K. W."
        },
        {
          "title": "2014.OASIS Workshop“Social Media Migration for Marketing: Evidence from Startups.” Co-authors: Zhou, Y., Ding, Y., & Kankanhalli, A. M.",
          "year": 2014,
          "full_citation": "2014.OASIS Workshop“Social Media Migration for Marketing: Evidence from Startups.” Co-authors: Zhou, Y., Ding, Y., & Kankanhalli, A. M."
        },
        {
          "title": "2013.Information Systems Research ISR“Social Media Brand Community and Consumer Behavior: Quantifying the Relative Impact of User- and Marketer-Genera",
          "year": 2013,
          "full_citation": "2013.Information Systems Research ISR“Social Media Brand Community and Consumer Behavior: Quantifying the Relative Impact of User- and Marketer-Generated Content.” 241: 88-107. Co-authors: Goh, K. Y., & Lin, Z."
        },
        {
          "title": "2013.Information Systems Research ISR“Privacy Concerns and Privacy-Protective Behavior in Synchronous Online Social Interactions.” 243: 579-595. Co-au",
          "year": 2013,
          "full_citation": "2013.Information Systems Research ISR“Privacy Concerns and Privacy-Protective Behavior in Synchronous Online Social Interactions.” 243: 579-595. Co-authors: Jiang, Z., & Choi, B. C. F."
        },
        {
          "title": "2013.International Conference on Information Systems ICIS“Strategizing the IT Entrepreneurial Teams: A Dynamic Equilibrium Perspective.” Co-author: Fe",
          "year": 2013,
          "full_citation": "2013.International Conference on Information Systems ICIS“Strategizing the IT Entrepreneurial Teams: A Dynamic Equilibrium Perspective.” Co-author: Feng. Y."
        },
        {
          "title": "2013.International Association for Chinese Management Research IACMR“To Better Leverage Government R&D Grants for IT Innovation: Are Past R&D Experien",
          "year": 2013,
          "full_citation": "2013.International Association for Chinese Management Research IACMR“To Better Leverage Government R&D Grants for IT Innovation: Are Past R&D Experience Capability or Liability?” Co-authors: Chen, J., & Tan, B. C. Y."
        },
        {
          "title": "2012.International Conference on Information Systems ICIS“\"Effects of Government Research and Development Grants on IT Entrepreneurial Firm Performanc",
          "year": 2012,
          "full_citation": "2012.International Conference on Information Systems ICIS“\"Effects of Government Research and Development Grants on IT Entrepreneurial Firm Performance: A New Perspective of Exploration versus Exploitation.” Co-authors: Chen, J., & Tan, B. C. Y."
        },
        {
          "title": "2012.International Conference on Electronic Commerce ICEC“Contract Renegotiation and Bargaining Power: Evidence from IT-related Outsourcing Contracts\"",
          "year": 2012,
          "full_citation": "2012.International Conference on Electronic Commerce ICEC“Contract Renegotiation and Bargaining Power: Evidence from IT-related Outsourcing Contracts\". Co-author: Chen, Y. * Best Theme Paper Award *"
        },
        {
          "title": "2010.International Conference on Information Systems ICIS“Helping or Hampering: Effects of IT Outsourcing on Client’s Product Innovation.” Co-author: ",
          "year": 2010,
          "full_citation": "2010.International Conference on Information Systems ICIS“Helping or Hampering: Effects of IT Outsourcing on Client’s Product Innovation.” Co-author: Feng, Y."
        },
        {
          "title": "2009.International Conference on Information Systems ICIS“Investigating Vendors’ Decision to Terminate IT Outsourcing Contracts.” Co-authors: Du, W., ",
          "year": 2009,
          "full_citation": "2009.International Conference on Information Systems ICIS“Investigating Vendors’ Decision to Terminate IT Outsourcing Contracts.” Co-authors: Du, W., & Feng, Y."
        },
        {
          "title": "2009.International Conference on Information Systems ICIS“Multi-Vendor Outsourcing: Relational Structures and Organizational Learning From a Social Re",
          "year": 2009,
          "full_citation": "2009.International Conference on Information Systems ICIS“Multi-Vendor Outsourcing: Relational Structures and Organizational Learning From a Social Relation Perspective.” Co-authors: Lee, J. N., & Lee, J."
        },
        {
          "title": "2003.Journal of the AIS JAIS“Willingness to Continue with Software Projects: Effects of Feedback Direction and Optimism under High and Low Accountabil",
          "year": 2003,
          "full_citation": "2003.Journal of the AIS JAIS“Willingness to Continue with Software Projects: Effects of Feedback Direction and Optimism under High and Low Accountability Conditions.” 44: 171-194. Co-authors: Tan, B. C. Y., & Wei, K. K."
        },
        {
          "title": "2003.Information & Management I&M“De-escalation of Commitment in Software Projects: Who Matters? What Matters?” 411: 99-110. Co-authors: Tan, B. C. Y.",
          "year": 2003,
          "full_citation": "2003.Information & Management I&M“De-escalation of Commitment in Software Projects: Who Matters? What Matters?” 411: 99-110. Co-authors: Tan, B. C. Y., & Wei, K. K."
        }
      ],
      "publications_count": 34,
      "awards": [
        "2020/2021 NUS Outstanding Educator Award (2022)",
        "2019/2020 NUS Annual Teaching Excellence Award",
        "2013/2014 to 2018/2019 NUS Annual Teaching Excellence Award (Honour Roll)",
        "2012/2013 NUS Annual Teaching Excellence Award",
        "2011/2012 NUS Annual Teaching Excellence Award",
        "2010/2011 NUS Annual Teaching Excellence Award",
        "2021/2022 SOC Faculty Teaching Excellence Award (Honour Roll)",
        "2020/2021 SOC Faculty Teaching Excellence Award",
        "2019/2020 SOC Faculty Teaching Excellence Award",
        "2018/2019 SOC Faculty Teaching Excellence Award",
        "2012/2013 to 2017/2018 SOC Faculty Teaching Excellence Award (Honour Roll)",
        "2011/2012 SOC Faculty Teaching Excellence Award",
        "2010/2011 SOC Faculty Teaching Excellence Award",
        "2009/2010 SOC Faculty Teaching Excellence Award"
      ],
      "awards_count": 14,
      "courses": []
    },
    {
      "name": "HUANG Ke Wei",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/huangkw",
      "appointment": "Associate Professor",
      "additional_titles": [
        "Executive Director, Asian Institute of Digital Finance"
      ],
      "office": "COM2-04-18",
      "phone": "651 62786",
      "email": "huangkw@comp.nus.edu.sg",
      "personal_page": "https://www.comp.nus.edu.sg/~huangkw",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/huangkw.jpg",
      "profile": "Dr Ke-Wei Huang is an Associate Professor in the Department of Information Systems and Analytics at the National University of Singapore (NUS). Dr Huang joined NUS in July 2007. He received his PhD (2007), MPhil (2005), and MSc (2002) degrees in Information Systems from the Stern School of Business at New York University, and his MBA in Finance (1997) and BSc in Electrical Engineering (1995) from National Taiwan University.\n\nDr Huang's research interests are in the economics of information systems and data mining for financial applications. Currently, he focuses on various topics of pricing digital goods, labor economics of IT professionals, and data mining or econometrics issues for topics in accounting or finance.",
      "education": [
        "Ph.D. (Information Systems, New York University, 2007)",
        "M.Sc. (Information Systems, New York University, 2002)",
        "M.B.A. (Finance, National Taiwan University, 1997)",
        "B.Sc. (Electrical Engineering, National Taiwan University, 1995)"
      ],
      "research_areas": [
        "Data Science & Business Analytics",
        "FinTech",
        "Computational Social Science"
      ],
      "research_interests": [
        "Forecasting Models for Financial and Accounting Applications",
        "Machine Learning for Improving Social Science Research Methods",
        "Labor Economics in Information Technologies Industries",
        "Machine Learning Applications in FinTech",
        "Economcis of FinTech"
      ],
      "research_projects": [],
      "phd_alumni": [
        {
          "name": "Liu Xuanqi",
          "first_placement": "Assistant Professor, Hunan University",
          "graduation_year": 2024,
          "current_position": "Assistant Professor",
          "institution": "Hunan University"
        },
        {
          "name": "Guo Yutong",
          "first_placement": "Assistant Professor, Chinese University of Hong Kong (Shenzhen)",
          "graduation_year": 2023,
          "current_position": "Assistant Professor",
          "institution": "Chinese University of Hong Kong (Shenzhen)"
        },
        {
          "name": "Wang Qi",
          "first_placement": "Assistant Professor, City University of Hong Kong",
          "graduation_year": 2022,
          "current_position": "Assistant Professor",
          "institution": "City University of Hong Kong"
        },
        {
          "name": "Qiao Mengke",
          "first_placement": "Assistant Professor, University of Science and Technology of China",
          "graduation_year": 2021,
          "current_position": "Assistant Professor",
          "institution": "The University of Alabama"
        },
        {
          "name": "Sangwook Ha",
          "first_placement": "Post-Doctoral Research Fellow, NUS School of Computing",
          "graduation_year": 2019,
          "current_position": "Assistant Professor",
          "institution": "BNU-HKBU United International College"
        },
        {
          "name": "Chen Qing",
          "first_placement": "Senior Analyst, China Insurance Investment Co. Ltd",
          "graduation_year": 2016
        },
        {
          "name": "Li Zhuolun",
          "first_placement": "Research Fellow, Singapore Management University",
          "graduation_year": 2016
        },
        {
          "name": "Zou Xiao",
          "first_placement": "Data Scientist, SingTel",
          "graduation_year": 2015,
          "current_position": "Data Scientist"
        },
        {
          "name": "Ge Chunmian",
          "first_placement": "Assistant Professor, South China University of Technology",
          "graduation_year": 2014,
          "current_position": "Professor",
          "institution": "South China University of Technology"
        }
      ],
      "publications": [
        {
          "title": "“Handling Missing Values in Information Systems Research: A Review of Methods and Assumptions,” by Jiaxu Peng, Jungpil Hahn, and Ke-Wei Huang, Informa",
          "year": 2023,
          "full_citation": "“Handling Missing Values in Information Systems Research: A Review of Methods and Assumptions,” by Jiaxu Peng, Jungpil Hahn, and Ke-Wei Huang, Information Systems Research. Vol. 34 (1), 2023 p.5-26."
        },
        {
          "title": "“Correcting Misclassification Bias in Regression Models with Variables Generated via Data Mining” by Mengke Qiao and Ke-Wei Huang, Information Systems",
          "year": 2021,
          "full_citation": "“Correcting Misclassification Bias in Regression Models with Variables Generated via Data Mining” by Mengke Qiao and Ke-Wei Huang, Information Systems Research, Vol. 32 (2), 2021, p.462-480."
        },
        {
          "title": "“Platform Skills and the Value of New Hires in the Software Industry” by Chunmian Ge, Ke-Wei Huang, and Atreyi Kankanhalli, Research Policy, Vol. 49 (",
          "year": 2020,
          "full_citation": "“Platform Skills and the Value of New Hires in the Software Industry” by Chunmian Ge, Ke-Wei Huang, and Atreyi Kankanhalli, Research Policy, Vol. 49 (1) 2020, 103864."
        },
        {
          "title": "Pricing Data Services: Pricing by Minutes, by Gigs, or by Mega Bytes per Second?",
          "year": 2016,
          "full_citation": "\"Pricing Data Services: Pricing by Minutes, by Gigs, or by Mega Bytes per Second?\" by Ying-Ju Chen and Ke-Wei Huang, Information Systems Research, Vol. 27 (3), 2016, p.596-617."
        },
        {
          "title": "“Engineer/Scientist Careers: Patents, Online Profiles, and Misclassification Bias,” by Chunmian Ge, Ke-Wei Huang, and Ivan Png,Strategic Management Jo",
          "year": 2016,
          "full_citation": "“Engineer/Scientist Careers: Patents, Online Profiles, and Misclassification Bias,” by Chunmian Ge, Ke-Wei Huang, and Ivan Png,Strategic Management Journal, Vol. 37 1, 2016 January, p.232–253."
        },
        {
          "title": "“Investigating the Determinants of Starting Salary of IT Graduates,” by Chunmian Ge, Atreyi Kankanhalli and Ke-Wei Huang,DATA BASE for Advances in Inf",
          "year": 2015,
          "full_citation": "“Investigating the Determinants of Starting Salary of IT Graduates,” by Chunmian Ge, Atreyi Kankanhalli and Ke-Wei Huang,DATA BASE for Advances in Information Systems, Vol. 46 4, 2015 November, p.9-25."
        },
        {
          "title": "“Leveraging Location-Based Services for Couponing and Infomediation” by Xiao Zou and Ke-Wei Huang,Decision Support Systems, Vol. 78 10, 2015 October, ",
          "year": 2015,
          "full_citation": "“Leveraging Location-Based Services for Couponing and Infomediation” by Xiao Zou and Ke-Wei Huang,Decision Support Systems, Vol. 78 10, 2015 October, p.93–103."
        },
        {
          "title": "“Analyzing the Scale Economies of Software-as-a-Service Software Firms: A Stochastic Frontier Approach” by Ge Chunmian and Ke-Wei Huang,IEEE Transacti",
          "year": 2014,
          "full_citation": "“Analyzing the Scale Economies of Software-as-a-Service Software Firms: A Stochastic Frontier Approach” by Ge Chunmian and Ke-Wei Huang,IEEE Transactions on Engineering Management, Vol. 61 4, 2014 October, p.610-622."
        },
        {
          "title": "\"Hierarchical Screening for Capacity Allocation in Supply Chains: The Role of Distributors” by Ying-Ju Chen, Mingcherng Deng, and Ke-Wei Huang,Product",
          "year": 2014,
          "full_citation": "\"Hierarchical Screening for Capacity Allocation in Supply Chains: The Role of Distributors” by Ying-Ju Chen, Mingcherng Deng, and Ke-Wei Huang,Production and Operations Management, Vol. 23 3, 2014 March, p.405-419."
        },
        {
          "title": "“A Multi-Label Text Classification Algorithm for Labeling Risk Factors in SEC Form 10-K,” by Ke-Wei Huang and Zhuolun Li, (2011), ACM Transactions on ",
          "year": 2011,
          "full_citation": "“A Multi-Label Text Classification Algorithm for Labeling Risk Factors in SEC Form 10-K,” by Ke-Wei Huang and Zhuolun Li, (2011), ACM Transactions on MIS, Vol. 2 (3), p.18:1-18:19."
        },
        {
          "title": "“Pricing Digital Goods: Discontinuous Costs and Shared Infrastructure,” by Ke-Wei Huang and Arun Sundararajan, (2011) Information Systems Research, Vo",
          "year": 2011,
          "full_citation": "“Pricing Digital Goods: Discontinuous Costs and Shared Infrastructure,” by Ke-Wei Huang and Arun Sundararajan, (2011) Information Systems Research, Vol. 22 (4), p.721-738."
        },
        {
          "title": "“Personalized Pricing and Quality Customization,” by Anindya Ghose and Ke-Wei Huang, (2009) Journal of Economics and Management Strategy, Vol.18 (4), ",
          "year": 2009,
          "full_citation": "“Personalized Pricing and Quality Customization,” by Anindya Ghose and Ke-Wei Huang, (2009) Journal of Economics and Management Strategy, Vol.18 (4), p.1095-1135."
        },
        {
          "title": "“Optimal Criteria for Selecting Price Discrimination Metrics when Buyers have Log-Normally Distributed Willingness-to-Pay,” by Ke-Wei Huang, (2009) Qu",
          "year": 2009,
          "full_citation": "“Optimal Criteria for Selecting Price Discrimination Metrics when Buyers have Log-Normally Distributed Willingness-to-Pay,” by Ke-Wei Huang, (2009) Quantitative Marketing and Economics, Vol.7 (3), p.321-341."
        },
        {
          "title": "Controlling Homophily in Social Network Regression by Neural Networks,",
          "year": null,
          "full_citation": "\"Controlling Homophily in Social Network Regression by Neural Networks,\" by Xuanqi Liu and Ke-Wei Huang, INFORMS Journal on Computing, Vol.37 (3), p. 684 - 702."
        },
        {
          "title": "“Investigating Employees’ Occupational Risks and Benefits Resulting from Artificial Intelligence: An Empirical Analysis,” by Xuanqi Liu, Qi Wang, and ",
          "year": 2024,
          "full_citation": "“Investigating Employees’ Occupational Risks and Benefits Resulting from Artificial Intelligence: An Empirical Analysis,” by Xuanqi Liu, Qi Wang, and Ke-Wei Huang (2024) Information & Management, Vol.61 (8), p.104036."
        },
        {
          "title": "“Correcting Measurement Error in Regression Models with Variables Constructed from Aggregated Output of Data Mining Models,” by Mengke Qiao and Ke-Wei",
          "year": 2025,
          "full_citation": "“Correcting Measurement Error in Regression Models with Variables Constructed from Aggregated Output of Data Mining Models,” by Mengke Qiao and Ke-Wei Huang (2025) MIS Quarterly,Vol. 49 (1), p.29-60."
        }
      ],
      "publications_count": 16,
      "awards": [],
      "awards_count": 0,
      "courses": []
    },
    {
      "name": "JIN Chen",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/jinc",
      "appointment": "Associate Professor",
      "additional_titles": [],
      "office": "COM2-04-35",
      "phone": "651 66148",
      "email": "jinc@comp.nus.edu.sg",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/jinc.jpg",
      "profile": "JIN, Chen is an Associate Professor in the Department of Information Systems and Analytics at the National University of Singapore (NUS) School of Computing. Prior to joining NUS, Chen was a Postdoctoral Research Fellow at the Wharton School, University of Pennsylvania. He earned his Ph.D. in Industrial Engineering and Management Sciences from Northwestern University. His research interests lie at the intersection of information systems and operations. His work focuses on digital marketplaces and platforms as well as sustainability.\n\nEmail: disjinc(at)nus(dot)edu(dot)sg",
      "education": [
        "B.Sc. (Shanghai Jiao Tong University, China)",
        "M.Sc. (Northwestern University, U.S.)",
        "Ph.D. (Northwestern University, U.S.)"
      ],
      "research_areas": [
        "Digital Transformation, Platforms & Innovation",
        "FinTech"
      ],
      "research_interests": [
        "Online Platforms",
        "Information System and Operation Interface",
        "Rating and Review Systems"
      ],
      "research_projects": [
        {
          "title": "Information Structure Design and Social Learning when Facing Information Manipulation",
          "description": "Addressing the surge in fake information dissemination on e-commerce and social media platforms, the project aims to explore optimal information structures to combat issues such as fake orders, reviews, and misinformation.",
          "tags": [
            "Digital Transformation, Platforms & Innovation,Computational Social Science"
          ]
        }
      ],
      "phd_alumni": [],
      "publications": [
        {
          "title": "Wu, C., Jin, C. and Chen, Y. J., 2025. Rewards or Upgrades? Incentive Designs in Referral Programs. Management Information Systems Quarterly. Accepted",
          "year": 2025,
          "full_citation": "Wu, C., Jin, C. and Chen, Y. J., 2025. Rewards or Upgrades? Incentive Designs in Referral Programs. Management Information Systems Quarterly. Accepted."
        },
        {
          "title": "Jin, C., Hosanagar, K. and Veeraraghavan, S., 2025. Welfare Impact of Bilateral Rating Display in Ride-Sharing Platforms. Manufacturing & Service Oper",
          "year": 2025,
          "full_citation": "Jin, C., Hosanagar, K. and Veeraraghavan, S., 2025. Welfare Impact of Bilateral Rating Display in Ride-Sharing Platforms. Manufacturing & Service Operations Management. Accepted."
        },
        {
          "title": "Wu, C., Jin, C. and Liu, Q., 2024. Bundling Variety, Usage, or Both? A Multi-Service Analysis of Pay-Per-Use and Subscription Pricing. Production and ",
          "year": 2024,
          "full_citation": "Wu, C., Jin, C. and Liu, Q., 2024. Bundling Variety, Usage, or Both? A Multi-Service Analysis of Pay-Per-Use and Subscription Pricing. Production and Operations Management. 33(10): 1979-1996"
        },
        {
          "title": "Jiang, H., Jin, C. and Yang, L., 2024. Revisiting the First-Order Approach to Principal-Agent Problems. Accepted into the 25th ACM Conference on Econo",
          "year": 2024,
          "full_citation": "Jiang, H., Jin, C. and Yang, L., 2024. Revisiting the First-Order Approach to Principal-Agent Problems. Accepted into the 25th ACM Conference on Economics and Computation, 2024 (EC '24)"
        },
        {
          "title": "Yang, L., Jin, C. and Shao, Z., 2024. Help and Haggle: Social Commerce Through Randomized, All-or-Nothing Discounts. Management Science. 70(9): 6026-6",
          "year": 2024,
          "full_citation": "Yang, L., Jin, C. and Shao, Z., 2024. Help and Haggle: Social Commerce Through Randomized, All-or-Nothing Discounts. Management Science. 70(9): 6026-6044."
        },
        {
          "title": "Wu, C., Jin, C. and Chen, Y. J., 2024. Add-On Pricing: A Queueing Perspective. Production and Operations Management. 33(2): 550-565.",
          "year": 2024,
          "full_citation": "Wu, C., Jin, C. and Chen, Y. J., 2024. Add-On Pricing: A Queueing Perspective. Production and Operations Management. 33(2): 550-565."
        },
        {
          "title": "Jin, C., Yang, L. and Hosanagar, K., 2023. To Brush or Not to Brush: Product Rankings, Consumer Search, and Fake Orders. Information Systems Research.",
          "year": 2023,
          "full_citation": "Jin, C., Yang, L. and Hosanagar, K., 2023. To Brush or Not to Brush: Product Rankings, Consumer Search, and Fake Orders. Information Systems Research. 34(2): 532-552."
        },
        {
          "title": "Jin, C., Wu, C. and Chen, Y. J., 2023. Managing Competition from Within and Outside: Using Strategic Inventory and Network Externality to Combat Copyc",
          "year": 2023,
          "full_citation": "Jin, C., Wu, C. and Chen, Y. J., 2023. Managing Competition from Within and Outside: Using Strategic Inventory and Network Externality to Combat Copycats. Manufacturing & Service Operations Management. 25(5): 1814-1834."
        },
        {
          "title": "Jin, C., Yang, L. and Zhu. C., 2023. Right to Repair: Pricing, Welfare, and Environmental Implications. Management Science. 69(2): 1017-1036.",
          "year": 2023,
          "full_citation": "Jin, C., Yang, L. and Zhu. C., 2023. Right to Repair: Pricing, Welfare, and Environmental Implications. Management Science. 69(2): 1017-1036."
        },
        {
          "title": "Yang, L., Jin, C. and Zhu, C., 2023. Research: The Unintended Consequences of Right-to-Repair Laws, Harvard Business Review (Digital Article)",
          "year": 2023,
          "full_citation": "Yang, L., Jin, C. and Zhu, C., 2023. Research: The Unintended Consequences of Right-to-Repair Laws, Harvard Business Review (Digital Article)"
        },
        {
          "title": "Wu, C., Jin, C. and Veeraraghavan, S., 2023. Designing Professional Services: Pricing and Priorities. Production and Operations Management. 32(8): 257",
          "year": 2023,
          "full_citation": "Wu, C., Jin, C. and Veeraraghavan, S., 2023. Designing Professional Services: Pricing and Priorities. Production and Operations Management. 32(8): 2578-2595."
        },
        {
          "title": "Jin, C., Wu, C. and Lahiri, A., 2022. Piracy and Bundling of Information Goods. Journal of Management Information Systems. 39(3): 906-933.",
          "year": 2022,
          "full_citation": "Jin, C., Wu, C. and Lahiri, A., 2022. Piracy and Bundling of Information Goods. Journal of Management Information Systems. 39(3): 906-933."
        },
        {
          "title": "Wu, C., Jin, C. and Chen, Y. J., 2022. Managing Customer Search via Bundling. Manufacturing & Service Operations Management. 24(4): 1906-1925.",
          "year": 2022,
          "full_citation": "Wu, C., Jin, C. and Chen, Y. J., 2022. Managing Customer Search via Bundling. Manufacturing & Service Operations Management. 24(4): 1906-1925."
        },
        {
          "title": "Jin, C., Liu, Q. and Wu, C., 2021. Selling Multiple Units to Strategic Consumers. Operations Research Letters. 49(2): 191-196.",
          "year": 2021,
          "full_citation": "Jin, C., Liu, Q. and Wu, C., 2021. Selling Multiple Units to Strategic Consumers. Operations Research Letters. 49(2): 191-196."
        }
      ],
      "publications_count": 14,
      "awards": [
        "Nominee, INFORMS Conference on Information Systems and Technology (CIST) Best Paper Award (4 out of 425 submissions), 2025",
        "Honorable Mention, International Conference of the Chinese Scholars Association for Management Science and Engineering (CSAMSE) Best Paper Award, 2025",
        "Finalist, MSOM Service Management SIG Best Paper Award (Best Published Paper on Service Management), 2024",
        "Outstanding Paper Award of the 18th International Conference on Operations and Supply Chain Management, 2024",
        "Nomination, NUS Young Researcher Award, 2022, 2023, 2024",
        "Nomination, Young Scientist Award, Singapore National Academy of Science, 2023",
        "School of Computing Faculty Teaching Excellence Award, 2021, 2022, 2023 (Honour Roll)",
        "Winner, INFORMS Energy, Natural Resources, and the Environment Section (ENRE) Young Researcher Prize, 2022",
        "Runner-up, INFORMS Conference on Information Systems and Technology (CIST) Best Paper Award (3 out of 257 submissions), 2022",
        "Finalist, INFORMS Service Science Best Cluster Paper Award, 2022",
        "Finalist, INFORMS Technology, Innovation Management, and Entrepreneurship Section (TIMES) Best Working Paper Competition, 2022",
        "Second Place, International Conference of the Chinese Scholars Association for Management Science and Engineering (CSAMSE) Best Paper Award, 2022",
        "Second Place, Best Student Paper Competition, POMS College of Supply Chain Management 2022 (awarded to student Zhu, C. for an early version of the paper \"Right to Repair\")",
        "NYU Networks, Electronic Commerce and Telecommunications (NET) Institute Summer Research Grant, 2022",
        "Finalist, INFORMS Service Science Best Student Paper Award, 2021 (awarded to student Zhu, C. for an early version of the paper \"Right to Repair\")",
        "NYU Networks, Electronic Commerce and Telecommunications (NET) Institute Summer Research Grant, 2019",
        "Finalist, INFORMS Service Science Best Cluster Paper Award, 2019",
        "Second Place, International Conference of the Chinese Scholars Association for Management Science and Engineering (CSAMSE) Best Paper Award, 2018"
      ],
      "awards_count": 18,
      "courses": []
    },
    {
      "name": "Atreyi KANKANHALLI",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/atreyi",
      "appointment": "Provost's Chair Professor",
      "additional_titles": [
        "Co-Director Centre for Computational Social Science and Humanities"
      ],
      "office": "COM3-02-37",
      "phone": "651 64865",
      "email": "atreyi@comp.nus.edu.sg",
      "personal_page": "https://www.comp.nus.edu.sg/~atreyi/CV-atreyi.pdf",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/atreyi.jpg",
      "profile": "Atreyi Kankanhalli is a Provost’s Chair Professor in the Department of Information Systems and Analytics at the School of Computing, National University of Singapore (NUS). She is also the Co-Director of the Centre for Computational Social Science and Humanities at NUS. She has previously served as Deputy Head (Research and Administration), Assistant Dean (Research), and Assistant Dean (Undergraduate Studies) at the School of Computing. Additionally, she was the founding Coordinator of the Service Systems Innovation Research Laboratory at NUS.\n\nProfessor Kankanhalli holds a Bachelor of Technology from the Indian Institute of Technology (IIT) Delhi, an M.S. from Rensselaer Polytechnic Institute (RPI), New York, and a Ph.D. from NUS. She has undertaken visiting appointments at the London School of Economics, University of California Berkeley, ESSEC Business School, and the Indian Institute of Science, Bangalore. Prior to joining academia, she gained extensive experience in industrial R&D and has consulted for several organisations, including the World Bank and Bosch SEA.\n\nHer research interests lie in online communities, digital collaboration, human-AI collaboration, digital transformation in healthcare, and open innovation. Her projects have been supported by both government and industry grants. Her work has been published in leading journals such as MIS Quarterly, Information Systems Research, Research Policy, Proceedings of the National Academy of Sciences, Journal of Management Information Systems, ACM Transactions on Management Information Systems, IEEE Transactions on Engineering Management, IEEE Transactions on Professional Communication, Journal of AIS, International Journal of Human-Computer Studies, and Communications of the ACM. She has also presented her research at top conferences including ICIS, the Academy of Management Meeting, HICSS, WISE, and WITS. Her over 200 publications are widely cited (Google Scholar).\n\nProfessor Kankanhalli frequently serves on program committees and as a conference chair for events such as ICIS, ACIS, AoM, PACIS, ICEGOV, and ICKM. She currently serves or has served on editorial boards of several prestigious journals, including Information Systems Research (Senior Editor, Associate Editor), MIS Quarterly (Senior Editor, Associate Editor), Journal of AIS (Senior Editor), IEEE Transactions on Engineering Management, Government Information Quarterly, and Information & Management (Associate Editor), among others. She has been Program Chair for ICIS 2021 (the first hybrid AIS conference), ICEGOV 2018, PACIS 2015, and BDAH 2014. She is also Doctoral Consortium Chair for ACIS 2024, ICIS 2022 and 2026, and AMCIS 2023. She has been invited to serve on the ICKM and SSME Councils, and has contributed to the AIS Finance Committee and the OCIS Executive Committee as International Representative-at-Large. She also served as AIS Vice President for Region 3.\n\nProfessor Kankanhalli has taught a wide range of Information Systems (IS) courses, including quantitative methods, information organisation, electronic government, health informatics, information security policy, service systems, and regulatory technology. She is a sought-after speaker at local and international forums and is actively involved in executive education. She has developed teaching materials such as training cases and textbooks.\n\nHer accolades include the President’s Graduate Fellowship, Dean’s Graduate Award, and the Infocomm Development Authority Gold Medal at NUS. She received the ACM-SIGMIS Best Doctoral Dissertation Award and was a runner-up for the MIS Quarterly Reviewer of the Year Award. She is also a recipient of the IBM Faculty Award and the IBM Smarter Planet Industry Skills Innovation Award, among several best paper awards. She is ranked among the world’s leading IS researchers (AIS Research Rankings). Most recently, she was recognised with the AIS Sandra Slaughter Service Award and honoured as an AIS Fellow. Her broader impact has been acknowledged through accolades such as Singapore’s 100 Women in Tech (SG100WIT) and the Asia Women Tech Leaders Award (AWTLA).",
      "education": [
        "Ph.D. (Information Systems, National University of Singapore)"
      ],
      "research_areas": [
        "Healthcare Informatics",
        "Digital Transformation, Platforms & Innovation",
        "Intelligent Systems",
        "Computational Social Science"
      ],
      "research_interests": [
        "Online Communities, Digital Collaboration, Human-AI Collaboration",
        "Digital Transformation - particularly in Healthcare, Open Innovation"
      ],
      "research_projects": [
        {
          "title": "Designing and Evaluating Healthcare QA Assistants: A Knowledge Based Approach",
          "description": "Healthcare question answer (QA) assistants address user health queries, tackling challenges like misinformation and information overload. This project explores integrating language models (LMs) and knowledge graphs (KG) to enhance the design and evaluation of healthcare QA systems.",
          "tags": [
            "Healthcare Informatics"
          ]
        },
        {
          "title": "The “Other Me”: Human-Centered AI Assistance In Situ",
          "description": "We propose an integrative program of fundamental research towards a vision in which every human will have an AI assistant for daily life and work. Our overall aim is to build conceptual understanding of human-AI collaboration, to develop representations, models, and algorithms for situated assistance, and to integrate them in an experimental device platform for evaluation.",
          "tags": [
            "Intelligent Systems,Computational Social Science"
          ]
        }
      ],
      "phd_alumni": [
        {
          "name": "Sangwook Ha",
          "first_placement": "Post-Doctoral Research Fellow, NUS School of Computing",
          "graduation_year": 2019,
          "current_position": "Assistant Professor",
          "institution": "BNU-HKBU United International College"
        },
        {
          "name": "Zhou Ya",
          "first_placement": "Assistant Professor, University of Nottingham, Ningbo",
          "graduation_year": 2018,
          "current_position": "Assistant Professor",
          "institution": "Xiamen University"
        },
        {
          "name": "Yang Zhenbin, Joel",
          "first_placement": "Lecturer, NUS School of Computing",
          "graduation_year": 2014,
          "current_position": "Director School of ICT and Lecturer",
          "institution": "Lecturer, NUS School of Computing"
        },
        {
          "name": "Ye Hua, Jonathan",
          "first_placement": "Lecturer, University of Auckland",
          "graduation_year": 2012,
          "current_position": "Associate Professor",
          "institution": "University of Oklahoma"
        },
        {
          "name": "Ng Boon Yuen",
          "first_placement": "Lecturer, NUS School of Computing",
          "graduation_year": 2010,
          "current_position": "Senior Lecturer",
          "institution": "Singapore University of Social Sciences"
        },
        {
          "name": "Pee Loo Geok",
          "first_placement": "Assistant Professor, Tokyo Institute of Technology",
          "graduation_year": 2010,
          "current_position": "Associate Professor",
          "institution": "Nanyang Technological University"
        },
        {
          "name": "Juliana Sutanto",
          "first_placement": "Assistant Professor, ETH Zurich",
          "graduation_year": 2008,
          "current_position": "Professor",
          "institution": "Monash University"
        },
        {
          "name": "Phang Chee Wei, David",
          "first_placement": "Assistant Professor, Fudan University",
          "graduation_year": 2008,
          "current_position": "Professor",
          "institution": "University of Nottingham, Ningbo"
        }
      ],
      "publications": [
        {
          "title": "Ye., H., Kankanhalli, A., and Tan, B.C.Y. (2025) “Examining Solver Performance in Crowdsourcing Contests: Does Ambidexterity Matter?”, Journal of AIS,",
          "year": 2025,
          "full_citation": "Ye., H., Kankanhalli, A., and Tan, B.C.Y. (2025) “Examining Solver Performance in Crowdsourcing Contests: Does Ambidexterity Matter?”, Journal of AIS, 26(4), 1138-1165. DOI: 10.17705/1jais.00932."
        },
        {
          "title": "Sarker, S., Bala, H., Hong, Y., Kankanhalli, A., Rossi, M., Gu, B., & Oestreicher-Singer, G. (2025). Advancing Next-Generation Multimethod Research in",
          "year": 2025,
          "full_citation": "Sarker, S., Bala, H., Hong, Y., Kankanhalli, A., Rossi, M., Gu, B., & Oestreicher-Singer, G. (2025). Advancing Next-Generation Multimethod Research in Information Systems: A Framework and Some Recommendations for Authors and Evaluators. Information Systems Research, 36(2), pp. 1–22."
        },
        {
          "title": "Klecun, E., Kankanhalli, A., and Zhou, Y. (2025) “Advancing Understanding of Scaling Health Information Infrastructures: Learning from EHR initiatives",
          "year": 2025,
          "full_citation": "Klecun, E., Kankanhalli, A., and Zhou, Y. (2025) “Advancing Understanding of Scaling Health Information Infrastructures: Learning from EHR initiatives in England”, MIS Quarterly, 49(2), 759-776."
        },
        {
          "title": "Maruping, L., Yin, D., Chen, A., Kankanhalli, A., Burton-Jones, A., and Brown, S. (2025) “Quantitative Behavioral IS Research – A Look Back and a Look",
          "year": 2025,
          "full_citation": "Maruping, L., Yin, D., Chen, A., Kankanhalli, A., Burton-Jones, A., and Brown, S. (2025) “Quantitative Behavioral IS Research – A Look Back and a Look Forward”, MIS Quarterly, 49(1), iii-xviii"
        },
        {
          "title": "Digital Technologies and the Advancement of Social Justice: A Framework and Agenda.",
          "year": 2024,
          "full_citation": "Pang, M. S., Kankanhalli, A., Aanestad, M., Ram, S., & Maruping, L. M. (2024). \"Digital Technologies and the Advancement of Social Justice: A Framework and Agenda.\" MIS Quarterly, 48(4), 1591-1610."
        },
        {
          "title": "Kankanhalli, A. 2024. “Peer Review in the Age of Generative AI”, Journal of AIS, 25(1), 76-84",
          "year": 2024,
          "full_citation": "Kankanhalli, A. 2024. “Peer Review in the Age of Generative AI”, Journal of AIS, 25(1), 76-84"
        },
        {
          "title": "Wright, R., Saunders, C., Sarker, S., Kankanhalli, A., Whitley, E., Tuunainen, V., and Henriksen, H.Z. (2023) “The Scholarly Divide: Insights from the",
          "year": 2023,
          "full_citation": "Wright, R., Saunders, C., Sarker, S., Kankanhalli, A., Whitley, E., Tuunainen, V., and Henriksen, H.Z. (2023) “The Scholarly Divide: Insights from the AIS Well-Being Project”, Communications of AIS, 52(1), 30."
        },
        {
          "title": "Sukhwal, P.C., and Kankanhalli, A. 2022. “Determining Containment Policy Impacts on Public Sentiment during the Pandemic Using Social Media Data”, Pro",
          "year": 2022,
          "full_citation": "Sukhwal, P.C., and Kankanhalli, A. 2022. “Determining Containment Policy Impacts on Public Sentiment during the Pandemic Using Social Media Data”, Proceedings of the National Academy of Sciences."
        },
        {
          "title": "Digital Technologies and Social Justice",
          "year": 2021,
          "full_citation": "Aanestad, M., Kankanhalli, A., Maruping, L., Pang, M. S., and Ram, S. 2021. \"Digital Technologies and Social Justice\", MIS Quarterly, 17(3), 515-536."
        },
        {
          "title": "Temporal Effects of Repeated Recognition and Lack of Recognition on Online Community Contributions",
          "year": 2020,
          "full_citation": "Bhattacharyya, S., Banerjee, S., Bose, I., and Kankanhalli, A. 2020. \"Temporal Effects of Repeated Recognition and Lack of Recognition on Online Community Contributions\", Journal of Management Information Systems, 37(2), 536-562"
        },
        {
          "title": "Value Co-creation for Service Innovation: Examining the Relationship between Service Innovativeness, Customer Participation, and Mobile App Performance",
          "year": 2020,
          "full_citation": "Ye, H., and Kankanhalli, A. 2020. \"Value Co-creation for Service Innovation: Examining the Relationship between Service Innovativeness, Customer Participation, and Mobile App Performance\", Journal of AIS, 21(2), Article 8."
        },
        {
          "title": "Platform Skills and the Value of New Hires in the Software Industry",
          "year": 2020,
          "full_citation": "Ge, C., Huang, K.W., and Kankanhalli, A. 2020. \"Platform Skills and the Value of New Hires in the Software Industry\", Research Policy, 49(1), 103864."
        },
        {
          "title": "Examining Gifting through Social Network Services: A Social Exchange Theory Perspective",
          "year": 2018,
          "full_citation": "Kim, H.W., Kankanhalli, A., and Lee, S. 2018. \"Examining Gifting through Social Network Services: A Social Exchange Theory Perspective\", Information Systems Research, 29(4), 805-828."
        },
        {
          "title": "Knowledge Management",
          "year": 2018,
          "full_citation": "Huang, P., Kankanhalli, A., Kyriakou, H., and Sabherwal, R. 2018 \"Knowledge Management\"; in MIS Quarterly Research Curations, Ashley Bush and Arun Rai, Eds.\nhttps://www.misqresearchcurations.org/"
        },
        {
          "title": "User Service Innovation on Mobile Phone Platforms: Investigating Impacts of Lead Userness, Toolkit Support, and Design Autonomy",
          "year": 2018,
          "full_citation": "Ye, H., and Kankanhalli, A. 2018. \"User Service Innovation on Mobile Phone Platforms: Investigating Impacts of Lead Userness, Toolkit Support, and Design Autonomy\", MIS Quarterly, 42(1), 165-187."
        },
        {
          "title": "What Motivates Contributors versus Lurkers? An Investigation of Online Policy Deliberation Forums",
          "year": 2015,
          "full_citation": "Phang, C.W., Kankanhalli, A., and Tan, B.C.Y. 2015. \"What Motivates Contributors versus Lurkers? An Investigation of Online Policy Deliberation Forums\", Information Systems Research, 26(4), 773-792."
        },
        {
          "title": "Sutanto, J., Kankanhalli, A., and Tan, B.C.Y. 2015. “Investigating Task Coordination in Globally Dispersed Teams: A Structural Contingency Perspective",
          "year": 2015,
          "full_citation": "Sutanto, J., Kankanhalli, A., and Tan, B.C.Y. 2015. “Investigating Task Coordination in Globally Dispersed Teams: A Structural Contingency Perspective”, ACM Transactions on Management Information Systems, 6(2)"
        },
        {
          "title": "Comparing Potential and Actual Innovators: An Empirical Study of Mobile Data Services Innovation",
          "year": 2015,
          "full_citation": "Kankanhalli, A., Ye, H., and Teo, H.H. 2015. \"Comparing Potential and Actual Innovators: An Empirical Study of Mobile Data Services Innovation\", MIS Quarterly, 39(3), 667-682."
        },
        {
          "title": "Drivers of Quantity and Quality of Participation in Online Policy Deliberation Forums",
          "year": 2014,
          "full_citation": "Phang, C.W., Kankanhalli, A., and Huang, L. 2014-15. \"Drivers of Quantity and Quality of Participation in Online Policy Deliberation Forums\", Journal of Management Information Systems, 31(3), 172-212."
        },
        {
          "title": "Mitigating the Impact of Member Turnover in IS Development Projects",
          "year": 2014,
          "full_citation": "Pee, L.G., Kankanhalli, A., Tan, G.W., and Tham G.Z.C. (2014) \"Mitigating the Impact of Member Turnover in IS Development Projects\", IEEE Transactions on Engineering Management, 61(4), 702-716."
        },
        {
          "title": "What Motivates People to Purchase Digital Items on Virtual Community Websites? The Desire for Online Self-presentation",
          "year": 2012,
          "full_citation": "Kim, H.W., Chan, H.C., and Kankanhalli, A. 2012. \"What Motivates People to Purchase Digital Items on Virtual Community Websites? The Desire for Online Self-presentation\", Information Systems Research, 23(4), 1232-1245."
        },
        {
          "title": "Kankanhalli, A., L.G. Pee, G.W. Tan, and S. Chhatwal (2012), ”Interaction of Individual and Social Antecedents of Learning Effectiveness: A Study in t",
          "year": 2012,
          "full_citation": "Kankanhalli, A., L.G. Pee, G.W. Tan, and S. Chhatwal (2012), ”Interaction of Individual and Social Antecedents of Learning Effectiveness: A Study in the IT Research Context”, IEEE Transactions on Engineering Management, 59(1), 115-128."
        },
        {
          "title": "Eliciting a Sense of Virtual Community among Knowledge Contributors",
          "year": 2011,
          "full_citation": "Sutanto, J., A. Kankanhalli, and B.C.Y. Tan (2011), \"Eliciting a Sense of Virtual Community among Knowledge Contributors\", ACM Transactions on Management Information Systems, 2(3), 14."
        },
        {
          "title": "Task and Social Information Seeking: Whom Do We Prefer and Whom Do We Approach?",
          "year": 2011,
          "full_citation": "Xu, Y., H.W. Kim, and A. Kankanhalli 2011, \"Task and Social Information Seeking: Whom Do We Prefer and Whom Do We Approach?\" Journal of Management Information Systems, 27(3), 211-240."
        },
        {
          "title": "Pee, L.G., A. Kankanhalli, and H.W. Kim (2010), “Knowledge Sharing in IS Development Projects: A Social Interdependence Perspective”, Journal of AIS, ",
          "year": 2010,
          "full_citation": "Pee, L.G., A. Kankanhalli, and H.W. Kim (2010), “Knowledge Sharing in IS Development Projects: A Social Interdependence Perspective”, Journal of AIS, 11(10), 550-575."
        },
        {
          "title": "Kim, H.W., and A. Kankanhalli (2009), “Investigating User Resistance to Information Systems Implementation: A Status Quo Perspective”, MIS Quarterly, ",
          "year": 2009,
          "full_citation": "Kim, H.W., and A. Kankanhalli (2009), “Investigating User Resistance to Information Systems Implementation: A Status Quo Perspective”, MIS Quarterly, 33(3), 567-582."
        },
        {
          "title": "Usability and Sociability in Electronic Communities: A Comparative Study of Knowledge Seekers and Contributors",
          "year": 2009,
          "full_citation": "Phang, C.W., A. Kankanhalli, and R. Sabherwal (2009), \"Usability and Sociability in Electronic Communities: A Comparative Study of Knowledge Seekers and Contributors\", Journal of AIS, 10(10), 721-747."
        },
        {
          "title": "Sutanto, J., A. Kankanhalli, J.Y. Tay, K.S. Raman, and B.C.Y. Tan 2008-2009, “Change Management in Inter-Organizational Systems for the Public”, Journ",
          "year": 2008,
          "full_citation": "Sutanto, J., A. Kankanhalli, J.Y. Tay, K.S. Raman, and B.C.Y. Tan 2008-2009, “Change Management in Inter-Organizational Systems for the Public”, Journal of Management Information Systems, 25(3), 137-178."
        },
        {
          "title": "Conflict and Performance in Global Virtual Teams",
          "year": 2007,
          "full_citation": "Kankanhalli, A., B.C.Y. Tan, and K.K. Wei 2007. \"Conflict and Performance in Global Virtual Teams\", Journal of Management Information Systems, 23(3), 237-274."
        },
        {
          "title": "Phang, C.W., J. Sutanto, A. Kankanhalli, L. Yan, B.C.Y. Tan, and H.H. Teo (2006), “Senior Citizens’ Acceptance of Information Systems: A Study in the ",
          "year": 2006,
          "full_citation": "Phang, C.W., J. Sutanto, A. Kankanhalli, L. Yan, B.C.Y. Tan, and H.H. Teo (2006), “Senior Citizens’ Acceptance of Information Systems: A Study in the Context of E-Government Services”, IEEE Transactions on Engineering Management, 53(4), 555-569."
        },
        {
          "title": "Contributing Knowledge to Electronic Knowledge Repositories: An Empirical Investigation",
          "year": 2005,
          "full_citation": "Kankanhalli, A., B.C.Y. Tan, and K.K. Wei 2005. \"Contributing Knowledge to Electronic Knowledge Repositories: An Empirical Investigation\", MIS Quarterly, 29(1), 113-143."
        }
      ],
      "publications_count": 31,
      "awards": [
        "Ranked in Stanford / Elsevier's \"World's Top 2%\" scientists list every year from 2020 (ranked #116 in Information Systems field in 2024)",
        "Asia Women Tech Leaders Award (AWTLA) 2024",
        "Sandra Slaughter Award, 2023",
        "AIS Fellow",
        "MISQ SE with Exemplary Workload and Cycle time, 2022",
        "Singapore 100 Women in Tech, 2021",
        "ICIS 2020 Kauffmann Best Student Paper Award",
        "AIS Distinguished Speaker",
        "AIS Distinguished Member – Cum Laude, 2019",
        "Senior Editor MIS Quarterly, Kudos 2019",
        "Most Frequent Appearing Authors in the Three Elite IS Journals",
        "Best Reviewer Award ICEGOV 2014",
        "Best Paper Award, International Journal of e-Collaboration 2012",
        "IBM Faculty Award 2010",
        "IBM Smarter Planet Industry Skills Innovation Award 2010",
        "Best Paper Award, PACIS 2010",
        "Fast Breaking Paper in the field of Economics and Business 2007, Thomson ESI",
        "Runner-up for the MISQ Reviewer of the Year Award 2005",
        "ACM-SIGMIS 2003 Best Doctoral Dissertation Award",
        "Infocomm Development Authority Gold Medal 2003",
        "President's Graduate Fellowship 2002-2003, NUS",
        "Dean's Graduate Award 2002, NUS",
        "ICIS 2000 Doctoral Consortium Participant"
      ],
      "awards_count": 23,
      "courses": []
    },
    {
      "name": "Varun KARAMSHETTY",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/varunk",
      "appointment": "Assistant Professor",
      "additional_titles": [],
      "office": "COM3-02-39",
      "phone": "651 64091",
      "email": "varunk@comp.nus.edu.sg",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/varunk.jpg",
      "profile": "Varun Karamshetty is an Assistant Professor in the Department of Information Systems and Analytics at National University of Singapore (NUS), School of Computing. He received his Ph.D in Technology and Operations Management from INSEAD and Master's degree in Applied Mathematics from Indian Institute of Science Education and Research, Pune. \nVarun's research tackles problems at the intersection of Information Systems (IS) and Operations Management (OM), with a special emphasis on topics related to sustainability and social impact. He works closely with firms across various sectors—such as food and beverage, public utilities, pharmaceuticals, and e-commerce—in the Asia-Pacific, Europe, and the United Kingdom.\nIn his work, he employs econometrics and machine learning techniques on proprietary data to tease out causal relationships and derive managerial insights.",
      "education": [
        "Ph.D. in Technology and Operations Management, INSEAD"
      ],
      "research_areas": [
        "Data Science & Business Analytics",
        "Digital Transformation, Platforms & Innovation"
      ],
      "research_interests": [
        "Digital Platforms and Sharing Economy",
        "Sustainability and Social Impact",
        "Management of Algorithms",
        "Applied Econometrics",
        "RCTs and Field Experiments"
      ],
      "research_projects": [
        {
          "title": "Impact of E-marketplaces on the Operational Performance of Traditional Businesses and Industries",
          "description": "This project investigates how e-marketplaces affect established businesses, particularly in industries like restaurants, focusing on processes and efficiency. It examines how digital platforms impact food-waste, marketing, and information sharing.",
          "tags": [
            "Digital Transformation, Platforms & Innovation"
          ]
        }
      ],
      "phd_alumni": [],
      "publications": [
        {
          "title": "Trust under Pressure: Managing Road Safety in AI-assisted Gig Work",
          "year": 2025,
          "full_citation": "Karamshetty, Varun; Kyung, Nakyung; Lee, Chulsung; and Sim, Jiwon, \"Trust under Pressure: Managing Road Safety in AI-assisted Gig Work\" (2025). ICIS 2025 Proceedings. 20."
        },
        {
          "title": "Have You Walked in My Shoes? Mitigating the Cold Start Problem in Peer-to-Peer Platforms with Bilateral Reviews",
          "year": 2025,
          "full_citation": "Maeng, Junghyun; Karamshetty, Varun; and Kwon, Hyeokkoo Eric, \"Have You Walked in My Shoes? Mitigating the Cold Start Problem in Peer-to-Peer Platforms with Bilateral Reviews\" (2025). ICIS 2025 Proceedings. 30."
        },
        {
          "title": "Wang, Z., Yang, L., Karamshetty, V., & Hahn, J. (2024). Crowdlending Behaviors in the Aftermath of a Crisis: Evidence From a Natural Experiment. Produ",
          "year": 2024,
          "full_citation": "Wang, Z., Yang, L., Karamshetty, V., & Hahn, J. (2024). Crowdlending Behaviors in the Aftermath of a Crisis: Evidence From a Natural Experiment. Production and Operations Management, 33(1), 243-263."
        },
        {
          "title": "Algorithm-Human-Algorithm: A New Classification Approach to Integrating Judgemental Adjustments",
          "year": 2023,
          "full_citation": "Chen, Christopher; Jain, Nitish; and Karamshetty, Varun, \"Algorithm-Human-Algorithm: A New Classification Approach to Integrating Judgemental Adjustments\" (2023). ICIS 2023 Proceedings. 24."
        },
        {
          "title": "Karamshetty, V., De Vries, H., Van Wassenhove, L. N., ... & Yadav, P. (2022). Inventory management practices in private healthcare facilities in Nairo",
          "year": 2022,
          "full_citation": "Karamshetty, V., De Vries, H., Van Wassenhove, L. N., ... & Yadav, P. (2022). Inventory management practices in private healthcare facilities in Nairobi county. Production and Operations Management, 31(2), 828-846."
        },
        {
          "title": "An Unintended Consequence of Platform Dependence: Empirical Evidence from IT-enabled Food-Delivery Platforms",
          "year": 2022,
          "full_citation": "Karamshetty, Varun; Freeman, Michael; and Hasija, Sameer, \"An Unintended Consequence of Platform Dependence: Empirical Evidence from IT-enabled Food-Delivery Platforms\" (2022). ICIS 2022 Proceedings. 2."
        }
      ],
      "publications_count": 6,
      "awards": [
        "Outstanding Computing Project Prize (2025)",
        "Faculty Teaching Excellence Award (2023)",
        "Faculty Teaching Excellence Award (2022)"
      ],
      "awards_count": 3,
      "courses": []
    },
    {
      "name": "Nakyung KYUNG",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/nakyung",
      "appointment": "Assistant Professor",
      "additional_titles": [],
      "office": "COM3-02-41",
      "phone": "651 66270",
      "email": "nakyung@comp.nus.edu.sg",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/nakyung.jpg",
      "profile": "Nakyung obtained her PhD in Management Engineering from the Korea Advanced Institute of Science and Technology (KAIST). Her research is grounded on the intermediate integration of Information systems (IS), economics, and healthcare. Her research streams include health behaviour change, healthcare analytics, and mobile business analytics. She is also interested in the societal effects of IT. Specifically, ethical issues related to IT and the side effects of IT are key research interests. Within these domains, she has employed quantitative methodologies, including big data analytics using actual behavioural data, econometrics, and field experiments.",
      "education": [],
      "research_areas": [
        "Healthcare Informatics",
        "Digital Transformation, Platforms & Innovation",
        "Media"
      ],
      "research_interests": [
        "AI/ML-based Nudge Design",
        "Mobile Health",
        "Economics of IT",
        "Social Impact of IT"
      ],
      "research_projects": [
        {
          "title": "Mandated vs Autonomous AI Use: An Empirical Examination on Worker's Labor Outcomes and Social Welfare",
          "description": "Amid AI reshaping employee interactions, our project examines mandated vs. autonomous AI impacts on worker empowerment, labor outcomes, and firm/societal welfare. Focused on food delivery platforms, using randomized field experiment data, we aim to compare worker performance, assess efficacy for diverse groups, measure effects on platforms and society, and propose ethical AI design principles.",
          "tags": [
            "Intelligent Systems,Digital Transformation, Platforms & Innovation"
          ]
        },
        {
          "title": "The Effect of Health IT on Behavior Change and Its Business Value",
          "description": "Mobile apps for physical activity fade post-removal, proving ineffective for at-risk groups. This project targets global sedentary lifestyles with personalized strategies, using mobile tech and self-tracking for enduring health interventions. It aims to grasp the impact of targeted mobile interventions, particularly for extended behavior change in at-risk populations.",
          "tags": [
            "Digital Transformation, Platforms & Innovation"
          ]
        }
      ],
      "phd_alumni": [],
      "publications": [
        {
          "title": "Kyung, N., & Kwon, H. E. (2022). Rationally trust, but emotionally? The roles of cognitive and affective trust in laypeople's acceptance of AI for pre",
          "year": 2022,
          "full_citation": "Kyung, N., & Kwon, H. E. (2022). Rationally trust, but emotionally? The roles of cognitive and affective trust in laypeople's acceptance of AI for preventive care operations. Production and Operations Management."
        },
        {
          "title": "Kyung, N., Chan, J., Lim, S., & Lee, B. (2023). Contextual Targeting in mHealth Apps: Harnessing Weather Information and Message Framing to Increase P",
          "year": 2023,
          "full_citation": "Kyung, N., Chan, J., Lim, S., & Lee, B. (2023). Contextual Targeting in mHealth Apps: Harnessing Weather Information and Message Framing to Increase Physical Activity. Information Systems Research."
        }
      ],
      "publications_count": 2,
      "awards": [
        "Best Student Paper, Conference on Health IT and Analytics (CHITA), Washington, USA, 2019",
        "Doctoral Consortium, International Conference on Information Systems (ICIS), Virtual, 2020",
        "Best Paper in Healthcare Track, International Conference on Information Systems (ICIS), Virtual, 2021",
        "Health IT in Action, Conference on Health IT and Analytics (CHITA), Washington, USA, 2023"
      ],
      "awards_count": 4,
      "courses": []
    },
    {
      "name": "Stanley KOK",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/skok",
      "appointment": "Assistant Professor",
      "additional_titles": [
        "Associate Director, NUS AI Lab"
      ],
      "office": "COM2-04-20",
      "phone": "651 62901",
      "email": "skok@comp.nus.edu.sg",
      "personal_page": "https://www.comp.nus.edu.sg/~skok",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/skok.jpg",
      "profile": "",
      "education": [
        "Ph.D. (Computer Science, University of Washington, 2010)"
      ],
      "research_areas": [
        "Digital Transformation, Platforms & Innovation",
        "Computational Social Science",
        "Intelligent Systems"
      ],
      "research_interests": [
        "Artificial Intelligence / Machine Learning",
        "E-Commerce / FinTech",
        "Healthcare",
        "Data Science",
        "Social Networks"
      ],
      "research_projects": [],
      "phd_alumni": [],
      "publications": [
        {
          "title": "See http://www.comp.nus.edu.sg/~skok/pub.html",
          "year": null,
          "full_citation": "See http://www.comp.nus.edu.sg/~skok/pub.html"
        }
      ],
      "publications_count": 1,
      "awards": [
        "See http://www.comp.nus.edu.sg/~skok/cv.pdf"
      ],
      "awards_count": 1,
      "courses": []
    },
    {
      "name": "LEE Boon Kee",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/leebk",
      "appointment": "Senior Lecturer (Educator Track)",
      "additional_titles": [],
      "office": "COM2-04-19",
      "phone": "651 62733",
      "email": "leebk@comp.nus.edu.sg",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/leebk.jpg",
      "profile": "LEE Boon Kee is a senior lecturer in the Department of Information Systems and Analytics, School of Computing at the National University of Singapore. He obtained his B.Sc. in Information Systems and Computer Science from NUS in 1989. Prior to his teaching career at NUS, Boon Kee has over thirty years of IT consulting experience in expert systems and software development, system integration, and product management while working in ISS, Accenture, Sun Microsystems, HP, EDS, DEC, and NEC. He has been engaged by several companies on their digital transformation journeys to help them move from a project-driven to a product-centric business model in delivering digital products and services. His research interest is digital product management, digital ecosystems and platforms, digital experience platforms, and digital economy.",
      "education": [
        "B.Sc. (Information Systems & Computer Science, NUS, 1989)"
      ],
      "research_areas": [
        "Digital Transformation, Platforms & Innovation"
      ],
      "research_interests": [
        "Digital Product Management",
        "Digital Ecosystems and Platforms",
        "Digital Experience Platforms",
        "Digital Economy"
      ],
      "research_projects": [],
      "phd_alumni": [],
      "publications": [],
      "publications_count": 0,
      "awards": [],
      "awards_count": 0,
      "courses": []
    },
    {
      "name": "LEE Jiho",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/leejiho",
      "appointment": "Assistant Professor",
      "additional_titles": [],
      "office": "COM2-04-14",
      "phone": "651 62830",
      "email": "leejiho@comp.nus.edu.sg",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/leejiho.jpg",
      "profile": "",
      "education": [
        "Ph.D. (Information Systems, Boston University)",
        "M.Sc. (Accounting, Korea University)",
        "B.B.A. (Business Administration, Korea University)"
      ],
      "research_areas": [],
      "research_interests": [],
      "research_projects": [],
      "phd_alumni": [],
      "publications": [],
      "publications_count": 0,
      "awards": [],
      "awards_count": 0,
      "courses": []
    },
    {
      "name": "LEK Hsiang Hui",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/lekhsian",
      "appointment": "Senior Lecturer (Educator Track)",
      "additional_titles": [
        "Assistant Dean, Industry Relations",
        "Fellow, NUS Teaching Academy"
      ],
      "office": "COM2-02-04",
      "phone": "660 11049",
      "email": "lekhsian@comp.nus.edu.sg",
      "personal_page": "https://www.comp.nus.edu.sg/~lekhsian",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/lekhsian.jpg",
      "profile": "Lek Hsiang Hui is a Senior Lecturer at the Department of Information Systems and Analytics at the National University of Singapore (NUS) School of Computing. He graduated with a Bachelor of Computing (Honours) in Computer Engineering and a PhD in Information Systems from NUS. He currently teaches undergraduate courses in Enterprise Systems Design and Development, and also conducts executive training in Healthcare Analytics at the Centre for Health Informatics (CHI).\n\nHe has received the University-level Annual Teaching Excellence Award for AY2015/16, AY2016/17, AY2017/18, and AY2023/24, and was placed on the ATEA Honour Roll for AY2018/19. In addition, he has also received the Faculty Teaching Excellence Award (FTEA) for AY 2014/15, AY 2015/16, AY 2016/17, and AY 2023/24, and was placed on the FTEA Honour Roll for AY 2017/18.\n\nHe currently serves as a Fellow in the NUS Teaching Academy. He previously served on the School’s Curriculum Committee, the Faculty Teaching Excellence Committee (FTEC), and the Department’s Teaching Committee. He is also one of the faculty advisors for NUS StartIT. This student-initiated society serves as a key platform for students passionate about IT and technopreneurship to come together and expand their expertise.",
      "education": [
        "Ph.D. (Information Systems, National University of Singapore)",
        "B.Sc. (Computer Engineering, 1st Class Honours, National University of Singapore)"
      ],
      "research_areas": [
        "Intelligent Systems"
      ],
      "research_interests": [
        "Sentiment Analysis",
        "Natural Language Processing",
        "Education Technology"
      ],
      "research_projects": [],
      "phd_alumni": [],
      "publications": [
        {
          "title": "Suresh, D., Lek, H. H., & Koh, E. 2018. Identifying teamwork indicators in an online collaborative problem-solving task: A text-mining approach. In Pr",
          "year": 2018,
          "full_citation": "Suresh, D., Lek, H. H., & Koh, E. 2018. Identifying teamwork indicators in an online collaborative problem-solving task: A text-mining approach. In Proceedings of the 26th International Conference on Computers in Education, ICCE 2018, November 26-30, 2018 pp. 39-48."
        },
        {
          "title": "Lek, H. H., & Poo, D. C. C. 2014. Automatic Generation of an Aspect and Domain Sensitive Sentiment Lexicon.International Journal on Artificial Intelli",
          "year": 2014,
          "full_citation": "Lek, H. H., & Poo, D. C. C. 2014. Automatic Generation of an Aspect and Domain Sensitive Sentiment Lexicon.International Journal on Artificial Intelligence Tools,234.http://doi.org/10.1142/S0218213014600197"
        },
        {
          "title": "Lek, H. H., & Poo, D. C. C. 2013. Aspect-Based Twitter Sentiment Classification. InProceedings of the IEEE 25th International Conference on Tools with",
          "year": 2013,
          "full_citation": "Lek, H. H., & Poo, D. C. C. 2013. Aspect-Based Twitter Sentiment Classification. InProceedings of the IEEE 25th International Conference on Tools with Artificial Intelligence, ICTAI 2013,November 4-6, 2013 pp. 366–373.http://doi.org/10.1109/ICTAI.2013.62"
        },
        {
          "title": "Lek, H. H., & Poo, D. C. C. 2012. Aspect-based Product Review Summarizer. InProceedings of the International Conference on Knowledge Engineering and O",
          "year": 2012,
          "full_citation": "Lek, H. H., & Poo, D. C. C. 2012. Aspect-based Product Review Summarizer. InProceedings of the International Conference on Knowledge Engineering and Ontology Development, KEOD 2012,October 4-7, 2012. pp. 290–295."
        },
        {
          "title": "Lek, H. H., & Poo, D. C. C. 2012. Sentix: An Aspect and Domain Sensitive Sentiment Lexicon. InProceedings of the IEEE 24th International Conference on",
          "year": 2012,
          "full_citation": "Lek, H. H., & Poo, D. C. C. 2012. Sentix: An Aspect and Domain Sensitive Sentiment Lexicon. InProceedings of the IEEE 24th International Conference on Tools with Artificial Intelligence, ICTAI 2012,November 7-9, 2012 pp. 261–268.http://doi.org/10.1109/ICTAI.2012.43"
        },
        {
          "title": "Lek, H. H., & Poo, D. C. C. 2011. An Experimental Study to Investigate the Use of Additional Classifiers to Improve Information Extraction Accuracy. I",
          "year": 2011,
          "full_citation": "Lek, H. H., & Poo, D. C. C. 2011. An Experimental Study to Investigate the Use of Additional Classifiers to Improve Information Extraction Accuracy. InProceedings of the 10th International Conference on Machine Learning and Applications, ICMLA 2011,December 18-21, 2011 pp. 412–415.http://doi.org/10.1109/ICMLA.2011.31"
        },
        {
          "title": "Lek, H. H., & Poo, D. C. C. 2011. Knowledge Community - Moving Beyond Conventional Learning Management Systems. InProceedings of the 3rd International",
          "year": 2011,
          "full_citation": "Lek, H. H., & Poo, D. C. C. 2011. Knowledge Community - Moving Beyond Conventional Learning Management Systems. InProceedings of the 3rd International Conference on Computer Supported Education, CSEDU 2011,May 6-8, 2011 pp. 173–178."
        },
        {
          "title": "Poo, D. C. C., Lek, H. H., & Agarwal, N. K. 2010. Collaborative Learning in a Knowledge Community. InProceedings of the 2010 International Conference ",
          "year": 2010,
          "full_citation": "Poo, D. C. C., Lek, H. H., & Agarwal, N. K. 2010. Collaborative Learning in a Knowledge Community. InProceedings of the 2010 International Conference on Computer Science Education: Innovation & Technology, CSEIT 2010.http://doi.org/10.5176/978-981-08-7466-7_itcse-37"
        },
        {
          "title": "Lek, H. H., Poo, D. C. C., & Agarwal, N. K. 2009. Knowledge Community K- Comm: Towards a digital ecosystem with collective intelligence. InProceedings",
          "year": 2009,
          "full_citation": "Lek, H. H., Poo, D. C. C., & Agarwal, N. K. 2009. Knowledge Community K- Comm: Towards a digital ecosystem with collective intelligence. InProceedings of the 3rd IEEE International Conference on Digital Ecosystems and Technologiespp. 211–216. http://doi.org/10.1109/DEST.2009.5276690"
        }
      ],
      "publications_count": 9,
      "awards": [
        "National Day Awards Commendation Medal 2022, Singapore",
        "Annual Teaching Excellence Honor Roll, AY2018/19, National University of Singapore",
        "Annual Teaching Excellence Award (ATEA), AY 2017/18, National University of Singapore",
        "Faculty Teaching Excellence Honor Roll, AY2017/18, School of Computing, National University of Singapore",
        "Annual Teaching Excellence Award (ATEA), AY 2016/17, National University of Singapore",
        "Faculty Teaching Excellence Award (FTEA), AY2015/16, School of Computing, National University of Singapore",
        "Annual Teaching Excellence Award (ATEA), AY 2015/16, National University of Singapore",
        "Faculty Teaching Excellence Award (FTEA), AY2015/16, School of Computing, National University of Singapore",
        "Faculty Teaching Excellence Award (FTEA), AY2014/15, School of Computing, National University of Singapore",
        "Faculty Teaching Excellence Award (FTEA), AY2023/24, School of Computing, National University of Singapore",
        "Annual Teaching Excellence Award (ATEA), AY 2023/24, National University of Singapore"
      ],
      "awards_count": 11,
      "courses": []
    },
    {
      "name": "LI Gujie",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/ligj",
      "appointment": "Assistant Professor",
      "additional_titles": [],
      "office": "COM2-04-07",
      "phone": "660 13852",
      "email": "ligj@comp.nus.edu.sg",
      "personal_page": "https://ligujie123.github.io",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/sample1.png",
      "profile": "Li Gujie is an Assistant Professor in the Department of Information Systems and Analytics at the National University of Singapore (NUS). He received his PhD in Information Systems from Robert H. Smith School of Business, University of Maryland. \nHis research interests center around understanding how technological innovations, including artificial intelligence, multimodal communication, and platform policy, shape the dynamics of human behaviour. He mainly employs causal inference, natural language processing, and multimedia data analysis in his research.",
      "education": [
        "Ph.D. (Information Systems, University of Maryland)",
        "M.Sc. (Systems Engineering & Engineering Management, The Chinese University of Hong Kong)"
      ],
      "research_areas": [
        "Digital Transformation, Platforms & Innovation",
        "Computational Social Science"
      ],
      "research_interests": [
        "Economics of Information Systems",
        "Digital Platforms",
        "Business Analytics"
      ],
      "research_projects": [],
      "phd_alumni": [],
      "publications": [],
      "publications_count": 0,
      "awards": [
        "Best Paper Award Nominee, Workshop on Information Systems and Economics 2023",
        "Best Student Paper Award Runner-up, Conference on Information Systems and Technology Atlanta 2025"
      ],
      "awards_count": 2,
      "courses": []
    },
    {
      "name": "LI Xiaofan",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/lixf",
      "appointment": "Assistant Professor",
      "additional_titles": [],
      "office": "COM2-04-10",
      "phone": "660 17608",
      "email": "lixf@comp.nus.edu.sg",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/lixf.jpg",
      "profile": "Li Xiaofan is an Assistant Professor in the Department of Information Systems and Analytics at the School of Computing at the National University of Singapore (NUS). Prior to joining NUS, he earned his PhD in Information Systems from The University of Texas at Austin. His research interests line in the areas of cybersecurity and cryptocurrency. He focuses on the strategic interactions of relevant entities in these contexts.",
      "education": [
        "Ph.D. (Information Systems, The University of Texas at Austin)"
      ],
      "research_areas": [
        "FinTech",
        "Digital Transformation, Platforms & Innovation"
      ],
      "research_interests": [
        "Cybersecurity",
        "Cryptocurrency"
      ],
      "research_projects": [
        {
          "title": "Understanding Web 2.0 and Web 3.0 Online Platforms",
          "description": "This project investigates the consequences of introducing cryptocurrencies, categorizing into private (e.g., Ripple's XRP) and public blockchains (e.g., Bitcoin). It examines ICO impacts on marketing and finance while exploring the connection between cryptocurrencies and cybercrime.",
          "tags": [
            "FinTech"
          ]
        }
      ],
      "phd_alumni": [],
      "publications": [
        {
          "title": "Li, X., & Whinston, A. B. 2020. A Model of Fake Data in Data-driven Analysis.Journal of Machine Learning Research,213, 1-26.",
          "year": 2020,
          "full_citation": "Li, X., & Whinston, A. B. 2020. A Model of Fake Data in Data-driven Analysis.Journal of Machine Learning Research,213, 1-26."
        },
        {
          "title": "Li, X., & Whinston, A. B. 2020. Analyzing Cryptocurrencies.Information Systems Frontiers,221, 17-22.",
          "year": 2020,
          "full_citation": "Li, X., & Whinston, A. B. 2020. Analyzing Cryptocurrencies.Information Systems Frontiers,221, 17-22."
        }
      ],
      "publications_count": 2,
      "awards": [],
      "awards_count": 0,
      "courses": []
    },
    {
      "name": "LIM Jie, Freddy",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/flim",
      "appointment": "Assistant Professor",
      "additional_titles": [],
      "office": "COM2-04-37",
      "phone": "651 66518",
      "email": "flim@comp.nus.edu.sg",
      "personal_page": "https://freddylim.me",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/flim.jpg",
      "profile": "Freddy Lim is an Assistant Professor of Information Systems and Analytics at National University of Singapore, School of Computing. He received his PhD in Decision Sciences from INSEAD. Prior to joining academia, he worked across banking and aerospace industries in various quantitative positions.\n\nFreddy is interested in data driven and practice-oriented research. He studies consumer judgment and decision making at the intersection of information systems, operations management and marketing. Methodologically, he employs econometrics, Bayesian modeling, and machine learning techniques.",
      "education": [],
      "research_areas": [
        "Data Science & Business Analytics",
        "Digital Transformation, Platforms & Innovation"
      ],
      "research_interests": [
        "Digital platforms",
        "Loyalty programs",
        "Judgment & decision making"
      ],
      "research_projects": [],
      "phd_alumni": [],
      "publications": [
        {
          "title": "Lim F, Chun SY, Satopää V (2024) Loyalty Currency and Mental Accounting: Do Consumers Treat Points Like Money? Manufacturing & Service Operations Mana",
          "year": 2024,
          "full_citation": "Lim F, Chun SY, Satopää V (2024) Loyalty Currency and Mental Accounting: Do Consumers Treat Points Like Money? Manufacturing & Service Operations Management."
        },
        {
          "title": "Chun SY, Lim F, Satopää V (2024) Consumers Spend Loyalty Points and Cash Differently. Harvard Business Review, Digital Article.",
          "year": 2024,
          "full_citation": "Chun SY, Lim F, Satopää V (2024) Consumers Spend Loyalty Points and Cash Differently. Harvard Business Review, Digital Article."
        }
      ],
      "publications_count": 2,
      "awards": [],
      "awards_count": 0,
      "courses": []
    },
    {
      "name": "LIM Shi Ying",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/sylim",
      "appointment": "Assistant Professor",
      "additional_titles": [],
      "office": "COM2-04-28",
      "phone": "651 64654",
      "email": "sylim@comp.nus.edu.sg",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/sylim.jpg",
      "profile": "Dr. Lim Shi Ying is an Assistant Professor in the Department of Information Systems and Analytics at the National University of Singapore. She received her Ph.D. in Information Systems from the McCombs School of Business at The University of Texas at Austin. She has a B.A. in Molecular Cell Biology (Immunology and Economics) from the University of California, Berkeley, and an M.P.H. in Health Management from Yale University. \n\nBefore joining academia, Dr. Lim has worked extensively with start-ups, hospitals, and pharmaceutical companies in the United States, Singapore and Japan, and the World Health Organization. She continues to engage in industry collaborations in projects related to healthcare, digital transformation, and entrepreneurship.  \n\nDr. Lim’s research focuses on digital entrepreneurship (particularly nascent digital start-ups, digital platforms) and healthcare IT. She examines the use of design and technology in creative problem solving amidst constraints and uncertainty. Her research has been nominated best papers at leading academic conferences such as the International Conference on Information Systems (ICIS) and the Hawaii International Conference on System Sciences (HICSS). Her work has also been published in top-ranked international journals, such as the Journal of Management Information Systems and Management Science. \n\nDr. Lim has won multiple teaching awards and has taught undergraduate and post-graduate students in the NUS School of Computing, the University of Texas at Austin, and Yale University.",
      "education": [
        "Ph.D. (Information Systems, The University of Texas at Austin)",
        "B.A. (Molecular & Cell Biology: Immunology, 2nd Major: Economics, University of California, Berkeley)"
      ],
      "research_areas": [
        "Healthcare Informatics",
        "Digital Transformation, Platforms & Innovation",
        "Computational Social Science"
      ],
      "research_interests": [
        "Entrepreneurial Strategy and Product Design",
        "Digital Ecosystems and Platforms",
        "Health Information Technology Design",
        "Digital Transformation",
        "Creative Problem Solving and Innovation"
      ],
      "research_projects": [
        {
          "title": "Exploring the Evolution of Entrepreneurs' Ideas in Nascent Ventures",
          "description": "Nascent ventures often change their initial ideas due to uncertain market conditions and limited resources. This project aims to understand how digital artifacts influence entrepreneurs' strategic reorientations and their effects on venture performance.",
          "tags": [
            "Digital Transformation, Platforms & Innovation"
          ]
        }
      ],
      "phd_alumni": [],
      "publications": [
        {
          "title": "Chan, T.H., & Lim, S.Y. The Emergence of Novel Product Uses: An Investigation of Exaptations in Ikea Hacks. Management Science, accepted.",
          "year": null,
          "full_citation": "Chan, T.H., & Lim, S.Y. The Emergence of Novel Product Uses: An Investigation of Exaptations in Ikea Hacks. Management Science, accepted."
        },
        {
          "title": "Lim, S. Y., & Tan, C.H. (2020). Resourcing for Large-Scale Mobilization: A Lesson from Singapore's Response to the COVID-19 Pandemic. Proceedings of t",
          "year": 2020,
          "full_citation": "Lim, S. Y., & Tan, C.H. (2020). Resourcing for Large-Scale Mobilization: A Lesson from Singapore's Response to the COVID-19 Pandemic. Proceedings of the 41st International Conference on Information Systems, 2020"
        },
        {
          "title": "Tan Erciyes, B., Lim, S. Y., Um, S., & Anderson, E. (2020). Do Frequent Platform Versions Benefit Platform Developers and Owners? Proceedings of the 4",
          "year": 2020,
          "full_citation": "Tan Erciyes, B., Lim, S. Y., Um, S., & Anderson, E. (2020). Do Frequent Platform Versions Benefit Platform Developers and Owners? Proceedings of the 41st International Conference on Information Systems, 2020"
        },
        {
          "title": "Han, S., & Lim, S. Y. (2020). Early-stage resource acquisition processes in a digital healthcare venture. Proceedings of the 41st International Confer",
          "year": 2020,
          "full_citation": "Han, S., & Lim, S. Y. (2020). Early-stage resource acquisition processes in a digital healthcare venture. Proceedings of the 41st International Conference on Information Systems, 2020"
        },
        {
          "title": "Chan, T. H., & Lim, S. Y. (2020). Understanding Generativity in Use: Triggers, and Search Paths in IKEA User Hacks. Proceedings of the 41st Internatio",
          "year": 2020,
          "full_citation": "Chan, T. H., & Lim, S. Y. (2020). Understanding Generativity in Use: Triggers, and Search Paths in IKEA User Hacks. Proceedings of the 41st International Conference on Information Systems, 2020"
        },
        {
          "title": "Taani, I., Faik, I., Lim, S. Y., & Tu, T. M. (2020). The temporal dimension of copresence in medical practice: the case of telestroke. In Academy of M",
          "year": 2020,
          "full_citation": "Taani, I., Faik, I., Lim, S. Y., & Tu, T. M. (2020). The temporal dimension of copresence in medical practice: the case of telestroke. In Academy of Management Proceedings (Vol. 2020, No. 1, p. 20603). Briarcliff Manor, NY 10510: Academy of Management."
        },
        {
          "title": "Tanriverdi, H., Lim, S. Y. 2017. How to Survive and Thrive in Complex, Hypercompetitive, and Disruptive ecosystems? The Roles of IS-enabled Capabiliti",
          "year": 2017,
          "full_citation": "Tanriverdi, H., Lim, S. Y. 2017. How to Survive and Thrive in Complex, Hypercompetitive, and Disruptive ecosystems? The Roles of IS-enabled Capabilities. Proceedings of the 38th International Conference on Information Systems ICIS, Seoul, Korea.-Nominated Best Theory Development Paper"
        },
        {
          "title": "Jarvenpaa, S. L., Cantu, C., & Lim, S. Y. 2017. Trust in virtual online environments.The Wiley Blackwell handbook of the psychology of the internet at",
          "year": 2017,
          "full_citation": "Jarvenpaa, S. L., Cantu, C., & Lim, S. Y. 2017. Trust in virtual online environments.The Wiley Blackwell handbook of the psychology of the internet at work, 103-130."
        },
        {
          "title": "Anderson, E., Lim, S. Y., Joglekar, N. 2017, January. Are More Frequent Releases Always Better? Dynamics of Pivoting, Scaling, and the Minimum Viable ",
          "year": 2017,
          "full_citation": "Anderson, E., Lim, S. Y., Joglekar, N. 2017, January. Are More Frequent Releases Always Better? Dynamics of Pivoting, Scaling, and the Minimum Viable Product. Proceedings of the 50th Hawaii International Conference on System Sciences.- Nominated Best Paper"
        },
        {
          "title": "Lim, S. Y., & Anderson, E. G. 2016, January. Institutional Barriers Against Innovation Diffusion: From the Perspective of Digital Health Startups. In ",
          "year": 2016,
          "full_citation": "Lim, S. Y., & Anderson, E. G. 2016, January. Institutional Barriers Against Innovation Diffusion: From the Perspective of Digital Health Startups. In 49th Hawaii International Conference on System Sciences HICSS, 2016, pp. 3328-3337. IEEE."
        },
        {
          "title": "Lim, S. Y., Jarvenpaa, S. L., & Lanham, H. J. 2015. Barriers to Interorganizational knowledge transfer in post-hospital care transitions: review and d",
          "year": 2015,
          "full_citation": "Lim, S. Y., Jarvenpaa, S. L., & Lanham, H. J. 2015. Barriers to Interorganizational knowledge transfer in post-hospital care transitions: review and directions for information systems research.Journal of Management Information Systems,323, 48-74."
        },
        {
          "title": "Lim, S. Y., Jarvenpaa, S. L., & Lanham, H. J. 2015, January. Review of Research on Knowledge Transfer in Care Transitions: Trust-Enhancing Principles ",
          "year": 2015,
          "full_citation": "Lim, S. Y., Jarvenpaa, S. L., & Lanham, H. J. 2015, January. Review of Research on Knowledge Transfer in Care Transitions: Trust-Enhancing Principles for Information Systems Design. InSystem Sciences HICSS, 2015 48th Hawaii International Conference onpp. 3148-3157. IEEE.-Nominated Best Paper"
        }
      ],
      "publications_count": 12,
      "awards": [],
      "awards_count": 0,
      "courses": []
    },
    {
      "name": "Vivek Sundar MAGESH",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/sundar",
      "appointment": "Lecturer (Educator Track)",
      "additional_titles": [],
      "office": "COM2-02-36",
      "phone": "660 11733",
      "email": "sundar@comp.nus.edu.sg",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/sundar.jpg",
      "profile": "",
      "education": [],
      "research_areas": [
        "Data Science & Business Analytics"
      ],
      "research_interests": [
        "Social Media",
        "Developing Economies",
        "New Product Diffusion"
      ],
      "research_projects": [],
      "phd_alumni": [],
      "publications": [],
      "publications_count": 0,
      "awards": [],
      "awards_count": 0,
      "courses": []
    },
    {
      "name": "Ivan PNG",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/ipng",
      "appointment": "Distinguished Professor",
      "additional_titles": [],
      "office": "BIZ1-06-38",
      "phone": "651 66807",
      "email": "ipng@comp.nus.edu.sg",
      "personal_page": "https://www.comp.nus.edu.sg/~ipng",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/ipng.jpg",
      "profile": "Dr. Png is a Distinguished Professor and Professor of Strategy and Policy, Economics, and Information Systems and Analytics (by courtesy) at the National University of Singapore (NUS). From 2001-03, he was Vice Provost for Graduate and Undergraduate Education, and 2000-01, Dean of the School of Computing.\n\nPreviously, Dr. Png was with the Anderson School, University of California, Los Angeles (Assistant Professor 1985-90, Associate Professor 1990-95, Professor 1995-96). He has also taught at the Hong Kong University of Science & Technology. Dr. Png was a Nominated Member of Parliament of Singapore from 2005-06.",
      "education": [
        "Ph.D. (Business, Stanford University)",
        "B.A. (Economics, Cambridge University)"
      ],
      "research_areas": [],
      "research_interests": [
        "Economics of productivity",
        "Economics of innovation"
      ],
      "research_projects": [],
      "phd_alumni": [],
      "publications": [
        {
          "title": "Yun Hou, I.P.L. Png, and Xi Xiong, “When stronger patent law reduces patenting: Empirical evidence”, September 2022, Strategic Management Journal, for",
          "year": 2022,
          "full_citation": "Yun Hou, I.P.L. Png, and Xi Xiong, “When stronger patent law reduces patenting: Empirical evidence”, September 2022, Strategic Management Journal, forthcoming."
        },
        {
          "title": "Jie Gong and I.P.L. Png, “Automation Enables Specialization: Field Evidence”, August 2022, Management Science, forthcoming.",
          "year": 2022,
          "full_citation": "Jie Gong and I.P.L. Png, “Automation Enables Specialization: Field Evidence”, August 2022, Management Science, forthcoming."
        },
        {
          "title": "Junjian Yi, Junhong Chu, and I.P.L. Png, “Early-life exposure to hardship increased risk tolerance and entrepreneurship in adulthood with gender diffe",
          "year": 2022,
          "full_citation": "Junjian Yi, Junhong Chu, and I.P.L. Png, “Early-life exposure to hardship increased risk tolerance and entrepreneurship in adulthood with gender differences”, Proceedings of the National Academy of Sciences, Vol. 119 No. 15, 5 April 2022, e2104033119."
        },
        {
          "title": "I.P.L. Png, U.S. R&D, 1975-1998: A New Dataset, Strategic Management Journal, Vol. 40 No. 5, May 2019, 715-735.",
          "year": 1975,
          "full_citation": "I.P.L. Png, U.S. R&D, 1975-1998: A New Dataset, Strategic Management Journal, Vol. 40 No. 5, May 2019, 715-735."
        },
        {
          "title": "I.P.L. Png, Secrecy and Patents: Theory and Evidence from the Uniform Trade Secrets Act, Strategy Science, Vol. 2 No. 3, September 2017, 176-193.",
          "year": 2017,
          "full_citation": "I.P.L. Png, Secrecy and Patents: Theory and Evidence from the Uniform Trade Secrets Act, Strategy Science, Vol. 2 No. 3, September 2017, 176-193."
        },
        {
          "title": "I.P.L. Png, Law and Innovation: Evidence from State Trade Secrets Laws, Review of Economics and Statistics, Vol. 99 No. 1, March 2017, 167-179.",
          "year": 2017,
          "full_citation": "I.P.L. Png, Law and Innovation: Evidence from State Trade Secrets Laws, Review of Economics and Statistics, Vol. 99 No. 1, March 2017, 167-179."
        }
      ],
      "publications_count": 6,
      "awards": [],
      "awards_count": 0,
      "courses": []
    },
    {
      "name": "POO Chiang Choon, Danny",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/dpoo",
      "appointment": "Associate Professor",
      "additional_titles": [],
      "office": "COM2-04-36",
      "phone": "651 62783",
      "email": "dpoo@comp.nus.edu.sg",
      "personal_page": "https://www.comp.nus.edu.sg/~dpoo",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/dpoo.jpg",
      "profile": "Dr. Danny Poo graduated with a BSc (Honours), MSc and PhD in Computation from the University of Manchester Institute of Science and Technology (UMIST), United Kingdom. A tenured Associate Professor at School of Computing (SOC), National University of Singapore (NUS), Dr. Poo is a member of the School’s Curriculum Committee tasked in the design and implementation of Information Systems and Computer Science curriculum. As the Curriculum Chair of the Department of Information Systems and Analytics, he is instrumental in the development of undergraduate degree programmes in Information Systems, E-Commerce and Business Analytics at the NUS. He teaches Requirements Analysis and Design, Enterprise JavaBeans, Software Engineering, and Project Management.\n\nDr. Poo was the founding Director of the Centre for Health Informatics, NUS from 2012 to 2015. The Centre is the lead provider of human capital in Health Informatics and its mission is to train healthcare and IT professionals to use Health Informatics to find new ways of delivering healthcare to achieve better patient care and patient satisfaction. The Centre also serves as a hub for Health Informatics research and information exchange. Dr. Poo has been involved in health informatics-related training and has taught courses in “Managing Healthcare Information Technology Projects”, “Introduction to Health Informatics”, \"Healthcare Analytics\", \"Health Informatics Leadership\" and “Healthcare Systems, Technologies and Systems”.\n\nDr. Poo has extensive experience in Software Engineering, Information Management, Knowledge Management, and Health Informatics, both in the technical and managerial levels. He has carried out wide-ranging research in the areas of Effective Search Strategies, Relevance Ranking and Feedbacks, Electronic Referencing, Meta-Data, Taxonomy Generation, Information Sharing, Knowledge Management Portals, Object-Oriented Software Engineering, Software Systems Maintenance, Project Management, Business Analytics and Healthcare-related Studies.\n\nDr. Poo serves in the Steering Committee of the Asia Pacific Software Engineering Conference (APSEC) since 1994 and was the Vice-Chairman of the APSEC Steering Committee from 2003 to 2005. He was even invited by the Japanese Government and Fukuoka City to participate in a forum on “USA, Kyushu and Asia International Exchange Project” in 1997 and 2002.\n\nDr. Poo was invited as a keynote speaker in the 2009 Arabic Scripts Second Symposium in Abu Dhabi. He has also spoken in Knowledge Management Conferences in Singapore on topics such as “Creating a Workable Knowledge Classification System”, “Developing a Useable Taxonomy that Supports the Services offered by the Public Sector”, and \"How Effective Web Search Can Strengthen Customer Relations\".\n\nDr. Poo has authored 5 books in the Information Technology area: “Enterprise JavaBeans for Students”, Cengage Learning, 2014; “Object-Oriented Programming and Java”, Springer-Verlag, 1998 (1st edition) 2007 (2nd edition); \"Learn to Program Enterprise JavaBeans 3.0\", 3rd edition, Cengage Learning, 2009; “Learn to Program Java”, 4th edition, Cengage Learning, 2009; \"Learn to Program Java User Interface\", Cengage",
      "education": [
        "Ph.D. (Computation, University of Manchester Institute of Science and Technology)",
        "M.Sc. (Computation, University of Manchester Institute of Science and Technology)",
        "B.Sc. (Computation, University of Manchester Institute of Science and Technology)"
      ],
      "research_areas": [
        "Data Science & Business Analytics",
        "Healthcare Informatics",
        "Intelligent Systems"
      ],
      "research_interests": [
        "Big Data Analytics",
        "Information Management",
        "Software Engineering",
        "Healthcare Analytics",
        "Knowledge Management"
      ],
      "research_projects": [],
      "phd_alumni": [],
      "publications": [
        {
          "title": "Analysis and Design of Mobile Health Interventions towards Informed Shared Decision Making: An Activity Theory-driven perspective",
          "year": 2016,
          "full_citation": "NGUYEN DUY*, H and C C D Poo, \"Analysis and Design of Mobile Health Interventions towards Informed Shared Decision Making: An Activity Theory-driven perspective\". Journal of Decision Systems, 25 2016: 397–409. United Kingdom."
        },
        {
          "title": "Automated Mobile Health: Designing a Social Reasoning Platform for Remote Health Management",
          "year": 2016,
          "full_citation": "NGUYEN DUY*, H and C C D Poo, \"Automated Mobile Health: Designing a Social Reasoning Platform for Remote Health Management\". Social Computing and Social Media, ed. Gabriele Meiselwitz 2016: 34-46. Switzerland: Springer International Publishing. Plenary paper HCI International 2016, 17 - 22 Jul 2016, The Westin Harbour Castle Hotel, Toronto, Canada."
        },
        {
          "title": "What Methodological Attributes are Essential for Novice Users in Health Analytics? – An Empirical Analysis",
          "year": 2015,
          "full_citation": "AHANGAMA*, S and C C D Poo*, \"What Methodological Attributes are Essential for Novice Users in Health Analytics? – An Empirical Analysis\". 17th International Conference on Human Computer Interaction CHCI 2015 2015. Los Angeles: 17th International Conference on Human Computer Interaction CHCI 2015. Plenary paper 17thInternational Conference on Human Computer Interaction CHCI 2015, 2 - 7 Aug 2015, Los Angeles, United States."
        },
        {
          "title": "Automatic Generation of an Aspect and Domain Sensitive Sentiment Lexicon",
          "year": 1460,
          "full_citation": "LEK*, H H and C C D Poo, \"Automatic Generation of an Aspect and Domain Sensitive Sentiment Lexicon\". International Journal on Artificial Intelligence Tools, 23, no. 4, part.1460019 2014. Singapore."
        },
        {
          "title": "Unified Structured Process for Health Analytics",
          "year": 2014,
          "full_citation": "AHANGAMA*, S and C C D Poo*, \"Unified Structured Process for Health Analytics\". Biomedical Engineering, 8 2014: 744-752. United Kingdom."
        }
      ],
      "publications_count": 5,
      "awards": [],
      "awards_count": 0,
      "courses": []
    },
    {
      "name": "QIAO Dandan",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/qiaodd",
      "appointment": "Associate Professor",
      "additional_titles": [],
      "office": "COM2-04-15",
      "phone": "660 13789",
      "email": "qiaodd@comp.nus.edu.sg",
      "personal_page": "https://www.qiaodandan.com",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/qiaodd.jpg",
      "profile": "QIAO Dandan is an associate professor in the Department of Information Systems and Analytics at the School of Computing, National University of Singapore (NUS). Prior to joining NUS, she earned her PhD in Information Systems from Tsinghua University and visited the University of Texas at Austin as a research scholar for two years. \nHer research focuses on digital platform design and computational social science. Her work has been published in leading academic journals such as Management Science (MS), Information Systems Research (ISR), MIS Quarterly (MISQ), Journal of Management Information Systems (JMIS), and Production and Operations Management (POM). She received the AIS Early Career Award in 2024 and ISS Gordon B. Davis Young Scholar Award in 2023. She has also secured research grants from the Ministry of Education (MOE) in Singapore and the NET Institute. \nSince 2024, Dandan has been serving as a member of the Information Systems Research (ISR) Editorial Review Board. Additionally, she is an associate editor for the Special Issue in MIS Quarterly. She has been a reviewer for top-tier academic journals and conferences in her field, including serving as the co-organizer of the Feeder Workshop for the Workshop on Information Technologies and Systems (WITS) 2024, track Co-Chair for the Pacific Asia Conference on Information Systems (PACIS) 2023, and track Associate Editor for the International Conference on Information Systems (ICIS) over several years.",
      "education": [
        "Ph.D. (Tsinghua University)"
      ],
      "research_areas": [
        "Digital Transformation, Platforms & Innovation",
        "Data Science & Business Analytics"
      ],
      "research_interests": [
        "Economics of Information Systems",
        "Economics of Dark Web",
        "Online Altruism and Crowd Wisdom",
        "Competitive Intelligence and Predictive Analytics"
      ],
      "research_projects": [
        {
          "title": "Decoding Persuasion on Crowdfunding Platforms",
          "description": "This research proposes a novel prediction framework based on persuasion theory to enhance crowdfunding success predictions. It aims to identify persuasive elements in project descriptions and improve the prediction accuracy so as to provide guidance for crowdfunding project initiators. The study integrates computational methods and deep learning to not only boost prediction performance but also offer interpretable insights, contributing to information systems and crowdfunding design.",
          "tags": [
            "Data Science & Business Analytics,Computational Social Science"
          ]
        },
        {
          "title": "Understanding Online Contribution: Impact Evaluation and Crowd Wisdom Extraction",
          "description": "With the massive amount of online contributions shaping individual and organizational decision-making, this project delves into utilizing and understanding this valuable resource. By combining econometrics and natural language processing, the research seeks innovative insights to leverage these vast information pools and assess their impacts on commerce and society.",
          "tags": [
            "Data Science & Business Analytics"
          ]
        }
      ],
      "phd_alumni": [],
      "publications": [
        {
          "title": "Lu, Y., Qiao, D., He S., Tan, B.C.Y., “How Search Technology Breeds Illegal Transactions: Empirical Evidence from the Darknet”,Management Science, For",
          "year": null,
          "full_citation": "Lu, Y., Qiao, D., He S., Tan, B.C.Y., “How Search Technology Breeds Illegal Transactions: Empirical Evidence from the Darknet”,Management Science, Forthcoming."
        },
        {
          "title": "Qiu, L., Qiao, D., Tan, B.C.Y., Whinston, A.B., (2024) Leading the Horse to Water? Investigating the Impact of Ride-hailing Services on Hate Crimes, P",
          "year": 2024,
          "full_citation": "Qiu, L., Qiao, D., Tan, B.C.Y., Whinston, A.B., (2024) Leading the Horse to Water? Investigating the Impact of Ride-hailing Services on Hate Crimes, Production and Operations Management, 33(1), 342-363.Forthcoming."
        },
        {
          "title": "Chan, J., He, S., Qiao, D., and Whinston, A. (2023) Shedding Light on the Dark: The Impact of Legal Enforcement on Darknet Transactions, Information S",
          "year": 2023,
          "full_citation": "Chan, J., He, S., Qiao, D., and Whinston, A. (2023) Shedding Light on the Dark: The Impact of Legal Enforcement on Darknet Transactions, Information Systems Research, 35(1), 145-164."
        },
        {
          "title": "Khern-am-nuai, W., Ghasemkhani, H., Qiao, D., and Kannan, K. (2023) The Impact of Online Q&As on Product Sales: The Case of Amazon Answer, Information",
          "year": 2023,
          "full_citation": "Khern-am-nuai, W., Ghasemkhani, H., Qiao, D., and Kannan, K. (2023) The Impact of Online Q&As on Product Sales: The Case of Amazon Answer, Information Systems Research, 35(2), 747-765."
        },
        {
          "title": "Qiao, D., Rui, H. (2022). Text Performance on the Vine Stage? The Effect of Incentive on Product Review Text Quality”. Information Systems Research, 3",
          "year": 2022,
          "full_citation": "Qiao, D., Rui, H. (2022). Text Performance on the Vine Stage? The Effect of Incentive on Product Review Text Quality”. Information Systems Research, 34(2), pp.676-697."
        },
        {
          "title": "Qiao, D., Lee, S. Y., Whinston, A. B., & Wei, Q. (2021). Mitigating the Adverse Effect of Monetary Incentives on Voluntary Contributions Online. Journ",
          "year": 2021,
          "full_citation": "Qiao, D., Lee, S. Y., Whinston, A. B., & Wei, Q. (2021). Mitigating the Adverse Effect of Monetary Incentives on Voluntary Contributions Online. Journal of Management Information Systems, 38(1), 82-107."
        },
        {
          "title": "Wang, L., Zhang, J., Chen, G., & Qiao, D. (2021). Identifying comparable entities with indirectly associative relations and word embeddings from web s",
          "year": 2021,
          "full_citation": "Wang, L., Zhang, J., Chen, G., & Qiao, D. (2021). Identifying comparable entities with indirectly associative relations and word embeddings from web search logs. Decision Support Systems, 141, 113465."
        },
        {
          "title": "Qiao, D., Lee, S. Y., Whinston, A. B., & Wei, Q. (2020). Financial incentives dampen altruism in online prosocial contributions: A study of online rev",
          "year": 2020,
          "full_citation": "Qiao, D., Lee, S. Y., Whinston, A. B., & Wei, Q. (2020). Financial incentives dampen altruism in online prosocial contributions: A study of online reviews. Information Systems Research, 31(4), 1361-1375."
        },
        {
          "title": "Guo, X., Wei, Q., Chen, G., Zhang, J., & Qiao, D. (2017). Extracting Representative Information on Intra-Organizational Blogging Platforms. MIS Quarte",
          "year": 2017,
          "full_citation": "Guo, X., Wei, Q., Chen, G., Zhang, J., & Qiao, D. (2017). Extracting Representative Information on Intra-Organizational Blogging Platforms. MIS Quarterly, 41(4), 1105-1127."
        },
        {
          "title": "Wei, Q., Qiao, D., Zhang, J., Chen, G., & Guo, X. (2016). A novel bipartite graph based competitiveness degree analysis from query logs. ACM Transacti",
          "year": 2016,
          "full_citation": "Wei, Q., Qiao, D., Zhang, J., Chen, G., & Guo, X. (2016). A novel bipartite graph based competitiveness degree analysis from query logs. ACM Transactions on Knowledge Discovery from Data (TKDD), 11(2), 1-25."
        },
        {
          "title": "Qiao, D., Zhang, J., We, Q., Chen, G., 2017. Finding Competitive Keywords from Query Logs to Enhance Search Engine Advertising. Information & Manageme",
          "year": 2017,
          "full_citation": "Qiao, D., Zhang, J., We, Q., Chen, G., 2017. Finding Competitive Keywords from Query Logs to Enhance Search Engine Advertising. Information & Management, 54(4), pp.531-543."
        }
      ],
      "publications_count": 11,
      "awards": [],
      "awards_count": 0,
      "courses": []
    },
    {
      "name": "SETIONO, Rudy",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/rudys",
      "appointment": "Associate Professor",
      "additional_titles": [
        "Program Director, Graduate Studies"
      ],
      "office": "COM2-04-13",
      "phone": "651 66297",
      "email": "rudys@comp.nus.edu.sg",
      "personal_page": "https://www.comp.nus.edu.sg/~rudys",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/rudys.jpg",
      "profile": "Dr. Rudy Setiono is Associate Professor in the School of Computing at the National University of Singapore. He received a B.S. degree in Computer Science (1984) from Eastern Michigan University, and M.S. (1986) and Ph.D. degrees (1990) in Computer Science from the University of Wisconsin-Madison. Since August 1990, he has been with the National University of Singapore.\n\nDr. Setiono's research interests include unconstrained optimization, neural network construction and pruning, and rule extraction from neural networks and its applications.\n\nHe has published in reputable international journals such as SIAM Journal on Control and Optimization, European Journal of Operational Research, Journal of Optimization Theory and Applications, IEEE Transactions on Neural Networks, IEEE Transactions on Data and Knowledge Engineering, IEEE Transactions on Systems, Man, and Cybernetics, Neural Computation, Neurocomputing, and Connection Science.",
      "education": [
        "Ph.D. (Computer Science, University of Wisconsin-Madison)",
        "M.Sc. (Computer Science, University of Wisconsin-Madison)",
        "B.Sc. (Computer Science, Eastern Michigan University)"
      ],
      "research_areas": [
        "Data Science & Business Analytics",
        "Intelligent Systems"
      ],
      "research_interests": [
        "Nonlinear Optimization",
        "Data Mining",
        "Neural Networks",
        "Unconstrained optimization",
        "Neural network construction and pruning",
        "Rule extraction from neural networks and its applications"
      ],
      "research_projects": [],
      "phd_alumni": [],
      "publications": [
        {
          "title": "Y. Hayashi, R. Setiono and A. Azcarraga.Neural network training and rule extraction with augmented discretized input, Neurocomputing, accepted for pub",
          "year": null,
          "full_citation": "Y. Hayashi, R. Setiono and A. Azcarraga.Neural network training and rule extraction with augmented discretized input, Neurocomputing, accepted for publication."
        },
        {
          "title": "R. Setiono, A. Azcarraga and Y. Hayashi. Using sample selection to improve accuracy and simplicity of rules extracted from neural networks for credit ",
          "year": 1550,
          "full_citation": "R. Setiono, A. Azcarraga and Y. Hayashi. Using sample selection to improve accuracy and simplicity of rules extracted from neural networks for credit scoring applications, International Journal of Computational Intelligence and Applications, Vol. 14, No. 4, pages 1550021-1-20, 2015."
        },
        {
          "title": "A. Azcarraga, A. Caronongan, R. Setiono and S. Manalili.Validating the stable clustering of songs in a structured 3D SOM. In Proceedings of IJCNN 2016",
          "year": 2016,
          "full_citation": "A. Azcarraga, A. Caronongan, R. Setiono and S. Manalili.Validating the stable clustering of songs in a structured 3D SOM. In Proceedings of IJCNN 2016, International Joint Conference on Neural Networks, Vancouver, Canada, July 2016."
        },
        {
          "title": "R. Setiono. Determining relevant variables and interactions in credit scoring data with neural network pruning and rule extraction. In Proceedings of ",
          "year": 2014,
          "full_citation": "R. Setiono. Determining relevant variables and interactions in credit scoring data with neural network pruning and rule extraction. In Proceedings of the 45th International Decision Sciences Institute Conference, Tampa, USA, November 2014."
        },
        {
          "title": "A. Azcarraga, P. Tensuan and R. Setiono. Tagging documents using neural networks based on local word features. In Proceedings of IJCNN 2014, Internati",
          "year": 2014,
          "full_citation": "A. Azcarraga, P. Tensuan and R. Setiono. Tagging documents using neural networks based on local word features. In Proceedings of IJCNN 2014, International Joint Conference on Neural Networks, Beijing, China, July 2014, pages 724-731."
        },
        {
          "title": "R. Setiono, A. Azcarraga, and Y. Hayashi. MofN rule extraction from neural networks trained with discretized input. In Proceedings of IJCNN 2014, Inte",
          "year": 2014,
          "full_citation": "R. Setiono, A. Azcarraga, and Y. Hayashi. MofN rule extraction from neural networks trained with discretized input. In Proceedings of IJCNN 2014, International Joint Conference on Neural Networks, Beijing, China, July 2014, pages 1079-1086."
        },
        {
          "title": "J. Hartanto and  R. Setiono. Combining Chi2 discretization and neural networks for efffective predictive analytics. In Proceedings of the 44th Interna",
          "year": 2013,
          "full_citation": "J. Hartanto and  R. Setiono. Combining Chi2 discretization and neural networks for efffective predictive analytics. In Proceedings of the 44th International Decision Sciences Institute Conference, Baltimore, USA, November 2013."
        },
        {
          "title": "A. Azcarraga, Y. Hayashi and R. Setiono. Credit scoring using neural networks with augmented discretized inputs. In Proceedings of the 12th Internatio",
          "year": 2013,
          "full_citation": "A. Azcarraga, Y. Hayashi and R. Setiono. Credit scoring using neural networks with augmented discretized inputs. In Proceedings of the 12th International Decision Sciences Institute Conference, Bali, Indonesia, July 2013, pages 1412-1426."
        },
        {
          "title": "A. Azcarraga, C. Enriquez, Y. Hayashi and R. Setiono. Using neural network for visualizing poverty. In Proceedings of the 12th International Decision ",
          "year": 2013,
          "full_citation": "A. Azcarraga, C. Enriquez, Y. Hayashi and R. Setiono. Using neural network for visualizing poverty. In Proceedings of the 12th International Decision Sciences Institute Conference, Bali, Indonesia, July 2013, pages 1005-1023."
        }
      ],
      "publications_count": 9,
      "awards": [],
      "awards_count": 0,
      "courses": []
    },
    {
      "name": "SOW Jin Sze, Samantha",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/sowjs",
      "appointment": "Senior Lecturer (Educator Track)",
      "additional_titles": [],
      "office": "COM3-B1-25",
      "phone": "651 62857",
      "email": "sowjs@comp.nus.edu.sg",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/sowjs.jpg",
      "profile": "Samantha Sow Jin Sze is a Senior Lecturer in the Department of Information Systems and Analytics at the National University of Singapore (NUS). She holds an M.Ed. in Educational Studies (Learning, Teaching and Research) from the University of Sheffield and a B.Eng. (First Class Honours) from the National University of Singapore.\n\nAt the NUS School of Computing, she teaches BT1101 Introduction to Business Analytics under the Data Literacy Pillar of the undergraduate curriculum. As part of her ongoing commitment to pedagogical innovation, she was awarded a Blended Learning 2.0 grant (2025) to redesign BT1101 into a technology-enhanced, student-centered blended learning experience. She also serves as a student advisor to the 2023 undergraduate cohort.\n\nHer teaching and research interests span data science, business analytics, and educational research. Beyond undergraduate teaching, she contributes to executive education through NUS Advanced Computing for Executives, where she facilitates programmes that help professionals build their digital and data competencies.\n\nPrior to joining NUS, Samantha held teaching and course lead roles at Temasek Polytechnic (2012–2022). She was actively involved in curriculum development, programme delivery and industry partnerships. She led the design and implementation of data science and business analytics programmes for both students and professionals from government agencies and private sector organisations.",
      "education": [],
      "research_areas": [
        "Data Science & Business Analytics"
      ],
      "research_interests": [
        "Data Science & Business Analytics",
        "Educational Research"
      ],
      "research_projects": [],
      "phd_alumni": [],
      "publications": [
        {
          "title": "Sow, J. S. (2019). Exploratory learning analytics: Translating shapes of educational data into early intervention warning signals in year one course. ",
          "year": 2019,
          "full_citation": "Sow, J. S. (2019). Exploratory learning analytics: Translating shapes of educational data into early intervention warning signals in year one course. In Proceedings of the 13th International Symposium on Advances in Technology Education."
        },
        {
          "title": "Sow, J. S (2018). Actualizing an applicative, authentic summative assessment using a hybrid model of an insights-driven datathon for IT students. In P",
          "year": 2018,
          "full_citation": "Sow, J. S (2018). Actualizing an applicative, authentic summative assessment using a hybrid model of an insights-driven datathon for IT students. In Proceedings of the 12th International Symposium on Advances in Technology Education."
        },
        {
          "title": "Kamiko, T., Lee, Y. C., Nayak, G., & Sow, J. S. (2015). Memory updating in a dual-ported internal memory with concurrent transfer and retrieval (U.S. ",
          "year": 2015,
          "full_citation": "Kamiko, T., Lee, Y. C., Nayak, G., & Sow, J. S. (2015). Memory updating in a dual-ported internal memory with concurrent transfer and retrieval (U.S. Patent No. 10,222,991). United States Patent and Trademark Office. https://patents.google.com/patent/US10222991"
        },
        {
          "title": "Kamiko, T., Lee, Y. C., Nayak, G., & Sow, J. S. (2007). Operating a dual-ported internal memory (U.S. Patent No. 9,146,865). United States Patent and ",
          "year": 2007,
          "full_citation": "Kamiko, T., Lee, Y. C., Nayak, G., & Sow, J. S. (2007). Operating a dual-ported internal memory (U.S. Patent No. 9,146,865). United States Patent and Trademark Office. https://patents.google.com/patent/US9146865"
        }
      ],
      "publications_count": 4,
      "awards": [],
      "awards_count": 0,
      "courses": []
    },
    {
      "name": "Prakash Chandra SUKHWAL",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/e0508720",
      "appointment": "Senior Lecturer (Educator Track)",
      "additional_titles": [],
      "office": "COM2-03-40",
      "phone": "651 64489",
      "email": "e0508720@comp.nus.edu.sg",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/e0508720.jpg",
      "profile": "Prakash Sukhwal is a Senior Lecturer in the Department of Information Systems and Analytics at National University of Singapore. He obtained his Ph.D. in Information Systems and Analytics from School of Computing in 2024.\n\nPrior to his current role, he was a Principal Data Scientist in manufacturing industry, where he utilized his machine learning and GenAI skills to drive innovation. \nWith over nine years of teaching experience, Prakash has taught extensively to both university graduates and industry professionals, covering courses from basic to advanced analytics. His research interests include the use of large language models, health informatics, knowledge graphs, and conversational AI. He has published in top-tier journal and conferences, such as PNAS, ICIS, HICSS, PACIS, and AAAI, and has received the NUS Research Achievement Award twice, in 2020 and 2022.",
      "education": [
        "Ph.D. (Information Systems and Analytics, National University of Singapore, Singapore, 2024)"
      ],
      "research_areas": [
        "Computational Social Science",
        "Healthcare Informatics",
        "Data Science & Business Analytics",
        "Intelligent Systems"
      ],
      "research_interests": [
        "Application of conversational agents in healthcare and education (individual and peer learning)",
        "Applied knowledge engineering methods (Large Language Models and Knowledge graphs) in healthcare and education",
        "Machine learning methodologies in social computing"
      ],
      "research_projects": [],
      "phd_alumni": [],
      "publications": [
        {
          "title": "Sukhwal, P.C., and Kankanhalli, A. 2022. “Determining Containment Policy Impacts on Public Sentiment during the Pandemic Using Social Media Data”, Pro",
          "year": 2022,
          "full_citation": "Sukhwal, P.C., and Kankanhalli, A. 2022. “Determining Containment Policy Impacts on Public Sentiment during the Pandemic Using Social Media Data”, Proceedings of the National Academy of Sciences."
        },
        {
          "title": "Designing a Healthcare QA Assistant: A Knowledge Based Approach",
          "year": 2022,
          "full_citation": "Sukhwal, P. C., Kankanhalli, A., & Rajan, V. 2022. \"Designing a Healthcare QA Assistant: A Knowledge Based Approach\", ICIS 2022 Proceedings. 1."
        },
        {
          "title": "Evaluation Dimensions for Assessing Question Answer Systems for Lay Users: The Case of DiseaseGuru",
          "year": 2023,
          "full_citation": "Sukhwal, P. C., Kankanhalli, A., & Rajan, V. 2023. \"Evaluation Dimensions for Assessing Question Answer Systems for Lay Users: The Case of DiseaseGuru\", Proceedings of the AAAI Symposium Series (Vol. 1, No. 1, pp. 98-102)."
        },
        {
          "title": "Knowledge Transfer between Humans and Conversational Agents: A Review, Organizing Framework, and Future Directions",
          "year": 2023,
          "full_citation": "Sukhwal, P. C., Cui, W., & Kankanhalli, A. 2023. \"Knowledge Transfer between Humans and Conversational Agents: A Review, Organizing Framework, and Future Directions\"' Proceedings of the 56th Hawaii International Conference on System Sciences."
        },
        {
          "title": "Explanations in Clinical DSS: A Review and Research Agenda",
          "year": 2020,
          "full_citation": "Lai, Y., Sukhwal, P.C., & Kankanhalli, A. 2020. \"Explanations in Clinical DSS: A Review and Research Agenda\". PACIS 2020 Proceedings. 169."
        }
      ],
      "publications_count": 5,
      "awards": [
        "NUS SOC, Research Achievement Award for academic year 2021/22",
        "NUS SOC, Research Achievement Award for academic year 2020/21"
      ],
      "awards_count": 2,
      "courses": []
    },
    {
      "name": "Bernard TAN Cheng Yian",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/btan",
      "appointment": "Tan Sri Runme Shaw Senior Professor",
      "additional_titles": [
        "Senior Vice Provost (Undergraduate Education), NUS Teaching Academy"
      ],
      "office": "COM2-04-38",
      "phone": "651 66868",
      "email": "btan@comp.nus.edu.sg",
      "personal_page": "https://www.comp.nus.edu.sg/~btan",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/btan.jpg",
      "profile": "Dr. Bernard Tan served as Professor and Head (2002-2008) of the Department of Information Systems at the National University of Singapore (NUS), Assistant Dean (2000 - 2002) in the School of Computing at NUS. Dr. Tan received his Ph.D. degree (1995) in information systems from NUS. He has been a Visiting Scholar in the Graduate School of Business at Stanford University (1996-1997) and the Terry College of Business at the University of Georgia (1992).\n\nDr. Tan is serving on the editorial boards of MIS Quarterly (Senior Editor), e-Service Journal (Senior Editor), Management Science, Journal of the AIS, IEEE Transactions on Engineering Management, Information and Management, Journal of Global Information Management, and International Journal of Distance Education Technologies. He has served or is serving on the program committees of international conferences such as ACM SIGGROUP, GDN, ICIS, IFIP, IRMA, PACIS, and WITS.\n\nDr. Tan has more than 30 articles published or forthcoming in top international journals such as ACM Transactions on Computer-Human Interaction, ACM Transactions on Information Systems, ACM Transactions on Internet Technology, Communications of the ACM, Decision Support Systems, European Journal of Information Systems, IEEE Transactions on Engineering Management, IEEE Transactions on Professional Communication, IEEE Transactions on Systems, Man, and Cybernetics, Information and Management, Information Systems Research, International Journal of Human-Computer Studies, Journal of Management Information Systems, Journal of the AIS, Journal of the American Society for Information Science and Technology, Management Science, and MIS Quarterly. He has also published widely in proceedings of top international conferences in the field of information systems.\n\nDr. Tan was a winner of the NUS Outstanding Educator Award (2004) (the highest university teaching award), the NUS Excellent Teacher Award (2003), the NUS Young Researcher Award (2002) (the highest university research award for faculty members below age 40), and the NUS School of Computing Teaching Excellence Award (2000). His cross-cultural research work on software projects has received Honorable Mention for Best Paper Award in IEEE Transactions on Engineering Management (2003). Dr. Tan was an invited symposium chair at the Academy of Management Annual Conference (2005) and an invited keynote speaker at the Asia-Europe Forum on Culture in the Cyber Age (2000). He was a runner-up in the ICIS doctoral dissertation competition (1995) and was an ICIS doctoral consortium fellow (1993).\n\nDr. Tan is a Council Member for the Asia-Pacific Region for the Association for Information Systems (2004-2006). He has served in the nominating committee of the Association for Information Systems (1999, 2001, and 2005). He is an External Examiner for Temasek Polytechnic (2002-2006), an External Examiner for Open University of Hong Kong (2002-2005), an External Examiner for City University of Hong Kong (2004-2007), and a Management Board Member for Institute of Systems Science (2002-2009). He has been a reviewer for the masters program in information systems for Universitas 21 Global (2003). Dr. Tan has served in the Education and Learning Sub-Committee of the Intelligent Nation 2015 Committee (the national IT strategic planning committee) (2005-2006). He is currently doing research on cross-cultural issues in information systems, virtual communities, knowledge management, Internet information privacy, and software project management.",
      "education": [
        "Ph.D. (Information systems, National University of Singapore)",
        "M.Sc. (National University of Singapore)",
        "B.Sc. (Honours, National University of Singapore)"
      ],
      "research_areas": [
        "Data Science & Business Analytics",
        "Healthcare Informatics",
        "Digital Transformation, Platforms & Innovation",
        "Computational Social Science",
        "Intelligent Systems"
      ],
      "research_interests": [
        "Virtual Communities",
        "Knowledge Management",
        "Lifelong Learning",
        "Cross-Cultural Issues in Information Systems",
        "Computer-Mediated Communication",
        "Knowledge Management",
        "Information Privacy",
        "Software Project Management"
      ],
      "research_projects": [],
      "phd_alumni": [
        {
          "name": "Juliana Sutanto",
          "first_placement": "Assistant Professor, ETH Zurich",
          "graduation_year": 2008,
          "current_position": "Professor",
          "institution": "Monash University"
        }
      ],
      "publications": [
        {
          "title": "Group Polarization and Computer-Mediated Communication: Effects of Communication Cues, Social Presence, and Anonymity,",
          "year": 2002,
          "full_citation": "Sia, C.L., Tan, B.C.Y. and Wei, K.K. \"Group Polarization and Computer-Mediated Communication: Effects of Communication Cues, Social Presence, and Anonymity,\"Information Systems Research, 2002, Volume 13, Number 1, pp. 70-90."
        },
        {
          "title": "Cross-Cultural Study on Escalation of Commitment Behavior in Software Projects,",
          "year": 2000,
          "full_citation": "Keil, M., Tan, B. C. Y., Wei, K. K., Saarinen, T., Tuunainen, V. and Wassenaar, A. \"Cross-Cultural Study on Escalation of Commitment Behavior in Software Projects,\"MIS Quarterly, 2000, Volume 24, Number 2, pp. 299-325."
        },
        {
          "title": "A Partial Test of the Task-Medium Fit Proposition in a Group Support System Environment,",
          "year": 1999,
          "full_citation": "Tan, B. C. Y., Wei, K. K., Sia, C. L. and Raman, K. S. \"A Partial Test of the Task-Medium Fit Proposition in a Group Support System Environment,\"ACM Transactions on Computer-Human Interaction, 1999, Volume 6, Number 1, pp. 47-66."
        },
        {
          "title": "The Equalizing Impact of a Group Support System on Status Differentials,",
          "year": 1999,
          "full_citation": "Tan, B. C. Y., Wei, K. K. and Watson, R. T. \"The Equalizing Impact of a Group Support System on Status Differentials,\"ACM Transactions on Information Systems, 1999, Volume 17, Number 1, pp. 77-100."
        },
        {
          "title": "Computer-Mediated Communication and Majority Influence: Assessing the Impact in an Individualistic and a Collectivistic Culture,",
          "year": 1998,
          "full_citation": "Tan, B. C. Y., Wei, K. K., Watson, R. T., Clapper, D. L. and McLean, E. R. \"Computer-Mediated Communication and Majority Influence: Assessing the Impact in an Individualistic and a Collectivistic Culture,\"Management Science, 1998, Volume 44, Number 9, pp. 1263-1278."
        }
      ],
      "publications_count": 5,
      "awards": [],
      "awards_count": 0,
      "courses": []
    },
    {
      "name": "TAN Swee Lin, Sharon",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/tansl",
      "appointment": "Associate Professor (Educator Track)",
      "additional_titles": [
        "Vice-Dean, Industry Relations",
        "Chair, Faculty Teaching Excellence Committee (FTEC)"
      ],
      "office": "COM2-04-31",
      "phone": "651 64866",
      "email": "tansl@comp.nus.edu.sg",
      "personal_page": "https://www.comp.nus.edu.sg/disa/bio/tansl",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/tansl.jpg",
      "profile": "Dr Sharon Tan is an Associate Professor in the Department of Information Systems and Analytics (DISA) at the National University of Singapore (NUS). She holds a PhD from Tepper School of Business, Carnegie Mellon University, and an MSc and BSc (Honors) in Information Systems from the National University of Singapore.\n\nHer research focuses mainly on the intersection of IT and healthcare with a special focus on digitisation of healthcare processes and the use and implementation of IT/analytics on health behavior modification and education. Her work has been presented at premier conferences such as the International Conference on Information Systems (ICIS) and the Association of Medical Informatics Association (AMIA) and published in MIS Quarterly, Information Systems Research, Journal of American Medical Informatics and Journal of Medical Internet Research. She is a recipient of the University's Annual Teaching Excellence Award and the Faculty Teaching Excellence award, and several research awards including the Emerald Citations of Excellence Award, and the AIS SIG-Health Annual Best Paper Award Meritorious Mention.\n\nSharon has served as guest co-editor for a special section in Information Systems Frontiers and a focus theme issue for Methods of Information in Medicine on “Big Data & Analytics in Healthcare\". She has also served on the editorial board of the Journal of AIS and the Journal of Database Management and as Program Co-chair for the International Conference on Big Data and Analytics in Healthcare (BDAH) 2014, Organizing Committee member for BDAH 2013, and as Track Co-chair for “Healthcare IS track” at ICIS 2015, “IT/IS in Healthcare” track at PACIS 2012 & 2015, and “Health Informatics” at International Conference on Electronic Commerce 2014. She has served as the department's Curriculum Chair and is currently chairing the Faculty Teaching Excellence Committee and is a Faculty Advisor for the Developer Student Club @ NUS.",
      "education": [
        "Ph.D. (Carnegie Mellon University)",
        "M.Sc. (Carnegie Mellon University)",
        "M.Sc. (Information Systems, National University of Singapore)",
        "B.Sc. (Information Systems, Honours, National University of Singapore)"
      ],
      "research_areas": [
        "Healthcare Informatics",
        "Computational Social Science"
      ],
      "research_interests": [
        "Digitisation in Healthcare",
        "Use and Implementation of IT/Analytics on Health Behaviour Modification and Education"
      ],
      "research_projects": [
        {
          "title": "Enhancing Student Engagement in Online Learning: A Design Science Approach",
          "description": "Online learning gained traction during the pandemic and is expected to stay for its resilience in crisis. While blended learning is promising, student engagement remains a challenge. This project targets the issue by developing a comprehensive engagement measure, an interactive dashboard for data visualization, and diverse instructor interventions to improve student engagement in blended learning.",
          "tags": [
            "Computational Social Science"
          ]
        }
      ],
      "phd_alumni": [],
      "publications": [
        {
          "title": "Yang, Yang, Goh, K. Y., Teo, H. H. and Tan, S. S-L. Compete with me? The impact of online gamified competition on exercise behavior. Journal of the As",
          "year": 2023,
          "full_citation": "Yang, Yang, Goh, K. Y., Teo, H. H. and Tan, S. S-L. Compete with me? The impact of online gamified competition on exercise behavior. Journal of the Association for Information Systems, 24 (3), 2023, pp. 912-935."
        },
        {
          "title": "Liu, N., Yin, J., Tan, S.S.L., Ngiam, K.Y. and Teo, H.H. “Mobile Health Applications for Older\nAdults: A systematic review of interface and persuasive",
          "year": 2021,
          "full_citation": "Liu, N., Yin, J., Tan, S.S.L., Ngiam, K.Y. and Teo, H.H. “Mobile Health Applications for Older\nAdults: A systematic review of interface and persuasive feature design” Journal of American\nMedical Informatics Association, vol28, no.11, 2021, pp. 2483-2501."
        },
        {
          "title": "Tan, S.S.L. and Goonawardene, N. “Online Health Information Seeking and Patient-physician Relationship: A Systematic Review,” Journal of Medical Inter",
          "year": 2017,
          "full_citation": "Tan, S.S.L. and Goonawardene, N. “Online Health Information Seeking and Patient-physician Relationship: A Systematic Review,” Journal of Medical Internet Research, 2017;191:e9."
        },
        {
          "title": "Tan, S.S.L., Gao, G. and Koch, S. “Big Data and Analytics in Healthcare”,Methods of Information in Medicine, 546, 2015, pp.546-547.",
          "year": 2015,
          "full_citation": "Tan, S.S.L., Gao, G. and Koch, S. “Big Data and Analytics in Healthcare”,Methods of Information in Medicine, 546, 2015, pp.546-547."
        },
        {
          "title": "Zhou,F., Tong, Y., Teo, H.H. and Tan, S.S.L. “Overcoming the System Fit Challenge at the Initial Post-Adoption Stage: The Roles of Emotions in Users' ",
          "year": 2016,
          "full_citation": "Zhou,F., Tong, Y., Teo, H.H. and Tan, S.S.L. “Overcoming the System Fit Challenge at the Initial Post-Adoption Stage: The Roles of Emotions in Users' Adaptation Behaviors”,Proceedings of the Thirty-sixth Annual International Conference on Information SystemsDublin, Ireland, Dec, 2016."
        },
        {
          "title": "Ntsweng, O. and Tan, S.S.L. “The Effects of Serious Games’ Genres and Frequency of Exposure on Children’s Dietary Preferences”,Proceedings of the Thir",
          "year": 2016,
          "full_citation": "Ntsweng, O. and Tan, S.S.L. “The Effects of Serious Games’ Genres and Frequency of Exposure on Children’s Dietary Preferences”,Proceedings of the Thirty-sixth Annual International Conference on Information SystemsDublin, Ireland, Dec, 2016."
        },
        {
          "title": "Goonawardene, N. and Tan, S.S.L. “Health 2.0 Enabled Collaborative Healthcare Maintenance,” inProceedings of the Thirty-fifth Annual International Con",
          "year": 2015,
          "full_citation": "Goonawardene, N. and Tan, S.S.L. “Health 2.0 Enabled Collaborative Healthcare Maintenance,” inProceedings of the Thirty-fifth Annual International Conference on Information SystemsFort Worth, USA, Dec 2015."
        },
        {
          "title": "Kohli, R. and Tan, S.S.L. “Electronic Health Records: How Can IS Researchers Contribute to Transforming Healthcare”MIS Quarterly,403, 2016, pp.553-573",
          "year": 2016,
          "full_citation": "Kohli, R. and Tan, S.S.L. “Electronic Health Records: How Can IS Researchers Contribute to Transforming Healthcare”MIS Quarterly,403, 2016, pp.553-573.Authorship in alphabetical order."
        },
        {
          "title": "Kankanhalli, A., Han, J., Tan, S.S.L. and Gao, G. “Special Section on Big Data and Analytics in HealthCare,”Information Systems Frontiers, 182, 2016, ",
          "year": 2016,
          "full_citation": "Kankanhalli, A., Han, J., Tan, S.S.L. and Gao, G. “Special Section on Big Data and Analytics in HealthCare,”Information Systems Frontiers, 182, 2016, pp.233-235."
        },
        {
          "title": "Tong, Y., Tan, S.S.L and Teo, H.H. “The Road to Early Success: Impact of System Use in the Swift Response Phase”,Information Systems Research, 262, 20",
          "year": 2015,
          "full_citation": "Tong, Y., Tan, S.S.L and Teo, H.H. “The Road to Early Success: Impact of System Use in the Swift Response Phase”,Information Systems Research, 262, 2015, pp. 418-436.AIS SigHealth 2016 Annual Best Paper Award Meritorious Mention"
        },
        {
          "title": "Goonawardene, N. and Tan, S.S.L. “Practitioner-driven Virtual Communities: An Attachment Theory Perspective to Patients’ Adherence to Online Health Ad",
          "year": 2014,
          "full_citation": "Goonawardene, N. and Tan, S.S.L. “Practitioner-driven Virtual Communities: An Attachment Theory Perspective to Patients’ Adherence to Online Health Advice”, inProceedings of the Thirty-fourth Annual International Conference on Information SystemsAuckland, New Zealand, Dec 2014."
        },
        {
          "title": "Jiang, J., Tan, S.S.L., Goh, K.Y., and Wu, D. “Effectiveness of a Heath Card Program on Appointment Compliance,”International Conference on Big Data a",
          "year": 2014,
          "full_citation": "Jiang, J., Tan, S.S.L., Goh, K.Y., and Wu, D. “Effectiveness of a Heath Card Program on Appointment Compliance,”International Conference on Big Data and Analytics in Healthcare BDAH Proceedings, Singapore, June 2014."
        },
        {
          "title": "Liu, R., Jiang, J., Goonawardene, N., and Tan, S.S.L. “A Case Study on the Effectiveness of an In-house Physician Rating Tool in Outpatient Clinics”, ",
          "year": 2015,
          "full_citation": "Liu, R., Jiang, J., Goonawardene, N., and Tan, S.S.L. “A Case Study on the Effectiveness of an In-house Physician Rating Tool in Outpatient Clinics”, inProceedings of the Annual Symposium of American Medical Informatics AssociationSan Francisco CA, USA, Nov 2015."
        },
        {
          "title": "Goonawardene, N., Jiang, J., Tan, S.S.L. and Jiang Z. “Online Health Information Seeking and Adolescents’ Intention towards Health Self-management”,Pr",
          "year": 2013,
          "full_citation": "Goonawardene, N., Jiang, J., Tan, S.S.L. and Jiang Z. “Online Health Information Seeking and Adolescents’ Intention towards Health Self-management”,Proceedings of the 17th Pacific Asia Conference on Information SystemsJeju-island, Korea, June 2013."
        },
        {
          "title": "Goonawardene, N. and Tan, S.S.L. “A Qualitative Analysis of Patients’ Behaviour in an Online Health Community: Dynamics of Self-regulated Health Goal ",
          "year": 2014,
          "full_citation": "Goonawardene, N. and Tan, S.S.L. “A Qualitative Analysis of Patients’ Behaviour in an Online Health Community: Dynamics of Self-regulated Health Goal Achievement”, inProceedings of the Annual Symposium of American Medical Informatics AssociationWashington DC, USA, Nov 2014."
        },
        {
          "title": "The Influence of Job Rotation on Physicians' System Use: A Situated Learning Perspective",
          "year": 2011,
          "full_citation": "Tong, Y., Goonawardene, N., Tan, S.S.L., Teo, H.H., and Low, C.H. \"The Influence of Job Rotation on Physicians' System Use: A Situated Learning Perspective\",Proceedings of the Thirty-second Annual International Conference on Information SystemsShanghai, China, 2011."
        },
        {
          "title": "Goonawardene, N. and Tan, S.S.L. “Patients’ Adherence to Health Advice on Virtual Communities: Identity and Bond Theory Perspective”,Proceedings of th",
          "year": 2013,
          "full_citation": "Goonawardene, N. and Tan, S.S.L. “Patients’ Adherence to Health Advice on Virtual Communities: Identity and Bond Theory Perspective”,Proceedings of the Thirty-third Annual International Conference on Information SystemsMilan, Italy, Dec 2013."
        },
        {
          "title": "Adoption of Web-based Transactional Banking: Efficiency-choice and Neo-institutional Perspectives",
          "year": 2002,
          "full_citation": "Tan, S.S. L and Fichman, M. \"Adoption of Web-based Transactional Banking: Efficiency-choice and Neo-institutional Perspectives\",Proceedings of the Twenty-Third Annual International Conference on Information Systems, 2002, pp.137-146.Runners-up for Best Conference Paper Award."
        },
        {
          "title": "Empowering Physicians with Electronic Health Records: System Capabilities to Adoption Intention",
          "year": 2010,
          "full_citation": "Xu, L., Tan, S.S.L., Chan, H.C., Teo, H.H. and Goh, L.G. \"Empowering Physicians with Electronic Health Records: System Capabilities to Adoption Intention\",Proceedings of the Academy of Management 2010 Conference, OCIS division."
        },
        {
          "title": "An Empirical Study of the Mediating Mechanisms of Knowledge Contribution",
          "year": 2009,
          "full_citation": "Tan, S.S.L. and Zou, X. \"An Empirical Study of the Mediating Mechanisms of Knowledge Contribution\",Proceedings of the 8th Annual Pre-ICIS Workshop on HCI Research in MIS, Phoenix, Arizona, 2009.Best Paper Award."
        },
        {
          "title": "Contribution Behaviors in Distributed Environments,",
          "year": 2008,
          "full_citation": "Olivera, F., Goodman, P.S. and Tan, S.S.L. \"Contribution Behaviors in Distributed Environments,\"MIS Quarterly, vol. 32, no. 1, pp. 23-42, March 2008.Emerald Management Review Citation of Excellence Award."
        }
      ],
      "publications_count": 21,
      "awards": [
        "AIS SIG-Health Annual Best Paper Award (Meritorious Mention) in the Senior category, 2016",
        "NUS Annual Teaching Excellence Award, AY2014-15",
        "Faculty Teaching Excellence award, AY2014-15, 2015-16",
        "Nominee for Faculty Teaching Excellence award, AY2012-13 & AY2011-12",
        "Best paper award at Pre-ICIS 2009 Human Computer Interaction conference (Acceptance rate of about 30%)",
        "Emerald Citations of Excellence Award 2009 (Emerald Management Reviews is an abstracting and indexing database that covers every article in the top 400 business and management journals world-wide including titles such as: Harvard Business Review; Journal of Finance; Journal of Marketing; Strategic Management Journal; MIT Sloan Management Review; Long Range Planning; Academy of Management Journal; and MIS Quarterly. Every article that appears in these titles is sent to independent subject experts for evaluation. Our article was selected as one of the top 50 from the 15,000 articles that was reviewed throughout 2008.)",
        "AOM (OCIS Division) Doctoral Consortium (2003)",
        "Runners-up for Best paper Award at ICIS 2002 (Full paper acceptance rate of about 15%)",
        "William Larimer Fellowship (1999-2002)",
        "NUS Overseas Graduate Scholarship (2001-2004)",
        "NUS Research Scholarship (1997-1998)",
        "National Science and Technology Board Scholarship (1997-1998)"
      ],
      "awards_count": 12,
      "courses": []
    },
    {
      "name": "TAN Wee Kek",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/tanwk",
      "appointment": "Associate Professor (Educator Track)",
      "additional_titles": [
        "Fellow, NUS Teaching Academy",
        "Core Member, University-level Workgroup for X + AI Courses and Programmes",
        "Lead Coordinator, NUS Artificial Intelligence Competency Programme (AICP)",
        "Member, School Curriculum Committee (SCC)",
        "Member, Faculty Promotion in Educator Track Committee (FPEC)",
        "Chair, Department Curriculum Committee (DCC)",
        "Member, Department Search Committee"
      ],
      "office": "COM3-02-35",
      "phone": "651 66731",
      "email": "tanwk@comp.nus.edu.sg",
      "personal_page": "https://www.comp.nus.edu.sg/~tanwk",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/tanwk.jpg",
      "profile": "Dr. TAN Wee Kek is currently an Associate Professor in the Department of Information Systems and Analytics at National University of Singapore (NUS), School of Computing. He is the Chair of the Department Curriculum Committee and a core member of the University-level Workgroup for X + AI Courses and Programmes. He served as an Assistant Dean in the School's Office of Student Life from 2019 to 2024. He has also been a Fellow of the NUS Teaching Academy since 2017 and served as Vice-Chair of its Executive Committee from 2020 to 2024. He graduated with a Doctor of Philosophy in Information Systems in July 2013 and a Bachelor of Computing in Information Systems (First Class Honours) in July 2007, both from the National University of Singapore. Prior to this, he attended Singapore Polytechnic and graduated with a Diploma in Computer Information Systems with Merit in July 2001.\n\nHis current research interest focuses on Technology-Enhanced Learning (TEL), including the adoption and use of artificial intelligence technologies in teaching and learning. In terms of disciplinary research, he has a keen interest in consumer-based information technology (e.g., online decision aids, social computing, virtual worlds, and consumer cloud services). Most of his research is based on design science, a well-established problem-solving paradigm that has been widely adopted in information systems research.\n\nHis work has been published or is forthcoming in journals such as the Journal of the American Society for Information Science and Technology (JASIST), Decision Support Systems (DSS), Communications of the Association for Information Systems (CAIS), and the Journal of Information Systems Education (JISE). His work has also been presented or is forthcoming in conferences such as the ACM SIGMIS Computer Personnel Research Conference (SIGMIS-CPR), IFIP Working Group 8.2 Working Conference (IFIP WG8.2), European Conference on Information Systems (ECIS), Americas Conference on Information Systems (AMCIS), and International Conference on Human-Computer Interaction (ICHCI).\n\nHe received the faculty-level Research Achievement Award in 2013 and was a nominee for the ACM SIGMIS 2009 Magid Igbaria Outstanding Conference Paper of the Year.\n\nHe presently teaches undergraduate students, graduate students, and adult learners subjects on software engineering, data science, artificial intelligence, and the Internet of Things. He is the Lead Coordinator of the NUS Artificial Intelligence Competency Programme (AICP).\n\nFor his unwavering commitment to educational excellence, he has won the Annual Teaching Excellence Award (ATEA) and Faculty Teaching Excellence Award (FTEA) multiple times over the years and has been placed on the Honour Roll of both awards twice. In 2017, he was also conferred the Commendation Medal (Pingat Kepujian) by the President of Singapore.",
      "education": [
        "Ph.D. (Information Systems, National University of Singapore)"
      ],
      "research_areas": [
        "Digital Transformation, Platforms & Innovation"
      ],
      "research_interests": [
        "Consumer-based Information Technology (e.g., online decision aids, social computing, virtual worlds and consumer cloud services)",
        "Technology-Enhanced Learning",
        "Learning Analytics",
        "Information Systems Education"
      ],
      "research_projects": [],
      "phd_alumni": [],
      "publications": [
        {
          "title": "The Social Dimension of Mobile Commerce - Engaging Customers through Group Purchase,",
          "year": 9751,
          "full_citation": "Tan, W. K., Teo, H. H., Tan, C. H., and Yang, Y. \"The Social Dimension of Mobile Commerce - Engaging Customers through Group Purchase,\" in Lecture Notes in Computer Science, Volume 9751, HCI in Business, Government, and Organizations: eCommerce and Innovation, Nah, F. F.-H. and Tan, C. H. Eds, Springer International Publishing, Switzerland, 2016, pp. 468-479. Proceedings of the 18th International Conference on Human-Computer Interaction, Toronto, Canada, July 17-22, 2016 ICHCI"
        },
        {
          "title": "Productpedia - A Collaborative Electronic Product Catalog for Ecommerce 3.0,",
          "year": 9191,
          "full_citation": "Tan, W. K., and Teo, H. H. \"Productpedia - A Collaborative Electronic Product Catalog for Ecommerce 3.0,\" in Lecture Notes in Computer Science, Volume 9191, HCI in Business, Nah, F. F.-H. and Tan, C. H. Eds, Springer International Publishing, Switzerland, 2015, pp. 370-381. Proceedings of the 17th International Conference on Human-Computer Interaction, Los Angeles, California, United States, August 2-7, 2015 ICHCI"
        },
        {
          "title": "When Two is Better than One - Product Recommendation with Dual Information Processing Strategies,",
          "year": 8527,
          "full_citation": "Tan, W. K., Tan, C. H., and Teo, H. H. \"When Two is Better than One - Product Recommendation with Dual Information Processing Strategies,\" in Lecture Notes in Computer Science, Volume 8527, HCI in Business, Nah, F. F.-H. Ed, Springer International Publishing, Switzerland, 2014, pp. 775-786. Proceedings of the 16th International Conference on Human-Computer Interaction, Creta Maris, Heraklion, Crete, Greece, June 22-27, 2014 ICHCI"
        },
        {
          "title": "Conveying Information Effectively in a Virtual World: Insights from Synthesized Task Closure and Media Richness,",
          "year": 2012,
          "full_citation": "Tan, W. K., Tan, C. H., and Teo, H. H. \"Conveying Information Effectively in a Virtual World: Insights from Synthesized Task Closure and Media Richness,\"Journal of the American Society for Information Science and Technology (JASIST), 63:6, June 2012, pp. 1198-1212."
        },
        {
          "title": "Consumer-based Decision Aid that Explains Which to Buy: Decision Confirmation or Overconfidence Bias?,",
          "year": 2012,
          "full_citation": "Tan, W. K., Tan, C. H., and Teo, H. H. \"Consumer-based Decision Aid that Explains Which to Buy: Decision Confirmation or Overconfidence Bias?,\"Decision Support Systems (DSS), 53:1, April 2012, pp. 127-141."
        },
        {
          "title": "Teaching Information Systems Development via Process Variants,",
          "year": 2010,
          "full_citation": "Tan, W. K., and Tan, C. H. \"Teaching Information Systems Development via Process Variants,\"Journal of Information Systems Education (JISE), 21:2, Summer 2010, pp. 159-172."
        },
        {
          "title": "Designing an Information Systems Development Course to Incorporate Agility, Flexibility, and Adaptability,",
          "year": 2010,
          "full_citation": "Tan, C. H., Tan, W. K., and Teo, H. H. \"Designing an Information Systems Development Course to Incorporate Agility, Flexibility, and Adaptability,\"Communications of the Association for Information Systems (CAIS), 26, March 2010, Article 10, pp. 171-194."
        },
        {
          "title": "Designing Groupware that Fosters Social Capital Creation: Can Facebook Support Global Virtual Team?,",
          "year": 2009,
          "full_citation": "Tan, W. K., Nguyen, T. T. D., Oo Tha, K. K., and Yu, X. \"Designing Groupware that Fosters Social Capital Creation: Can Facebook Support Global Virtual Team?,\" in Proceedings of the 15th Americas Conference on Information Systems (AMCIS), San Francisco, California, United States, August 6-9, 2009, Paper 525."
        },
        {
          "title": "Would I Use My Personal Blog for Commercial Exchange?,",
          "year": 2009,
          "full_citation": "Tan, W. K., Tan, C. H., and Teo, H. H. \"Would I Use My Personal Blog for Commercial Exchange?,\" in Proceedings of the 17th European Conference on Information Systems (ECIS), Verona, Italy, June 8-10, 2009, 78."
        },
        {
          "title": "Blogging to Express Self and Social Identity, Any One?,",
          "year": 2009,
          "full_citation": "Tan, W. K., and Teo, H. H. \"Blogging to Express Self and Social Identity, Any One?,\" in Proceedings of the 17th European Conference on Information Systems (ECIS), Verona, Italy, June 8-10, 2009, Paper 42."
        },
        {
          "title": "Training Students to be Innovative Information Systems Developers: Synergizing Project-based Learning with Problem-based Learning,",
          "year": 2009,
          "full_citation": "Tan, W. K., and Teo, H. H. \"Training Students to be Innovative Information Systems Developers: Synergizing Project-based Learning with Problem-based Learning,\" in Proceedings of the 47th ACM SIGMIS Computer Personnel Research Conference (SIGMIS-CPR), Limerick, Ireland, May 28-30, 2009, pp. 19-32. [2009 Magid Igbaria Outstanding Conference Paper of the Year Nominee]"
        }
      ],
      "publications_count": 11,
      "awards": [
        "Annual Teaching Excellence Award Honour Roll, 2024",
        "Annual Teaching Excellence Award, 2019",
        "Annual Teaching Excellence Award, 2023",
        "Faculty Teaching Excellence Award Honour Roll, 2023",
        "Faculty Teaching Excellence Award, 2022",
        "Annual Teaching Excellence Award, 2021",
        "Faculty Teaching Excellence Award, 2020",
        "Faculty Teaching Excellence Award, 2019",
        "Crystal Service Award, WorldSkills Singapore Council (WSSC), 2018",
        "Faculty Teaching Excellence Award, 2018",
        "The Commendation Medal (Pingat Kepujian), 2017",
        "Annual Teaching Excellence Award Honour Roll, 2013",
        "Annual Teaching Excellence Award, 2012",
        "Annual Teaching Excellence Award, 2011",
        "Faculty Teaching Excellence Award Honour Roll, 2011",
        "Faculty Teaching Excellence Award, 2011",
        "Annual Teaching Excellence Award, 2010",
        "Faculty Teaching Excellence Award, 2010",
        "Faculty Teaching Excellence Award, 2009",
        "Faculty Best Teaching Assistant Award, 2008",
        "Lee Kuan Yew Award for Mathematics and Science, 2001"
      ],
      "awards_count": 21,
      "courses": []
    },
    {
      "name": "TEO Hock Hai",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/teohh",
      "appointment": "Provost's Chair Professor",
      "additional_titles": [
        "Director (Humanities & Social Sciences Research), NUS Office of the Deputy President"
      ],
      "office": "COM2-04-08",
      "phone": "651 62979",
      "email": "teohh@comp.nus.edu.sg",
      "personal_page": "https://www.comp.nus.edu.sg/~teohh",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/teohh.jpg",
      "profile": "Hock-Hai Teo is Provost's Chair Professor of Information Systems. He served as the Head of the Department of Information Systems at the School of Computing, National University of Singapore from August 2008 to June 2015 and as Vice-Dean, Corporate Communications from August 2007 to August 2008. His current research interests focus mainly on Health Informatics, open innovation, and IT artifacts that are geared towards improving individual decision-making, health outcomes and educational outcomes. Dr. Teo has published broadly in journals such as the ACM Transactions on Computer-Human Interactions, MIS Quarterly, Journal of Management Information Systems,Information Systems Research, IEEE Transactions on Engineering Management,International Journal of Human-Computer Studies, and Information and Management and has presented at numerous international conferences,including the International Conference on Information Systems. He is currently serving or has served on the editorial boards of Data Base for Advances in Information Systems, European Journal of Information Systems, International Journal of Electronic Commerce, Information Systems Research, IEEE Transactions on Engineering Management and MIS Quarterly. He has won numerous best paper award at conferences and was also the winner of the MIS Quarterly Reviewer of the Year (2004) award.",
      "education": [
        "Ph.D. (Information Systems, National University of Singapore)",
        "M.Sc. (Computer & Information Sciences, National University of Singapore)",
        "B.Sc. (Computer & Information Sciences, Honours, National University of Singapore)"
      ],
      "research_areas": [
        "Healthcare Informatics",
        "Digital Transformation, Platforms & Innovation",
        "Computational Social Science",
        "Intelligent Systems"
      ],
      "research_interests": [
        "Health Informatics",
        "Innovation Assimilation",
        "IT Artifacts and Information Processing",
        "Information Technology Adoption",
        "Open Innovation",
        "Design and Implementation of IT artifacts",
        "Electronic Markets",
        "Virtual Community",
        "Information privacy"
      ],
      "research_projects": [
        {
          "title": "Multilingual Acoustic Predictors of Dementia in Singapore: A Machine Learning Approach",
          "description": "This research focuses on developing the Cognify tool for early dementia detection using acoustic features from voice recordings. It aims to create a culturally sensitive model incorporating Singlish, Malay, and Chinese language, addressing linguistic gaps in existing Western-centric studies. The goal is to improve non-invasive, early dementia prediction in Singapore.",
          "tags": [
            "Digital Transformation, Platforms & Innovation,Healthcare Informatics"
          ]
        },
        {
          "title": "QuitTogether: A Technology-Based \"Narrative Therapist\" for Smoking Cessation",
          "description": "QuitTogether addresses the global health burden of smoking-related health issues. It recognizes differing views on agency in addiction treatment and uses Narrative Therapy techniques to enable smokers to construct healthier life stories, aiding in quitting smoking.",
          "tags": [
            "Healthcare Informatics"
          ]
        },
        {
          "title": "EMPOWERing Patients with Type 2 Diabetes Mellitus (T2DM) in Primary Care through App-based Motivational Interviewing",
          "description": "Enhancing diabetes management involves a mobile app-based approach. By combining motivational interviewing (MI) and AI-powered nudges, we empower behavior change and shared decision-making in patients with type 2 diabetes mellitus (T2DM).",
          "tags": [
            "Healthcare Informatics"
          ]
        },
        {
          "title": "AI Over-reliance in Education",
          "description": "The project investigates whether ChatGPT fosters student over-reliance, potentially impacting learning outcomes. Its goal is to comprehend AI's influence and propose effective integration strategies in education.",
          "tags": [
            "Digital Transformation, Platforms & Innovation"
          ]
        },
        {
          "title": "Implementation of Empowering Diabetic Patients",
          "description": "Enhancing diabetes care through EMPOWER app upgrades, integrating wearables, expanding food database, AI health coaching, and continuous glucose monitoring for select participants.",
          "tags": [
            "Healthcare Informatics"
          ]
        }
      ],
      "phd_alumni": [],
      "publications": [
        {
          "title": "Lin, J, Wei, K.K, Teo, H.H, and Chan, H.C. “Comparing Competing Systems: An Extension of Information Systems Continuance Model,” 2016, Conditionally A",
          "year": 2016,
          "full_citation": "Lin, J, Wei, K.K, Teo, H.H, and Chan, H.C. “Comparing Competing Systems: An Extension of Information Systems Continuance Model,” 2016, Conditionally Accepted,MIS Quarterly."
        },
        {
          "title": "Tong. Y, Tan, C.H., and Teo, H.H. “Direct and Indirect Information System Use: A Multi-Method Exploration of Social Power Antecedents in Healthcare,” ",
          "year": 2016,
          "full_citation": "Tong. Y, Tan, C.H., and Teo, H.H. “Direct and Indirect Information System Use: A Multi-Method Exploration of Social Power Antecedents in Healthcare,” 2016, Conditionally Accepted,Information Systems Research."
        },
        {
          "title": "Comparing Potential and Actual Innovators: An Empirical Study of Mobile Data Services Innovation",
          "year": 2015,
          "full_citation": "Kankanhalli, A., Ye, H., and Teo, H. H. \"Comparing Potential and Actual Innovators: An Empirical Study of Mobile Data Services Innovation\", Volume 39, No. 3, 2015,MIS Quarterly, pp. 667-682"
        },
        {
          "title": "Tong. Y., Tan, S.S.L. and Teo, H.H., “The Road to Early Success: Impact of System Use in the Swift Response Phase,” Volume 26, No. 2, 2015,Information",
          "year": 2015,
          "full_citation": "Tong. Y., Tan, S.S.L. and Teo, H.H., “The Road to Early Success: Impact of System Use in the Swift Response Phase,” Volume 26, No. 2, 2015,Information Systems Research, pp. 418-436 Meritorious Mention Award 2016 by Association of Information Systems SIG-Health"
        },
        {
          "title": "Conceptualizing and Testing a Social Cognitive Model of Digital Divide,",
          "year": 2011,
          "full_citation": "Wei, K.K., Teo, H.H., Chan, H.C. and Tan, B.C.Y. \"Conceptualizing and Testing a Social Cognitive Model of Digital Divide,\" Volume 22, Number 1, 2011,Information Systems Research, pp.170-187."
        },
        {
          "title": "The Role of Push-Pull Technology in Privacy Calculus: The Case of Location-Based Services,",
          "year": 2010,
          "full_citation": "Xu, H., Teo, H. H., Tan, B.C.Y., and Agarwal, R. \"The Role of Push-Pull Technology in Privacy Calculus: The Case of Location-Based Services,\" Volume 26, Number 3, 2010,Journal of Management Information Systems, pp. 137-176."
        },
        {
          "title": "Assessing Screening and Evaluation Decision Support Systems: A Resource Matching Perspective,",
          "year": 2010,
          "full_citation": "Tan, C.H., Teo, H. H., and Benbasat, I. \"Assessing Screening and Evaluation Decision Support Systems: A Resource Matching Perspective,\" Volume 21, Number 2, 2010,Information Systems Research, pp. 305-326."
        },
        {
          "title": "Evaluating the Boundary Conditions of the Technology Acceptance Model: An Exploratory Investigation,",
          "year": 2007,
          "full_citation": "Chan, H.C. and Teo, H.H. \"Evaluating the Boundary Conditions of the Technology Acceptance Model: An Exploratory Investigation,\"ACM Transactions on Computer-Human Interaction, Volume 14, Number 2, 2007, Article 9."
        },
        {
          "title": "The Value of Privacy Assurance: An Exploratory Field Experiment,",
          "year": 2007,
          "full_citation": "Hui, K.L., Teo, H.H. and Lee, T.S.Y. \"The Value of Privacy Assurance: An Exploratory Field Experiment,\"MIS Quarterly, Volume 31, Number 1, 2007, pp. 19-33."
        },
        {
          "title": "Predicting Intention to Adopt Interorganizational Linkages: An Institutional Perspective,",
          "year": 2003,
          "full_citation": "Teo, H.H., Wei, K.K., and Benbasat, I. \"Predicting Intention to Adopt Interorganizational Linkages: An Institutional Perspective,\"MIS Quarterly, 2003, Volume 27, Number 1, pp. 1-31."
        },
        {
          "title": "Organizational Transformation using Electronic Data Interchange: The Case of TradeNet in Singapore,",
          "year": 1997,
          "full_citation": "Teo, H. H., Tan, B.C.Y., and Wei, K.K. \"Organizational Transformation using Electronic Data Interchange: The Case of TradeNet in Singapore,\"Journal of Management Information Systems, 1997, Volume 13, Number 4, pp. 139-165"
        }
      ],
      "publications_count": 11,
      "awards": [],
      "awards_count": 0,
      "courses": []
    },
    {
      "name": "WANG QIUHONG",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/wangqh",
      "appointment": "Senior Lecturer (Educator Track)",
      "additional_titles": [
        "Assistant Dean, Undergraduate Studies"
      ],
      "office": "COM3-02-36",
      "phone": "660 17642",
      "email": "wangqh@comp.nus.edu.sg",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/wangqh.jpg",
      "profile": "Qiuhong specialises in the economics of information systems, with a focus on cybercrime policy analytics. Her research examines the effects and mechanisms of cybercrime enforcement, including frameworks such as the Convention on Cybercrime and the Computer Misuse Act. She leverages interdisciplinary approaches that combine artificial intelligence, economics, and econometrics to derive policy and business insights from big data. \n\nHer work has been published in leading academic journals including MIS Quarterly, Information Systems Research, Journal of Management Information Systems, Communications of the ACM, Decision Support Systems, Information Systems Frontier, IEEE Security & Privacy, and Electronic Commerce Research and Applications.",
      "education": [],
      "research_areas": [
        "Security",
        "Healthcare Informatics",
        "Computational Social Science",
        "Data Science & Business Analytics"
      ],
      "research_interests": [
        "Legal Aspects of Information Technology",
        "Economics of Information System",
        "Recommendation System"
      ],
      "research_projects": [],
      "phd_alumni": [],
      "publications": [
        {
          "title": "Chilling Effect of the Enforcement of Computer Misuse Act: Evidence from Publicly Accessible Hack Forums,",
          "year": 2024,
          "full_citation": "WANG, Qiu-Hong; GENG, Ruibin; KIM, Seung-Hyun. (2024). \"Chilling Effect of the Enforcement of Computer Misuse Act: Evidence from Publicly Accessible Hack Forums,\" Information Systems Research, 35(3):1195-1215."
        },
        {
          "title": "WANG, Qiu-Hong; MILLER, Steven; DENG, Robert H. (2020). “Driving Cybersecurity Policy Insights from Information on the Internet,” IEEE Security & Priv",
          "year": 2020,
          "full_citation": "WANG, Qiu-Hong; MILLER, Steven; DENG, Robert H. (2020). “Driving Cybersecurity Policy Insights from Information on the Internet,” IEEE Security & Privacy, 18(6), 42-50."
        },
        {
          "title": "YUE, Wei Thoo; WANG, Qiu‐Hong; HUI, Kai‐Lung. (2019). “See no evil, hear no evil? Dissecting the impact of online hacker forums,” MIS Quarterly, 43 (1",
          "year": 2019,
          "full_citation": "YUE, Wei Thoo; WANG, Qiu‐Hong; HUI, Kai‐Lung. (2019). “See no evil, hear no evil? Dissecting the impact of online hacker forums,” MIS Quarterly, 43 (1), 73-95."
        },
        {
          "title": "How to derive causal insights for digital commerce in China? A research commentary on computational social science methods,",
          "year": 2019,
          "full_citation": "PHANG, David C.W., WANG, Kanliang, WANG, Qiuhong, KAUFFMAN, Robert J. , NALDI, Maurizio. (2019).\n\"How to derive causal insights for digital commerce in China? A research commentary on computational social science methods,\" Electronic Commerce Research and Applications,\nVolume 35, 1-16."
        },
        {
          "title": "WANG, Qiu-Hong; HUI, Kai-Lung. (2017). “Technology mergers and acquisitions in the presence of an installed base: A strategic analysis,” Information S",
          "year": 2017,
          "full_citation": "WANG, Qiu-Hong; HUI, Kai-Lung. (2017). “Technology mergers and acquisitions in the presence of an installed base: A strategic analysis,” Information Systems Research, 28 (1), 46-63."
        },
        {
          "title": "HUI, Kai-Lung; KIM, Seung-Hyun; WANG, Qiu-Hong. (2017). “Cybercrime deterrence and international legislation: Evidence from distributed denial of serv",
          "year": 2017,
          "full_citation": "HUI, Kai-Lung; KIM, Seung-Hyun; WANG, Qiu-Hong. (2017). “Cybercrime deterrence and international legislation: Evidence from distributed denial of service attacks,” MIS Quarterly, 41 (2), 497-523."
        },
        {
          "title": "WANG, Qiu-Hong; MAYER-SCHONBERGER, Viktor; YANG, Xue. (2013). “The determinants of monetary value of virtual goods: An empirical study for a cross-sec",
          "year": 2013,
          "full_citation": "WANG, Qiu-Hong; MAYER-SCHONBERGER, Viktor; YANG, Xue. (2013). “The determinants of monetary value of virtual goods: An empirical study for a cross-section of MMORPGs,” Information Systems Frontiers, 15 (3), 481-495."
        },
        {
          "title": "WANG, Qiu-Hong; HUI, Kai-Lung. (2012). “Delayed product introduction,” Decision Support Systems, 53 (4), 870-880.",
          "year": 2012,
          "full_citation": "WANG, Qiu-Hong; HUI, Kai-Lung. (2012). “Delayed product introduction,” Decision Support Systems, 53 (4), 870-880."
        },
        {
          "title": "KIM, Seung-Hyun; WANG, Qiu-Hong; ULLRICH, Johannes B.. (2012). “A comparative study of cyberattacks,” Communications- ACM, 55 (3), 66-73.",
          "year": 2012,
          "full_citation": "KIM, Seung-Hyun; WANG, Qiu-Hong; ULLRICH, Johannes B.. (2012). “A comparative study of cyberattacks,” Communications- ACM, 55 (3), 66-73."
        },
        {
          "title": "PNG, Ivan Paak Liang; WANG, Qiu-Hong. (2009). “Information security: Facilitating user precautions vis-a-vis enforcement against attackers,” Journal o",
          "year": 2009,
          "full_citation": "PNG, Ivan Paak Liang; WANG, Qiu-Hong. (2009). “Information security: Facilitating user precautions vis-a-vis enforcement against attackers,” Journal of Management Information Systems, 26 (2), 97-121."
        },
        {
          "title": "PNG, Ivan Paak Liang; WANG, Chen-Yu; WANG, Qiu-Hong. (2008). “The deterrent and displacement effects of information security enforcement: Internationa",
          "year": 2008,
          "full_citation": "PNG, Ivan Paak Liang; WANG, Chen-Yu; WANG, Qiu-Hong. (2008). “The deterrent and displacement effects of information security enforcement: International evidence,” Journal of Management Information Systems, 25 (2), 125-144."
        },
        {
          "title": "ZHOU, Fang; WANG, Qiu-Hong; TEO, Hock Hai. (2019). “Direct and Spillover Effects of Patient Access to Health Information Exchange on Medical Costs: A ",
          "year": 2019,
          "full_citation": "ZHOU, Fang; WANG, Qiu-Hong; TEO, Hock Hai. (2019). “Direct and Spillover Effects of Patient Access to Health Information Exchange on Medical Costs: A Natural Experiment,” Proceedings of the 40th International Conference on Information Systems (ICIS), Munich, Germany, 2019 December 15-17."
        },
        {
          "title": "LUO, Kai; WANG, Qiu-Hong; TEO, Hock Hai; CHEN, Xi. (2018). “Better inpatient health quality at lower cost: Should I participate in the online healthca",
          "year": 2018,
          "full_citation": "LUO, Kai; WANG, Qiu-Hong; TEO, Hock Hai; CHEN, Xi. (2018). “Better inpatient health quality at lower cost: Should I participate in the online healthcare community first?” Proceedings of the 39th International Conference on Information Systems (ICIS), San Francisco, California, USA, 2018 December 13-16, (pp. 1-17)."
        },
        {
          "title": "WANG, Qiu-Hong; ZHANG, Le-Ting; QIAO, Meng-Ke. (2017). “Online hacker forum censorship: Would banning the bad guys attract good guys?” Hawaii Internat",
          "year": 2017,
          "full_citation": "WANG, Qiu-Hong; ZHANG, Le-Ting; QIAO, Meng-Ke. (2017). “Online hacker forum censorship: Would banning the bad guys attract good guys?” Hawaii International Conference on System Sciences HICSS-50: 4-7 January 2017, pp. 5619-5628."
        },
        {
          "title": "OOI, Kok Wei; KIM, Seung Hyun; WANG, Qiu-Hong; HUI, Kai-Lung. (2012). “Do hackers seek variety? An empirical analysis of website defacements,” Proceed",
          "year": 2012,
          "full_citation": "OOI, Kok Wei; KIM, Seung Hyun; WANG, Qiu-Hong; HUI, Kai-Lung. (2012). “Do hackers seek variety? An empirical analysis of website defacements,” Proceedings of the 33rd International Conference on Information Systems (ICIS), Orlando, December 16-19, (pp. 1-10) Atlanta, GA: AIS (Best Research-in-Progress Paper Runner-up Award)."
        },
        {
          "title": "WANG, Qiu-Hong; KIM, Seung Hyun. (2009). ”Cyber attacks: Does physical boundary matter?,” Proceedings of 30th Annual International Conference on Infor",
          "year": 2009,
          "full_citation": "WANG, Qiu-Hong; KIM, Seung Hyun. (2009). ”Cyber attacks: Does physical boundary matter?,” Proceedings of 30th Annual International Conference on Information Systems (ICIS), Phoenix, AZ, December 15-18, (pp. 1-18) Atlanta, GA: AIS."
        },
        {
          "title": "WANG, Qiu-Hong; KIM, Seung-Hyun. (2009). “Cyber attacks: Cross-country interdependence and enforcement,” Proceedings of the 8th Workshop on Economics ",
          "year": 2009,
          "full_citation": "WANG, Qiu-Hong; KIM, Seung-Hyun. (2009). “Cyber attacks: Cross-country interdependence and enforcement,” Proceedings of the 8th Workshop on Economics of Information Security (WEIS), London, June 24-25, 2009, (pp. 1-16) Cambridge: WEIS."
        },
        {
          "title": "WANG, Qiu-Hong; HUI, Kai-Lung. (2005). “To launch or not to launch: An economic analysis of delayed product introduction,” Hawaii International Confer",
          "year": 2005,
          "full_citation": "WANG, Qiu-Hong; HUI, Kai-Lung. (2005). “To launch or not to launch: An economic analysis of delayed product introduction,” Hawaii International Conference on System Sciences HICSS-38: 6-9 January 2005, pp. 213."
        }
      ],
      "publications_count": 18,
      "awards": [
        "Della Suantio Fellowship, Singapore Management University, 2018",
        "Lee Kong Chian Fellowship for Research Excellence, Singapore Management University, 2017",
        "New Century Talents Award, Ministry of Education, P.R. China, 2012",
        "“Marginal deterrence in the enforcement of law: Evidence from distributed denial of service attack,” Workshop on Analytics for Business, Consumer and Social Insights (BCSI). 5 August 2013, Singapore. (Best Faculty Research Paper Award)",
        "Award of ICIS 2005 Doctoral Consortium Fellow, Las Vegas, Nevada, December 2005",
        "The President's Graduate Fellowship, National University of Singapore, 2002"
      ],
      "awards_count": 6,
      "courses": []
    },
    {
      "name": "YANG Lu",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/yanglu",
      "appointment": "Senior Lecturer (Educator Track)",
      "additional_titles": [],
      "office": "COM2-02-46",
      "phone": "651 66791",
      "email": "yanglu@comp.nus.edu.sg",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/yanglu.jpg",
      "profile": "Dr. Yang Lu is a Lecturer at the Department of Information Systems and Analytics at National University of Singapore (NUS). She graduated with Bachelor of Engineering in Information Systems from Renmin University of China and PhD in Information Systems from National University of Singapore. She currently teaches undergraduate courses in Management of Information Systems, Information Security Management, Computing and Society, and Computing Basics.",
      "education": [
        "Ph.D. (Information Systems, National University of Singapore)"
      ],
      "research_areas": [],
      "research_interests": [
        "Online Consumer Behavior",
        "Human and Computer Interaction",
        "Social Media",
        "Online Community"
      ],
      "research_projects": [],
      "phd_alumni": [],
      "publications": [
        {
          "title": "Lu Yang, Jin Chen, and Bernard C.Y.Tan, “The Reviewer Matters: A Study of Online Pictorial Reviews.”Proceedings of 36th International Conference on In",
          "year": 2015,
          "full_citation": "Lu Yang, Jin Chen, and Bernard C.Y.Tan, “The Reviewer Matters: A Study of Online Pictorial Reviews.”Proceedings of 36th International Conference on Information Systems ICIS 2015, Fort Worth, Texas, USA, 13-16 Dec, 2015."
        },
        {
          "title": "Lu Yang, Jin Chen, and Bernard C.Y.Tan, “Effects of Social Distances and Matching Message Orientation on Consumers’ Product Evaluation.”Proceedings of",
          "year": 2014,
          "full_citation": "Lu Yang, Jin Chen, and Bernard C.Y.Tan, “Effects of Social Distances and Matching Message Orientation on Consumers’ Product Evaluation.”Proceedings of 16th HCI International Conference HCII 2014, Crete, Greece, 22-27 June 2014."
        },
        {
          "title": "Lu Yang, Jin Chen, and Bernard C.Y.Tan, “Effects of Social Similarity on Consumers’ Product Evaluation.”Proceedings of the IFIP WG 8.2 OASIS Workshop,",
          "year": 2013,
          "full_citation": "Lu Yang, Jin Chen, and Bernard C.Y.Tan, “Effects of Social Similarity on Consumers’ Product Evaluation.”Proceedings of the IFIP WG 8.2 OASIS Workshop, Milan, Italy, 14 December 2013."
        },
        {
          "title": "Lu Yang and Bernard C.Y.Tan, “Self-Disclosure on Online Social Networks: Motives, Context Feature, and Media Capabilities.”Proceedings of 33th Interna",
          "year": 2012,
          "full_citation": "Lu Yang and Bernard C.Y.Tan, “Self-Disclosure on Online Social Networks: Motives, Context Feature, and Media Capabilities.”Proceedings of 33th International Conference on Information Systems ICIS 2012, Orlando, USA, 16-19 Dec, 2012."
        }
      ],
      "publications_count": 4,
      "awards": [],
      "awards_count": 0,
      "courses": []
    },
    {
      "name": "YEO Wee Kiang",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/weekiang",
      "appointment": "Senior Lecturer (Educator Track)",
      "additional_titles": [],
      "office": "COM2-04-17",
      "phone": "651 64262",
      "email": "weekiang@comp.nus.edu.sg",
      "personal_page": "https://www.comp.nus.edu.sg/disa/people/weekiang",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/weekiang.jpg",
      "profile": "Dr Yeo Wee Kiang is a Senior Lecturer at the School of Computing, National University of Singapore (NUS), where he specialises in artificial intelligence, data science and machine learning. He is a member of the NUS Artificial Intelligence Institute and actively works on applying large language models (LLMs) and generative AI to improve learning experiences and outcomes.\n\nHe teaches several analytics and AI-focused modules, including BT4221, BT5151 and IS5126. A key addition to his portfolio is the upcoming course IS4401 Generative AI and Business Applications, which covers transformer models, conversational AI, RAG pipelines, fine-tuning, agentic AI systems, the Model Context Protocol (MCP), and text-to-image generation using GANs and diffusion models. Another new course, TCX3213, focuses on data mining and machine learning in business analytics.\n\nDr Yeo’s recent research focuses on applying LLMs to education and career development. In a Ministry of Education-funded study, LLMs are used to support nursing undergraduates by generating personalised research guidance and reducing academic stress. He also supervised the development of a multi-agent system where LLMs manage tutoring and career advisory tasks. Another project used LLMs in a zero-shot setting for question generation aligned with learning objectives. In a separate study, LLMs were combined with skills graphs and RAG pipelines to generate personalised learning paths for adult upskilling. These projects were presented at the Higher Education Conference in Singapore (HECS) 2024.\n\nHe holds a PhD from NUS, where his research focused on machine learning and data mining for drug discovery in collaboration with a multinational pharmaceutical firm. This work laid the foundation for his interest in applied AI. Prior to his current academic appointment, Dr Yeo taught data analytics and programming at the NUS Faculty of Arts and Social Sciences and Nanyang Business School. He also served as Lead Instructor in data science for adult learners in Singapore, Hong Kong and Sydney. Earlier, he held an industry role as Director of Data Science at a food technology start-up, where he led AI initiatives to enhance product nutrition using machine learning.\n\nDr Yeo is an AWS Academy Educator, a graduate of AI Singapore’s LLM Application Developer Programme, and holds the WSQ Advanced Certificate in Training and Assessment (ACTA). He was part of a team recognised with the Spark Award by the Institute for Adult Learning Singapore in 2017 for work related to innovation in continuing education. In 2012, he received the Best Graduate Researcher in Pharmacy award from NUS for research work in partnership with the Novartis Institute for Tropical Diseases.\n\nDr Yeo works at the intersection of technology and education, focusing on how AI can improve the way people learn. His research and teaching aim to equip learners with practical skills while addressing how education systems can adapt to AI-driven change. He is especially focused on how AI can adapt to diverse learning needs, and make education more purposeful in a changing world.",
      "education": [
        "Ph.D. (National University of Singapore, 2013)"
      ],
      "research_areas": [
        "Data Science & Business Analytics",
        "Intelligent Systems"
      ],
      "research_interests": [
        "Application of Large Language Models (LLMs) to enhance teaching and learning"
      ],
      "research_projects": [
        {
          "title": "Leveraging large language models (LLM) to enhance research competency, academic motivation, and alleviate academic stress among undergraduate nursing students: A novel approach to research education",
          "description": "This Ministry of Education-funded project (Tertiary Research Fund, 2025–2028) investigates how large language models (LLMs) can improve research competency, motivation and reduce academic stress among undergraduate nursing students. It explores the use of LLMs to provide personalised, on-demand support in research learning, aiming to make research education more accessible, engaging and adaptive.",
          "tags": []
        },
        {
          "title": "Development of a Swarm of Autonomous AI Agents for Educational and Career Advisory Roles",
          "description": "This project targets the development of a swarm of autonomous AI agents, with a focus on leveraging Large Language Models (LLMs) for specific roles in the education and career advisory domains. The project involves designing and integrating three specialised AI agents: an AI Teacher, a Time Scheduler/Manager, and a Career Coach, each underpinned by advanced LLM technology.",
          "tags": []
        }
      ],
      "phd_alumni": [],
      "publications": [],
      "publications_count": 0,
      "awards": [],
      "awards_count": 0,
      "courses": []
    },
    {
      "name": "Francis YEOH Song Chian",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/fyeoh",
      "appointment": "Professorial Fellow",
      "additional_titles": [
        "Chairman, Innovation & Entrepreneurship"
      ],
      "office": "COM2-04-24",
      "phone": "651 61298",
      "email": "fyeoh@comp.nus.edu.sg",
      "personal_page": "https://www.comp.nus.edu.sg/~fyeoh",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/fyeoh.jpg",
      "profile": "In a career spanning over 30 years,Francis has been involved in various aspects of R&D, technology management, startup companies, venture funding, innovation and entrepreneurship. He had been a research scientist, research institute director, internet startup CEO, investor, professor and government policy maker.\n\nHe stepped down as the first CEO of the National Research Foundation (NRF) of Singapore in 2012 after more than 6 years.   While at the NRF, he initiated and implemented many new national initiatives in research, innovation and enterprise, including major international research collaborations, national innovation challenges, proof-of-concept grants, early stage venture funds and technology incubation programmes. \n\nHe is presently Professorial Fellow for Entrepreneurship at the School of Computing, National University of Singapore (NUS), overseeing the school’s entrepreneurship efforts, teaching entrepreneurship and mentoring university startup companies.  He is also Executive Director for the Mediapreneur Incubator, a corporate incubation programme for media startups under national media company, Mediacorp Pte Ltd. He has served for many years on panels awarding startup grants as well as grants to social enterprises. \n\nHe holds a B Sc (Hon) and PhD in Electrical Engineering, from Loughborough University (UK) and a Masters in Management from MIT Sloan.",
      "education": [
        "Ph.D. (Electrical Engineering, Loughborough University)",
        "M.Sc. (Management, Massachusetts Institute of Technology)",
        "B.Sc. (Electrical Engineering, Loughborough University)"
      ],
      "research_areas": [],
      "research_interests": [
        "Startup Eco-system",
        "Entrepreneurship Education",
        "Sharing Economy"
      ],
      "research_projects": [],
      "phd_alumni": [],
      "publications": [],
      "publications_count": 0,
      "awards": [],
      "awards_count": 0,
      "courses": []
    },
    {
      "name": "ZHAI Yingda",
      "profile_url": "https://www.comp.nus.edu.sg/disa/people/zhaiyd",
      "appointment": "Assistant Professor",
      "additional_titles": [],
      "office": "COM3-02-33",
      "phone": "660 12365",
      "email": "zhaiyd@comp.nus.edu.sg",
      "avatar_url": "https://www.comp.nus.edu.sg/~sochr/www/stfphotos/zhaiyd.jpg",
      "profile": "Yingda Zhai is an Assistant Professor in the Department of Information Systems and Analytics at the School of Computing at the National University of Singapore (NUS). Prior to joining NUS, he earned his PhD and MSc in Economics from The University of Texas at Austin.\n\nHis research concentrates on the topics in economics of information systems, including pricing and contract theory, IT market design, queueing theory, cloud computing and the ride-sharing industry. His primary research interest lies in understanding the pricing, resource allocation, and market design of the IT industry where information system plays a pivotal role.",
      "education": [],
      "research_areas": [
        "Digital Transformation, Platforms & Innovation",
        "Computational Social Science"
      ],
      "research_interests": [
        "Economic of information systems",
        "Information design in digital economy",
        "Dynamic pricing and queuing games",
        "Social media and morality"
      ],
      "research_projects": [
        {
          "title": "The Value of Social Connection and Trust in Online Societies",
          "description": "This project investigates trust's role in bridging online divides and boosting social commerce. It investigates empathy's impact on polarization and analyzes data to understand trust's societal and economic benefits, aiming to inform strategies for combating online tribalism.",
          "tags": [
            "Computational Social Science"
          ]
        },
        {
          "title": "Efficient Pricing and Information Design of Digital Economies",
          "description": "This project explores how to improve efficiency and profit in digital economies with limited resources. The goal is to find the best way to manage information and pricing to optimize resource allocation and profit, potentially benefiting both businesses and users.",
          "tags": [
            "Digital Transformation, Platforms & Innovation"
          ]
        }
      ],
      "phd_alumni": [],
      "publications": [],
      "publications_count": 0,
      "awards": [
        "Faculty Teaching Excellence Award 2021, 2022"
      ],
      "awards_count": 1,
      "courses": []
    }
  ]
}